In [ ]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [ ]:
%%capture
# Installs Unsloth, Xformers (Flash Attention) and all other packages!
!pip install "unsloth[colab-new] @ git+https://github.com/unslothai/unsloth.git"
!pip install --no-deps "xformers<0.0.26" trl peft accelerate bitsandbytes

# **Gemma_2b**

In [ ]:
# from unsloth import FastLanguageModel
# import torch
# max_new_tokens = 600
# max_seq_length = 1024
# dtype = None
# load_in_4bit = True

# model, tokenizer = FastLanguageModel.from_pretrained(
#     model_name = "unsloth/gemma-2b-bnb-4bit",
#     max_seq_length = max_seq_length,
#     dtype = dtype,
#     load_in_4bit = load_in_4bit,
# )

# **Gemma_7b**

In [ ]:
# from unsloth import FastLanguageModel
# import torch
# max_new_tokens = 600
# max_seq_length = 1024
# dtype = None
# load_in_4bit = True

# model, tokenizer = FastLanguageModel.from_pretrained(
#     model_name = "unsloth/gemma-7b-bnb-4bit",
#     max_seq_length = max_seq_length,
#     dtype = dtype,
#     load_in_4bit = load_in_4bit,
#)

# **Gemma 7b Finetuned**

In [ ]:
# from unsloth import FastLanguageModel
# from datasets import load_dataset

# max_new_tokens = 600
# max_seq_length = 1024
# dtype = None
# load_in_4bit = True

# data_col = "question"

# model, tokenizer = FastLanguageModel.from_pretrained(
#     model_name = "/content/drive/MyDrive/NLP/gemma_spider_lora_model_2",
#     max_seq_length = max_seq_length,
#     dtype = dtype,
#     load_in_4bit = load_in_4bit,
# )

# **Gemma 2b Finetuned**

In [ ]:
#Megha
from unsloth import FastLanguageModel
from datasets import load_dataset

max_new_tokens = 600
max_seq_length = 1024
dtype = None
load_in_4bit = True

data_col = "question"

model, tokenizer = FastLanguageModel.from_pretrained(
    model_name = "/content/drive/MyDrive/NLP/gemma2B_spider_lora_model",
    max_seq_length = max_seq_length,
    dtype = dtype,
    load_in_4bit = load_in_4bit,
)

/usr/local/lib/python3.10/dist-packages/huggingface_hub/file_download.py:1132: FutureWarning: `resume_download` is deprecated and will be removed in version 1.0.0. Downloads always resume when possible. If you want to force a new download, use `force_download=True`.
  warnings.warn(

config.json:   0%|          | 0.00/1.11k [00:00<?, ?B/s]

==((====))==  Unsloth: Fast Gemma patching release 2024.5
   \\   /|    GPU: Tesla T4. Max memory: 14.748 GB. Platform = Linux.
O^O/ \_/ \    Pytorch: 2.2.1+cu121. CUDA = 7.5. CUDA Toolkit = 12.1.
\        /    Bfloat16 = FALSE. Xformers = 0.0.25.post1. FA = False.
 "-____-"     Free Apache license: http://github.com/unslothai/unsloth

Unused kwargs: ['_load_in_4bit', '_load_in_8bit', 'quant_method']. These kwargs are not used in <class 'transformers.utils.quantization_config.BitsAndBytesConfig'>.

model.safetensors:   0%|          | 0.00/2.07G [00:00<?, ?B/s]

Gemma's activation function should be approximate GeLU and not exact GeLU.
Changing the activation function to `gelu_pytorch_tanh`.if you want to use the legacy `gelu`, edit the `model.config` to set `hidden_activation=gelu`   instead of `hidden_act`. See https://github.com/huggingface/transformers/pull/29402 for more details.

generation_config.json:   0%|          | 0.00/137 [00:00<?, ?B/s]

Unsloth 2024.5 patched 18 layers with 18 QKV layers, 18 O layers and 18 MLP layers.

In [ ]:
import pandas as pd
spider_prompt = """"Write a query that answers the following question. Return only the query and no additional explanation."

<question> {} <query> {}"""

def formatting_prompts_func(examples):
    questions = examples["question"]
    texts = []
    for question in questions:
        text = spider_prompt.format(question, "")
        texts.append(text)
    return { "modified question" : texts, }
pass

from datasets import load_dataset
dataset = load_dataset("xlangai/spider", split = "validation")
test_df = pd.DataFrame(dataset)
display(test_df.head())
test_df.info()

Downloading readme:   0%|          | 0.00/5.51k [00:00<?, ?B/s]

Downloading data:   0%|          | 0.00/831k [00:00<?, ?B/s]

Downloading data:   0%|          | 0.00/126k [00:00<?, ?B/s]

Generating train split:   0%|          | 0/7000 [00:00<?, ? examples/s]

Generating validation split:   0%|          | 0/1034 [00:00<?, ? examples/s]

,db_id,query,question,query_toks,query_toks_no_value,question_toks
0,concert_singer,SELECT count(*) FROM singer,How many singers do we have?,"[SELECT, count, (, *, ), FROM, singer]","[select, count, (, *, ), from, singer]","[How, many, singers, do, we, have, ?]"
1,concert_singer,SELECT count(*) FROM singer,What is the total number of singers?,"[SELECT, count, (, *, ), FROM, singer]","[select, count, (, *, ), from, singer]","[What, is, the, total, number, of, singers, ?]"
2,concert_singer,"SELECT name , country , age FROM singer ORDE...","Show name, country, age for all singers ordere...","[SELECT, name, ,, country, ,, age, FROM, singe...","[select, name, ,, country, ,, age, from, singe...","[Show, name, ,, country, ,, age, for, all, sin..."
3,concert_singer,"SELECT name , country , age FROM singer ORDE...","What are the names, countries, and ages for ev...","[SELECT, name, ,, country, ,, age, FROM, singe...","[select, name, ,, country, ,, age, from, singe...","[What, are, the, names, ,, countries, ,, and, ..."
4,concert_singer,"SELECT avg(age) , min(age) , max(age) FROM s...","What is the average, minimum, and maximum age ...","[SELECT, avg, (, age, ), ,, min, (, age, ), ,,...","[select, avg, (, age, ), ,, min, (, age, ), ,,...","[What, is, the, average, ,, minimum, ,, and, m..."

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1034 entries, 0 to 1033
Data columns (total 6 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   db_id                1034 non-null   object
 1   query                1034 non-null   object
 2   question             1034 non-null   object
 3   query_toks           1034 non-null   object
 4   query_toks_no_value  1034 non-null   object
 5   question_toks        1034 non-null   object
dtypes: object(6)
memory usage: 48.6+ KB

In [ ]:
dataset = dataset.map(formatting_prompts_func, batched = True,)
mod_test_df = pd.DataFrame(dataset)
display(mod_test_df.head())

Map:   0%|          | 0/1034 [00:00<?, ? examples/s]

,db_id,query,question,query_toks,query_toks_no_value,question_toks,modified question
0,concert_singer,SELECT count(*) FROM singer,How many singers do we have?,"[SELECT, count, (, *, ), FROM, singer]","[select, count, (, *, ), from, singer]","[How, many, singers, do, we, have, ?]","""Write a query that answers the following ques..."
1,concert_singer,SELECT count(*) FROM singer,What is the total number of singers?,"[SELECT, count, (, *, ), FROM, singer]","[select, count, (, *, ), from, singer]","[What, is, the, total, number, of, singers, ?]","""Write a query that answers the following ques..."
2,concert_singer,"SELECT name , country , age FROM singer ORDE...","Show name, country, age for all singers ordere...","[SELECT, name, ,, country, ,, age, FROM, singe...","[select, name, ,, country, ,, age, from, singe...","[Show, name, ,, country, ,, age, for, all, sin...","""Write a query that answers the following ques..."
3,concert_singer,"SELECT name , country , age FROM singer ORDE...","What are the names, countries, and ages for ev...","[SELECT, name, ,, country, ,, age, FROM, singe...","[select, name, ,, country, ,, age, from, singe...","[What, are, the, names, ,, countries, ,, and, ...","""Write a query that answers the following ques..."
4,concert_singer,"SELECT avg(age) , min(age) , max(age) FROM s...","What is the average, minimum, and maximum age ...","[SELECT, avg, (, age, ), ,, min, (, age, ), ,,...","[select, avg, (, age, ), ,, min, (, age, ), ,,...","[What, is, the, average, ,, minimum, ,, and, m...","""Write a query that answers the following ques..."

In [ ]:
mod_test_df.shape

(1034, 7)

In [ ]:
import numpy as np
num_splits = 20
mod_test_df_split = np.array_split(mod_test_df, num_splits)

In [ ]:
max_new_tokens = 600
max_seq_length = 1024

output = []
for df in mod_test_df_split:
  FastLanguageModel.for_inference(model)
  print("="*100)
  print(df.shape)
  questions = [i.replace("<eos>","") for i in list(df["modified question"])]
  original_queries = list(df["query"])
  print("Input: ",questions)

  # Tokenize all questions at once with truncation
  tokenizer.padding_side = "left"
  inputs = tokenizer(questions, padding=True, truncation=True, max_length=max_seq_length, return_tensors="pt").to("cuda")
  # inputs = tokenizer(questions, return_tensors="pt").to("cuda")
  # inputs = tokenizer(inputs, return_tensors = "pt", padding = True).to("cuda")
  outputs = model.generate(**inputs, max_new_tokens = max_new_tokens, use_cache = True)

  generated_queries = []
  decoded = tokenizer.batch_decode(outputs)
  for i,text in enumerate(decoded):
    print(f"Original query:\n{original_queries[i]}")
    generated_query = text.replace(tokenizer.pad_token, "").split("<query>")[-1]
    generated_queries.append(generated_query.replace("<eos>",""))
    print(f"Generated query:\n{generated_query}")
    print("_" * 100)
  df["generated_query"] = generated_queries
  display(df)
  output.append(df)

====================================================================================================
(52, 7)
Input:  ['"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> How many singers do we have? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the total number of singers? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Show name, country, age for all singers ordered by age from the oldest to the youngest. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the names, countries, and ages for every singer in descending order of age? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the average, minimum, and maximum age of all singers from France? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the average, minimum, and maximum age for all French singers? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Show the name and the release year of the song by the youngest singer. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the names and release years for all the songs of the youngest singer? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are all distinct countries where singers above age 20 are from? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are  the different countries with singers above age 20? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Show all countries and the number of singers in each country. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> How many singers are from each country? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> List all song names by singers above the average age. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are all the song names by singers who are older than average? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Show location and name for all stadiums with a capacity between 5000 and 10000. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the locations and names of all stations with capacity between 5000 and 10000? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the maximum capacity and the average of all stadiums ? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the average and maximum capacities for all stadiums ? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the name and capacity for the stadium with highest average attendance? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the name and capacity for the stadium with the highest average attendance? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> How many concerts are there in year 2014 or 2015? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> How many concerts occurred in 2014 or 2015? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Show the stadium name and the number of concerts in each stadium. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> For each stadium, how many concerts play there? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Show the stadium name and capacity with most number of concerts in year 2014 or after. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the name and capacity of the stadium with the most concerts after 2013 ? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Which year has most number of concerts? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the year that had the most concerts? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Show the stadium names without any concert. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the names of the stadiums without any concerts? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Show countries where a singer above age 40 and a singer below 30 are from. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Show names for all stadiums except for stadiums having a concert in year 2014. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the names of all stadiums that did not have a concert in 2014? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Show the name and theme for all concerts and the number of singers in each concert. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the names , themes , and number of singers for every concert ? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> List singer names and number of concerts for each singer. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the names of the singers and number of concerts for each person? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> List all singer names in concerts in year 2014. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the names of the singers who performed in a concert in 2014? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> what is the name and nation of the singer who have a song having \'Hey\' in its name? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the name and country of origin of every singer who has a song with the word \'Hey\' in its title? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Find the name and location of the stadiums which some concerts happened in the years of both 2014 and 2015. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the names and locations of the stadiums that had concerts that occurred in both 2014 and 2015? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Find the number of concerts happened in the stadium with the highest capacity . <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the number of concerts that occurred in the stadium with the largest capacity ? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Find the number of pets whose weight is heavier than 10. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> How many pets have a greater weight than 10? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Find the weight of the youngest dog. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> How much does the youngest dog weigh? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Find the maximum weight for each type of pet. List the maximum weight and pet type. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> List the maximum weight and type for each type of pet. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Find number of pets owned by students who are older than 20. <query> ']
Original query:
SELECT count(*) FROM singer
Generated query:


SELECT COUNT(*) FROM singers<eos>
____________________________________________________________________________________________________
Original query:
SELECT count(*) FROM singer
Generated query:


SELECT SUM(singer_count) FROM singers<eos>
____________________________________________________________________________________________________
Original query:
SELECT name ,  country ,  age FROM singer ORDER BY age DESC
Generated query:
 <strong>SELECT name, country, age FROM singers ORDER BY age</strong><eos>
____________________________________________________________________________________________________
Original query:
SELECT name ,  country ,  age FROM singer ORDER BY age DESC
Generated query:


SELECT  singer_name ,  country ,  age  FROM  singer ORDER BY age DESC<eos>
____________________________________________________________________________________________________
Original query:
SELECT avg(age) ,  min(age) ,  max(age) FROM singer WHERE country  =  'France'
Generated query:


SELECT AVG(age) , MIN(age) , MAX(age) FROM singers WHERE country = 'France'<eos>
____________________________________________________________________________________________________
Original query:
SELECT avg(age) ,  min(age) ,  max(age) FROM singer WHERE country  =  'France'
Generated query:
 <strong>SELECT AVG(age), MIN(age), MAX(age) FROM singer WHERE country = 'France'</strong><eos>
____________________________________________________________________________________________________
Original query:
SELECT song_name ,  song_release_year FROM singer ORDER BY age LIMIT 1
Generated query:
 <strong>SELECT</strong>  name ,  release_year  <strong>FROM</strong>  song  <strong>WHERE</strong>  singer_age  =  (  SELECT  min  (  singer_age  )  FROM  song  )<eos>
____________________________________________________________________________________________________
Original query:
SELECT song_name ,  song_release_year FROM singer ORDER BY age LIMIT 1
Generated query:


SELECT  name ,  release_year FROM  songs WHERE  singer_name  =  'youngest'<eos>
____________________________________________________________________________________________________
Original query:
SELECT DISTINCT country FROM singer WHERE age  >  20
Generated query:


SELECT DISTINCT country FROM singers WHERE age > 20<eos>
____________________________________________________________________________________________________
Original query:
SELECT DISTINCT country FROM singer WHERE age  >  20
Generated query:


SELECT DISTINCT country FROM singers WHERE age > 20<eos>
____________________________________________________________________________________________________
Original query:
SELECT country ,  count(*) FROM singer GROUP BY country
Generated query:
 <strong>SELECT country , count(*) FROM singers GROUP BY country</strong><eos>
____________________________________________________________________________________________________
Original query:
SELECT country ,  count(*) FROM singer GROUP BY country
Generated query:


SELECT COUNT(*) FROM singers GROUP BY country<eos>
____________________________________________________________________________________________________
Original query:
SELECT song_name FROM singer WHERE age  >  (SELECT avg(age) FROM singer)
Generated query:
 <strong>SELECT song_name FROM song WHERE singer_age > (SELECT AVG(singer_age) FROM singer)</strong><eos>
____________________________________________________________________________________________________
Original query:
SELECT song_name FROM singer WHERE age  >  (SELECT avg(age) FROM singer)
Generated query:


SELECT  * FROM  song  WHERE  singer_age  >  (SELECT  AVG(singer_age) FROM  singer)<eos>
____________________________________________________________________________________________________
Original query:
SELECT LOCATION ,  name FROM stadium WHERE capacity BETWEEN 5000 AND 10000
Generated query:
 <strong>SELECT location , name FROM stadium WHERE capacity BETWEEN 5000 AND 10000</strong><eos>
____________________________________________________________________________________________________
Original query:
SELECT LOCATION ,  name FROM stadium WHERE capacity BETWEEN 5000 AND 10000
Generated query:


SELECT  station_location ,  station_name FROM  station WHERE  capacity  BETWEEN  5000  AND  10000<eos>
____________________________________________________________________________________________________
Original query:
select max(capacity), average from stadium
Generated query:


SELECT MAX(capacity) , AVG(capacity) FROM stadium<eos>
____________________________________________________________________________________________________
Original query:
select avg(capacity) ,  max(capacity) from stadium
Generated query:


SELECT  AVG(capacity) , MAX(capacity) FROM stadium<eos>
____________________________________________________________________________________________________
Original query:
SELECT name ,  capacity FROM stadium ORDER BY average DESC LIMIT 1
Generated query:


SELECT  stadium_name ,  capacity  FROM stadium  ORDER BY  average_attendance DESC LIMIT 1<eos>
____________________________________________________________________________________________________
Original query:
SELECT name ,  capacity FROM stadium ORDER BY average DESC LIMIT 1
Generated query:


SELECT  stadium_name ,  capacity  FROM stadium  ORDER BY  average_attendance DESC LIMIT 1<eos>
____________________________________________________________________________________________________
Original query:
SELECT count(*) FROM concert WHERE YEAR  =  2014 OR YEAR  =  2015
Generated query:


SELECT COUNT(*) FROM concert WHERE year = 2014 OR year = 2015<eos>
____________________________________________________________________________________________________
Original query:
SELECT count(*) FROM concert WHERE YEAR  =  2014 OR YEAR  =  2015
Generated query:


SELECT COUNT(*) FROM concert WHERE year = 2014 OR year = 2015<eos>
____________________________________________________________________________________________________
Original query:
SELECT T2.name ,  count(*) FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id GROUP BY T1.stadium_id
Generated query:
 <strong>SELECT stadium_name , count(*) FROM concert GROUP BY stadium_name</strong><eos>
____________________________________________________________________________________________________
Original query:
SELECT T2.name ,  count(*) FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id GROUP BY T1.stadium_id
Generated query:


SELECT  stadium_name ,  COUNT(*) FROM  concert GROUP BY stadium_name<eos>
____________________________________________________________________________________________________
Original query:
SELECT T2.name ,  T2.capacity FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id WHERE T1.year  >=  2014 GROUP BY T2.stadium_id ORDER BY count(*) DESC LIMIT 1
Generated query:


SELECT  stadium_name ,  capacity  FROM  concert  WHERE  year  >=  2014<eos>
____________________________________________________________________________________________________
Original query:
select t2.name ,  t2.capacity from concert as t1 join stadium as t2 on t1.stadium_id  =  t2.stadium_id where t1.year  >  2013 group by t2.stadium_id order by count(*) desc limit 1
Generated query:


SELECT  stadium_name ,  capacity  FROM stadium  WHERE  year  >=  2013  ORDER BY  capacity  DESC  LIMIT  1<eos>
____________________________________________________________________________________________________
Original query:
SELECT YEAR FROM concert GROUP BY YEAR ORDER BY count(*) DESC LIMIT 1
Generated query:


SELECT  year FROM  concert GROUP BY year ORDER BY  count(*) DESC LIMIT 1<eos>
____________________________________________________________________________________________________
Original query:
SELECT YEAR FROM concert GROUP BY YEAR ORDER BY count(*) DESC LIMIT 1
Generated query:


SELECT  year FROM  concert GROUP BY year ORDER BY year DESC LIMIT 1<eos>
____________________________________________________________________________________________________
Original query:
SELECT name FROM stadium WHERE stadium_id NOT IN (SELECT stadium_id FROM concert)
Generated query:
 <strong>SELECT stadium_name FROM stadium WHERE concert_id IS NULL</strong><eos>
____________________________________________________________________________________________________
Original query:
SELECT name FROM stadium WHERE stadium_id NOT IN (SELECT stadium_id FROM concert)
Generated query:


SELECT DISTINCT stadium_name FROM stadium WHERE concert_id IS NULL<eos>
____________________________________________________________________________________________________
Original query:
SELECT country FROM singer WHERE age  >  40 INTERSECT SELECT country FROM singer WHERE age  <  30
Generated query:


SELECT  country FROM singers WHERE age BETWEEN 40 AND 30<eos>
____________________________________________________________________________________________________
Original query:
SELECT name FROM stadium EXCEPT SELECT T2.name FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id WHERE T1.year  =  2014
Generated query:
 <strong>SELECT stadium_name FROM stadium WHERE year != 2014</strong><eos>
____________________________________________________________________________________________________
Original query:
SELECT name FROM stadium EXCEPT SELECT T2.name FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id WHERE T1.year  =  2014
Generated query:



,db_id,query,question,query_toks,query_toks_no_value,question_toks,modified question,generated_query
0,concert_singer,SELECT count(*) FROM singer,How many singers do we have?,"[SELECT, count, (, *, ), FROM, singer]","[select, count, (, *, ), from, singer]","[How, many, singers, do, we, have, ?]","""Write a query that answers the following ques...",\n\nSELECT COUNT(*) FROM singers
1,concert_singer,SELECT count(*) FROM singer,What is the total number of singers?,"[SELECT, count, (, *, ), FROM, singer]","[select, count, (, *, ), from, singer]","[What, is, the, total, number, of, singers, ?]","""Write a query that answers the following ques...",\n\nSELECT SUM(singer_count) FROM singers
2,concert_singer,"SELECT name , country , age FROM singer ORDE...","Show name, country, age for all singers ordere...","[SELECT, name, ,, country, ,, age, FROM, singe...","[select, name, ,, country, ,, age, from, singe...","[Show, name, ,, country, ,, age, for, all, sin...","""Write a query that answers the following ques...","<strong>SELECT name, country, age FROM singer..."
3,concert_singer,"SELECT name , country , age FROM singer ORDE...","What are the names, countries, and ages for ev...","[SELECT, name, ,, country, ,, age, FROM, singe...","[select, name, ,, country, ,, age, from, singe...","[What, are, the, names, ,, countries, ,, and, ...","""Write a query that answers the following ques...","\n\nSELECT singer_name , country , age FR..."
4,concert_singer,"SELECT avg(age) , min(age) , max(age) FROM s...","What is the average, minimum, and maximum age ...","[SELECT, avg, (, age, ), ,, min, (, age, ), ,,...","[select, avg, (, age, ), ,, min, (, age, ), ,,...","[What, is, the, average, ,, minimum, ,, and, m...","""Write a query that answers the following ques...","\n\nSELECT AVG(age) , MIN(age) , MAX(age) FRO..."
5,concert_singer,"SELECT avg(age) , min(age) , max(age) FROM s...","What is the average, minimum, and maximum age ...","[SELECT, avg, (, age, ), ,, min, (, age, ), ,,...","[select, avg, (, age, ), ,, min, (, age, ), ,,...","[What, is, the, average, ,, minimum, ,, and, m...","""Write a query that answers the following ques...","<strong>SELECT AVG(age), MIN(age), MAX(age) F..."
6,concert_singer,"SELECT song_name , song_release_year FROM sin...",Show the name and the release year of the song...,"[SELECT, song_name, ,, song_release_year, FROM...","[select, song_name, ,, song_release_year, from...","[Show, the, name, and, the, release, year, of,...","""Write a query that answers the following ques...","<strong>SELECT</strong> name , release_year..."
7,concert_singer,"SELECT song_name , song_release_year FROM sin...",What are the names and release years for all t...,"[SELECT, song_name, ,, song_release_year, FROM...","[select, song_name, ,, song_release_year, from...","[What, are, the, names, and, release, years, f...","""Write a query that answers the following ques...","\n\nSELECT name , release_year FROM songs ..."
8,concert_singer,SELECT DISTINCT country FROM singer WHERE age ...,What are all distinct countries where singers ...,"[SELECT, DISTINCT, country, FROM, singer, WHER...","[select, distinct, country, from, singer, wher...","[What, are, all, distinct, countries, where, s...","""Write a query that answers the following ques...",\n\nSELECT DISTINCT country FROM singers WHER...
9,concert_singer,SELECT DISTINCT country FROM singer WHERE age ...,What are the different countries with singers...,"[SELECT, DISTINCT, country, FROM, singer, WHER...","[select, distinct, country, from, singer, wher...","[What, are, the, different, countries, with, s...","""Write a query that answers the following ques...",\n\nSELECT DISTINCT country FROM singers WHER...
10,concert_singer,"SELECT country , count(*) FROM singer GROUP B...",Show all countries and the number of singers i...,"[SELECT, country, ,, count, (, *, ), FROM, sin...","[select, country, ,, count, (, *, ), from, sin...","[Show, all, countries, and, the, number, of, s...","""Write a query that answers the following ques...","<strong>SELECT country , count(*) FROM singer..."
11,concert_singer,"SELECT country , count(*) FROM singer GROUP B...",How many singers are from each country?,"[SELECT, country, ,, count, (, *, ), FROM, sin...","[select, country, ,, count, (, *, ), from, sin...","[How, many, singers, are, from, each, country, ?]","""Write a query that answers the following ques...",\n\nSELECT COUNT(*) FROM singers GROUP BY cou...
12,concert_singer,SELECT song_name FROM singer WHERE age > (SE...,List all song names by singers above the avera...,"[SELECT, song_name, FROM, singer, WHERE, age, ...","[select, song_name, from, singer, where, age, ...","[List, all, song, names, by, singers, above, t...","""Write a query that answers the following ques...",<strong>SELECT song_name FROM song WHERE sing...
13,concert_singer,SELECT song_name FROM singer WHERE age > (SE...,What are all the song names by singers who are...,"[SELECT, song_name, FROM, singer, WHERE, age, ...","[select, song_name, from, singer, where, age, ...","[What, are, all, the, song, names, by, singers...","""Write a query that answers the following ques...",\n\nSELECT * FROM song WHERE singer_age ...
14,concert_singer,"SELECT LOCATION , name FROM stadium WHERE cap...",Show location and name for all stadiums with a...,"[SELECT, LOCATION, ,, name, FROM, stadium, WHE...","[select, location, ,, name, from, stadium, whe...","[Show, location, and, name, for, all, stadiums...","""Write a query that answers the following ques...","<strong>SELECT location , name FROM stadium W..."
15,concert_singer,"SELECT LOCATION , name FROM stadium WHERE cap...",What are the locations and names of all statio...,"[SELECT, LOCATION, ,, name, FROM, stadium, WHE...","[select, location, ,, name, from, stadium, whe...","[What, are, the, locations, and, names, of, al...","""Write a query that answers the following ques...","\n\nSELECT station_location , station_name ..."
16,concert_singer,"select max(capacity), average from stadium",What is the maximum capacity and the average o...,"[select, max, (, capacity, ), ,, average, from...","[select, max, (, capacity, ), ,, average, from...","[What, is, the, maximum, capacity, and, the, a...","""Write a query that answers the following ques...","\n\nSELECT MAX(capacity) , AVG(capacity) FROM..."
17,concert_singer,"select avg(capacity) , max(capacity) from sta...",What is the average and maximum capacities for...,"[select, avg, (, capacity, ), ,, max, (, capac...","[select, avg, (, capacity, ), ,, max, (, capac...","[What, is, the, average, and, maximum, capacit...","""Write a query that answers the following ques...","\n\nSELECT AVG(capacity) , MAX(capacity) FRO..."
18,concert_singer,"SELECT name , capacity FROM stadium ORDER BY ...",What is the name and capacity for the stadium ...,"[SELECT, name, ,, capacity, FROM, stadium, ORD...","[select, name, ,, capacity, from, stadium, ord...","[What, is, the, name, and, capacity, for, the,...","""Write a query that answers the following ques...","\n\nSELECT stadium_name , capacity FROM st..."
19,concert_singer,"SELECT name , capacity FROM stadium ORDER BY ...",What is the name and capacity for the stadium ...,"[SELECT, name, ,, capacity, FROM, stadium, ORD...","[select, name, ,, capacity, from, stadium, ord...","[What, is, the, name, and, capacity, for, the,...","""Write a query that answers the following ques...","\n\nSELECT stadium_name , capacity FROM st..."
20,concert_singer,SELECT count(*) FROM concert WHERE YEAR = 20...,How many concerts are there in year 2014 or 2015?,"[SELECT, count, (, *, ), FROM, concert, WHERE,...","[select, count, (, *, ), from, concert, where,...","[How, many, concerts, are, there, in, year, 20...","""Write a query that answers the following ques...",\n\nSELECT COUNT(*) FROM concert WHERE year =...
21,concert_singer,SELECT count(*) FROM concert WHERE YEAR = 20...,How many concerts occurred in 2014 or 2015?,"[SELECT, count, (, *, ), FROM, concert, WHERE,...","[select, count, (, *, ), from, concert, where,...","[How, many, concerts, occurred, in, 2014, or, ...","""Write a query that answers the following ques...",\n\nSELECT COUNT(*) FROM concert WHERE year =...
22,concert_singer,"SELECT T2.name , count(*) FROM concert AS T1 ...",Show the stadium name and the number of concer...,"[SELECT, T2.name, ,, count, (, *, ), FROM, con...","[select, t2, ., name, ,, count, (, *, ), from,...","[Show, the, stadium, name, and, the, number, o...","""Write a query that answers the following ques...","<strong>SELECT stadium_name , count(*) FROM c..."
23,concert_singer,"SELECT T2.name , count(*) FROM concert AS T1 ...","For each stadium, how many concerts play there?","[SELECT, T2.name, ,, count, (, *, ), FROM, con...","[select, t2, ., name, ,, count, (, *, ), from,...","[For, each, stadium, ,, how, many, concerts, p...","""Write a query that answers the following ques...","\n\nSELECT stadium_name , COUNT(*) FROM co..."
24,concert_singer,"SELECT T2.name , T2.capacity FROM concert AS ...",Show the stadium name and capacity with most n...,"[SELECT, T2.name, ,, T2.capacity, FROM, concer...","[select, t2, ., name, ,, t2, ., capacity, from...","[Show, the, stadium, name, and, capacity, with...","""Write a query that answers the following ques...","\n\nSELECT stadium_name , capacity FROM c..."
25,concert_singer,"select t2.name , t2.capacity from concert as ...",What is the name and capacity of the stadium w...,"[select, t2.name, ,, t2.capacity, from, concer...","[select, t2, ., name, ,, t2, ., capacity, from...","[What, is, the, name, and, capacity, of, the, ...","""Write a query that answers the following ques...","\n\nSELECT stadium_name , capacity FROM st..."
26,concert_singer,SELECT YEAR FROM concert GROUP BY YEAR ORDER B...,Which year has most number of concerts?,"[SELECT, YEAR, FROM, concert, GROUP, BY, YEAR,...","[select, year, from, concert, group, by, year,...","[Which, year, has, most, number, of, concerts, ?]","""Write a query that answers the following ques...",\n\nSELECT year FROM concert GROUP BY year ...
27,concert_singer,SELECT YEAR FROM concert GROUP BY YEAR ORDER B...,What is the year that had the most concerts?,"[SELECT, YEAR, FROM, concert, GROUP, BY, YEAR,...","[select, year, from, concert, group, by, year,...","[What, is, the, year, that, had, the, most, co...","""Write a query that answers the following ques...",\n\nSELECT year FROM concert GROUP BY year ...
28,concert_singer,SELECT name FROM stadium WHERE stadium_id NOT ...,Show the stadium names without any concert.,"[SELECT, name, FROM, stadium, WHERE, stadium_i...","[select, name, from, stadium, where, stadium_i...","[Show, the, stadium, names, without, any, conc...","""Write a query that answers the following ques...",<strong>SELECT stadium_name FROM stadium WHER...
29,concert_singer,SELECT name FROM stadium WHERE stadium_id NOT ...,What are the names of the stadiums without any...,"[SELECT, name, FROM, stadium, WHERE, stadium_i...","[select, name, from, stadium, where, stadium_i...","[What, are, the, names, of, the, stadiums, wit...","""Write a query that answers the following ques...",\n\nSELECT DISTINCT stadium_name FROM stadium...
30,concert_singer,SELECT country FROM singer WHERE age > 40 IN...,Show countries where a singer above age 40 and...,"[SELECT, country, FROM, singer, WHERE, age, >,...","[select, country, from, singer, where, age, >,...","[Show, countries, where, a, singer, above, age...","""Write a query that answers the following ques...",\n\nSELECT country FROM singers WHERE age BE...
31,concert_singer,SELECT name FROM stadium EXCEPT SELECT T2.name...,Show names for all stadiums except for stadium...,"[SELECT, name, FROM, stadium, EXCEPT, SELECT, ...","[select, name, from, stadium, except, select, ...","[Show, names, for, all, stadiums, except, for,...","""Write a query that answers the following ques...",<strong>SELECT stadium_name FROM stadium WHER...
32,concert_singer,SELECT name FROM stadium EXCEPT SELECT T2.name...,What are the names of all stadiums that did no...,"[SELECT, name, FROM, stadium, EXCEPT, SELECT, ...","[select, name, from, stadium, except, select, ...","[What, are, the, names, of, all, stadiums, tha...","""Write a query that answers the following ques...",\n\nSELECT DISTINCT stadium_name FROM stadium...
33,concert_singer,"SELECT T2.concert_name , T2.theme , count(*)...",Show the name and theme for all concerts and t...,"[SELECT, T2.concert_name, ,, T2.theme, ,, coun...","[select, t2, ., concert_name, ,, t2, ., theme,...","[Show, the, name, and, theme, for, all, concer...","""Write a query that answers the following ques...","<strong>SELECT</strong> name , theme , COU..."
34,concert_singer,"select t2.concert_name , t2.theme , count(*)...","What are the names , themes , and number of si...","[select, t2.concert_name, ,, t2.theme, ,, coun...","[select, t2, ., concert_name, ,, t2, ., theme,...","[What, are, the, names, ,, themes, ,, and, num...","""Write a query that answers the following ques...","\n\nSELECT t1.name , t2.theme , t3.number ..."
35,concert_singer,"SELECT T2.name , count(*) FROM singer_in_conc...",List singer names and number of concerts for e...,"[SELECT, T2.name, ,, count, (, *, ), FROM, sin...","[select, t2, ., name, ,, count, (, *, ), from,...","[List, singer, names, and, number, of, concert...","""Write a query that answers the following ques...","\n\nSELECT singer_name , COUNT(*) FROM con..."
36,concert_singer,"SELECT T2.name , count(*) FROM singer_in_conc...",What are the names of the singers and number o...,"[SELECT, T2.name, ,, count, (, *, ), FROM, sin...","[select, t2, ., name, ,, count, (, *, ), from,...","[What, are, the, names, of, the, singers, and,...","""Write a query that answers the following ques...","\n\nSELECT singers.name , COUNT(*) AS conce..."
37,concert_singer,SELECT T2.name FROM singer_in_concert AS T1 JO...,List all singer names in concerts in year 2014.,"[SELECT, T2.name, FROM, singer_in_concert, AS,...","[select, t2, ., name, from, singer_in_concert,...","[List, all, singer, names, in, concerts, in, y...","""Write a query that answers the following ques...",\n\nSELECT singer_name FROM concerts WHERE y...
38,concert_singer,SELECT T2.name FROM singer_in_concert AS T1 JO...,What are the names of the singers who performe...,"[SELECT, T2.name, FROM, singer_in_concert, AS,...","[select, t2, ., name, from, singer_in_concert,...","[What, are, the, names, of, the, singers, who,...","""Write a query that answers the following ques...",\n\nSELECT singers.name FROM singers JOIN co...
39,concert_singer,"SELECT name , country FROM singer WHERE song_...",what is the name and nation of the singer who ...,"[SELECT, name, ,, country, FROM, singer, WHERE...","[select, name, ,, country, from, singer, where...","[what, is, the, name, and, nation, of, the, si...","""Write a query that answers the following ques...","\n\nSELECT singer_name , country FROM sin..."
40,concert_singer,"SELECT name , country FROM singer WHERE song_...",What is the name and country of origin of ever...,"[SELECT, name, ,, country, FROM, singer, WHERE...","[select, name, ,, country, from, singer, where...","[What, is, the, name, and, country, of, origin...","""Write a query that answers the following ques...","\n\nSELECT s.name , s.country FROM singer..."
41,concert_singer,"SELECT T2.name , T2.location FROM concert AS ...",Find the name and location of the stadiums whi...,"[SELECT, T2.name, ,, T2.location, FROM, concer...","[select, t2, ., name, ,, t2, ., location, from...","[Find, the, name, and, location, of, the, stad...","""Write a query that answers the following ques...","<strong>SELECT</strong> stadium_name , stadiu..."
42,concert_singer,"SELECT T2.name , T2.location FROM concert AS ...",What are the names and locations of the stadiu...,"[SELECT, T2.name, ,, T2.location, FROM, concer...","[select, t2, ., name, ,, t2, ., location, from...","[What, are, the, names, and, locations, of, th...","""Write a query that answers the following ques...","\n\nSELECT Stadium_name , Stadium_location ..."
43,concert_singer,select count(*) from concert where stadium_id ...,Find the number of concerts happened in the st...,"[select, count, (, *, ), from, concert, where,...","[select, count, (, *, ), from, concert, where,...","[Find, the, number, of, concerts, happened, in...","""Write a query that answers the following ques...",\n\nSELECT COUNT(*) FROM concert WHERE stadiu...
44,concert_singer,select count(*) from concert where stadium_id ...,What are the number of concerts that occurred ...,"[select, count, (, *, ), from, concert, where,...","[select, count, (, *, ), from, concert, where,...","[What, are, the, number, of, concerts, that, o...","""Write a query that answers the following ques...",\n\nSELECT COUNT(*) FROM concert WHERE stadiu...
45,pets_1,SELECT count(*) FROM pets WHERE weight > 10,Find the number of pets whose weight is heavie...,"[SELECT, count, (, *, ), FROM, pets, WHERE, we...","[select, count, (, *, ), from, pets, where, we...","[Find, the, number, of, pets, whose, weight, i...","""Write a query that answers the following ques...",<strong>SELECT COUNT(*) FROM pets WHERE weigh...
46,pets_1,SELECT count(*) FROM pets WHERE weight > 10,How many pets have a greater weight than 10?,"[SELECT, count, (, *, ), FROM, pets, WHERE, we...","[select, count, (, *, ), from, pets, where, we...","[How, many, pets, have, a, greater, weight, th...","""Write a query that answers the following ques...",\n\nSELECT count(*) FROM pets WHERE weight > 10
47,pets_1,SELECT weight FROM pets ORDER BY pet_age LIMIT 1,Find the weight of the youngest dog.,"[SELECT, weight, FROM, pets, ORDER, BY, pet_ag...","[select, weight, from, pets, order, by, pet_ag...","[Find, the, weight, of, the, youngest, dog, .]","""Write a query that answers the following ques...",<strong>SELECT weight FROM dog WHERE age = (S...
48,pets_1,SELECT weight FROM pets ORDER BY pet_age LIMIT 1,How much does the youngest dog weigh?,"[SELECT, weight, FROM, pets, ORDER, BY, pet_ag...","[select, weight, from, pets, order, by, pet_ag...","[How, much, does, the, youngest, dog, weigh, ?]","""Write a query that answers the following ques...",\n\nSELECT MIN(weight) FROM dog
49,pets_1,"SELECT max(weight) , petType FROM pets GROUP ...",Find the maximum weight for each type of pet. ...,"[SELECT, max, (, weight, ), ,, petType, FROM, ...","[select, max, (, weight, ), ,, pettype, from, ...","[Find, the, maximum, weight, for, each, type, ...","""Write a query that answers the following ques...","\n\nSELECT MAX(weight) , pet_type FROM pets ..."
50,pets_1,"SELECT max(weight) , petType FROM pets GROUP ...",List the maximum weight and type for each type...,"[SELECT, max, (, weight, ), ,, petType, FROM, ...","[select, max, (, weight, ), ,, pettype, from, ...","[List, the, maximum, weight, and, type, for, e...","""Write a query that answers the following ques...","\n\nSELECT MAX(weight) , type FROM pets GROUP..."
51,pets_1,SELECT count(*) FROM student AS T1 JOIN has_pe...,Find number of pets owned by students who are ...,"[SELECT, count, (, *, ), FROM, student, AS, T1...","[select, count, (, *, ), from, student, as, t1...","[Find, number, of, pets, owned, by, students, ...","""Write a query that answers the following ques...",<strong>SELECT COUNT(*) FROM pets WHERE owner...

====================================================================================================
(52, 7)
Input:  ['"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> How many pets are owned by students that have an age greater than 20? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Find the number of dog pets that are raised by female students (with sex F). <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> How many dog pets are raised by female students? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Find the number of distinct type of pets. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> How many different types of pet are there? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Find the first name of students who have cat or dog pet. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the first names of every student who has a cat or dog as a pet? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Find the first name of students who have both cat and dog pets . <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the students\' first names who have both cats and dogs as pets? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Find the major and age of students who do not have a cat pet. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What major is every student who does not own a cat as a pet, and also how old are they? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Find the id of students who do not have a cat pet. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the ids of the students who do not own cats as pets? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Find the first name and age of students who have a dog but do not have a cat as a pet. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the first name of every student who has a dog but does not have a cat? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Find the type and weight of the youngest pet. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What type of pet is the youngest animal, and how much does it weigh? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Find the id and weight of all pets whose age is older than 1. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the id and weight of every pet who is older than 1? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Find the average and maximum age for each type of pet. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the average and maximum age for each pet type? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Find the average weight for each pet type. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the average weight for each type of pet? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Find the first name and age of students who have a pet. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the different first names and ages of the students who do have pets? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Find the id of the pet owned by student whose last name is ‘Smith’. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the id of the pet owned by the student whose last name is \'Smith\'? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Find the number of pets for each student who has any pet and student id. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> For students who have pets , how many pets does each student have ? list their ids instead of names . <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Find the first name and gender of student who have more than one pet. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the first name and gender of the all the students who have more than one pet? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Find the last name of the student who has a cat that is age 3. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the last name of the student who has a cat that is 3 years old? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Find the average age of students who do not have any pet . <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the average age for all students who do not own any pets ? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> How many continents are there? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the number of continents? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> How many countries does each continent have? List the continent id, continent name and the number of countries. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> For each continent, list its id, name, and how many countries it has? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> How many countries are listed? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> How many countries exist? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> How many models does each car maker produce? List maker full name, id and the number. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the full name of each car maker, along with its id and how many models it produces? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Which model of the car has the minimum horsepower? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the model of the car with the smallest amount of horsepower? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Find the model of the car whose weight is below the average weight. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the model for the car with a weight smaller than the average? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Find the name of the makers that produced some cars in the year of 1970? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the name of the different car makers who produced a car in 1970? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Find the make and production time of the cars that were produced in the earliest year? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the maker of the carr produced in the earliest year and what year was it? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Which distinct car models are the produced after 1980? <query> ']
Original query:
SELECT count(*) FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid WHERE T1.age  >  20
Generated query:


SELECT count(*) FROM pets WHERE student_id IN (SELECT student_id FROM students WHERE age > 20)<eos>
____________________________________________________________________________________________________
Original query:
SELECT count(*) FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T2.petid  =  T3.petid WHERE T1.sex  =  'F' AND T3.pettype  =  'dog'
Generated query:
 <strong>SELECT count(*) FROM pet WHERE sex = 'F' AND owner_sex = 'F'</strong><eos>
____________________________________________________________________________________________________
Original query:
SELECT count(*) FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T2.petid  =  T3.petid WHERE T1.sex  =  'F' AND T3.pettype  =  'dog'
Generated query:


SELECT count(*) FROM pet WHERE gender = 'female' AND owner_id IN (SELECT owner_id FROM student WHERE gender = 'female')<eos>
____________________________________________________________________________________________________
Original query:
SELECT count(DISTINCT pettype) FROM pets
Generated query:


SELECT DISTINCT type FROM pets<eos>
____________________________________________________________________________________________________
Original query:
SELECT count(DISTINCT pettype) FROM pets
Generated query:


SELECT DISTINCT pet_type FROM pets<eos>
____________________________________________________________________________________________________
Original query:
SELECT DISTINCT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat' OR T3.pettype  =  'dog'
Generated query:
 <strong>SELECT first_name FROM student WHERE pet_type IN ('cat', 'dog') ORDER BY first_name ASC LIMIT 1</strong><eos>
____________________________________________________________________________________________________
Original query:
SELECT DISTINCT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat' OR T3.pettype  =  'dog'
Generated query:


SELECT first_name FROM student WHERE pet_type IN ('cat','dog')<eos>
____________________________________________________________________________________________________
Original query:
select t1.fname from student as t1 join has_pet as t2 on t1.stuid  =  t2.stuid join pets as t3 on t3.petid  =  t2.petid where t3.pettype  =  'cat' intersect select t1.fname from student as t1 join has_pet as t2 on t1.stuid  =  t2.stuid join pets as t3 on t3.petid  =  t2.petid where t3.pettype  =  'dog'
Generated query:
 <strong>SELECT first_name FROM student WHERE pet_type IN ('cat','dog')</strong><eos>
____________________________________________________________________________________________________
Original query:
SELECT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat' INTERSECT SELECT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'dog'
Generated query:


SELECT first_name FROM students WHERE pet_type IN ('cat','dog')<eos>
____________________________________________________________________________________________________
Original query:
SELECT major ,  age FROM student WHERE stuid NOT IN (SELECT T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat')
Generated query:
 <strong>SELECT major , age FROM student WHERE NOT EXISTS ( SELECT * FROM pet WHERE pet.owner_id = student.id AND pet.type = 'cat' )</strong><eos>
____________________________________________________________________________________________________
Original query:
SELECT major ,  age FROM student WHERE stuid NOT IN (SELECT T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat')
Generated query:


SELECT major, age FROM student WHERE pet_count = 0<eos>
____________________________________________________________________________________________________
Original query:
SELECT stuid FROM student EXCEPT SELECT T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat'
Generated query:
 <strong>SELECT student_id FROM students WHERE pet_id IS NULL</strong><eos>
____________________________________________________________________________________________________
Original query:
SELECT stuid FROM student EXCEPT SELECT T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat'
Generated query:


SELECT  student_id FROM students WHERE pet_id IS NULL<eos>
____________________________________________________________________________________________________
Original query:
SELECT T1.fname ,  T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'dog' AND T1.stuid NOT IN (SELECT T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat')
Generated query:
 <strong>SELECT first_name , age FROM student WHERE pet_type = 'dog' AND pet_type != 'cat'</strong><eos>
____________________________________________________________________________________________________
Original query:
SELECT T1.fname ,  T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'dog' AND T1.stuid NOT IN (SELECT T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat')
Generated query:


SELECT  firstname FROM student WHERE  dog  =  1  AND  cat  =  0<eos>
____________________________________________________________________________________________________
Original query:
SELECT pettype ,  weight FROM pets ORDER BY pet_age LIMIT 1
Generated query:
 <strong>SELECT type , weight FROM pets WHERE age = (SELECT MIN(age) FROM pets)</strong><eos>
____________________________________________________________________________________________________
Original query:
SELECT pettype ,  weight FROM pets ORDER BY pet_age LIMIT 1
Generated query:


SELECT  pet_type ,  weight FROM  pet WHERE  age  =  (SELECT  min  (  age  )  FROM  pet )<eos>
____________________________________________________________________________________________________
Original query:
SELECT petid ,  weight FROM pets WHERE pet_age  >  1
Generated query:
 <strong>SELECT pet_id , weight FROM pets WHERE age > 1</strong><eos>
____________________________________________________________________________________________________
Original query:
SELECT petid ,  weight FROM pets WHERE pet_age  >  1
Generated query:


SELECT  pet_id , weight FROM pets WHERE age > 1<eos>
____________________________________________________________________________________________________
Original query:
SELECT avg(pet_age) ,  max(pet_age) ,  pettype FROM pets GROUP BY pettype
Generated query:


SELECT  AVG(age) ,  type FROM pets GROUP BY type<eos>
____________________________________________________________________________________________________
Original query:
SELECT avg(pet_age) ,  max(pet_age) ,  pettype FROM pets GROUP BY pettype
Generated query:


SELECT  AVG(age) ,  MAX(age) FROM pet_type<eos>
____________________________________________________________________________________________________
Original query:
SELECT avg(weight) ,  pettype FROM pets GROUP BY pettype
Generated query:


SELECT  pet_type ,  AVG(weight)  FROM  pet  GROUP BY  pet_type<eos>
____________________________________________________________________________________________________
Original query:
SELECT avg(weight) ,  pettype FROM pets GROUP BY pettype
Generated query:


SELECT  type ,  AVG(weight)  FROM  pet  GROUP BY  type<eos>
____________________________________________________________________________________________________
Original query:
SELECT DISTINCT T1.fname ,  T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid
Generated query:
 <strong>SELECT first_name , age FROM student WHERE pet_id IS NOT NULL ORDER BY age ASC LIMIT 1</strong><eos>
____________________________________________________________________________________________________
Original query:
SELECT DISTINCT T1.fname ,  T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid
Generated query:


SELECT DISTINCT first_name , age FROM students WHERE pet_name IS NOT NULL<eos>
____________________________________________________________________________________________________
Original query:
SELECT T2.petid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid WHERE T1.Lname  =  'Smith'
Generated query:
 <strong>SELECT pet_id FROM pet WHERE owner_name = 'Smith'</strong><eos>
____________________________________________________________________________________________________
Original query:
SELECT T2.petid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid WHERE T1.Lname  =  'Smith'
Generated query:


SELECT  pet_id FROM  pet WHERE  owner_name  =  'Smith'<eos>
____________________________________________________________________________________________________
Original query:

,db_id,query,question,query_toks,query_toks_no_value,question_toks,modified question,generated_query
52,pets_1,SELECT count(*) FROM student AS T1 JOIN has_pe...,How many pets are owned by students that have ...,"[SELECT, count, (, *, ), FROM, student, AS, T1...","[select, count, (, *, ), from, student, as, t1...","[How, many, pets, are, owned, by, students, th...","""Write a query that answers the following ques...",\n\nSELECT count(*) FROM pets WHERE student_i...
53,pets_1,SELECT count(*) FROM student AS T1 JOIN has_pe...,Find the number of dog pets that are raised by...,"[SELECT, count, (, *, ), FROM, student, AS, T1...","[select, count, (, *, ), from, student, as, t1...","[Find, the, number, of, dog, pets, that, are, ...","""Write a query that answers the following ques...",<strong>SELECT count(*) FROM pet WHERE sex = ...
54,pets_1,SELECT count(*) FROM student AS T1 JOIN has_pe...,How many dog pets are raised by female students?,"[SELECT, count, (, *, ), FROM, student, AS, T1...","[select, count, (, *, ), from, student, as, t1...","[How, many, dog, pets, are, raised, by, female...","""Write a query that answers the following ques...",\n\nSELECT count(*) FROM pet WHERE gender = '...
55,pets_1,SELECT count(DISTINCT pettype) FROM pets,Find the number of distinct type of pets.,"[SELECT, count, (, DISTINCT, pettype, ), FROM,...","[select, count, (, distinct, pettype, ), from,...","[Find, the, number, of, distinct, type, of, pe...","""Write a query that answers the following ques...",\n\nSELECT DISTINCT type FROM pets
56,pets_1,SELECT count(DISTINCT pettype) FROM pets,How many different types of pet are there?,"[SELECT, count, (, DISTINCT, pettype, ), FROM,...","[select, count, (, distinct, pettype, ), from,...","[How, many, different, types, of, pet, are, th...","""Write a query that answers the following ques...",\n\nSELECT DISTINCT pet_type FROM pets
57,pets_1,SELECT DISTINCT T1.Fname FROM student AS T1 JO...,Find the first name of students who have cat o...,"[SELECT, DISTINCT, T1.Fname, FROM, student, AS...","[select, distinct, t1, ., fname, from, student...","[Find, the, first, name, of, students, who, ha...","""Write a query that answers the following ques...",<strong>SELECT first_name FROM student WHERE ...
58,pets_1,SELECT DISTINCT T1.Fname FROM student AS T1 JO...,What are the first names of every student who ...,"[SELECT, DISTINCT, T1.Fname, FROM, student, AS...","[select, distinct, t1, ., fname, from, student...","[What, are, the, first, names, of, every, stud...","""Write a query that answers the following ques...",\n\nSELECT first_name FROM student WHERE pet_...
59,pets_1,select t1.fname from student as t1 join has_pe...,Find the first name of students who have both ...,"[select, t1.fname, from, student, as, t1, join...","[select, t1, ., fname, from, student, as, t1, ...","[Find, the, first, name, of, students, who, ha...","""Write a query that answers the following ques...",<strong>SELECT first_name FROM student WHERE ...
60,pets_1,SELECT T1.Fname FROM student AS T1 JOIN has_pe...,What are the students' first names who have bo...,"[SELECT, T1.Fname, FROM, student, AS, T1, JOIN...","[select, t1, ., fname, from, student, as, t1, ...","[What, are, the, students, ', first, names, wh...","""Write a query that answers the following ques...",\n\nSELECT first_name FROM students WHERE pet...
61,pets_1,"SELECT major , age FROM student WHERE stuid N...",Find the major and age of students who do not ...,"[SELECT, major, ,, age, FROM, student, WHERE, ...","[select, major, ,, age, from, student, where, ...","[Find, the, major, and, age, of, students, who...","""Write a query that answers the following ques...","<strong>SELECT major , age FROM student WHERE..."
62,pets_1,"SELECT major , age FROM student WHERE stuid N...",What major is every student who does not own a...,"[SELECT, major, ,, age, FROM, student, WHERE, ...","[select, major, ,, age, from, student, where, ...","[What, major, is, every, student, who, does, n...","""Write a query that answers the following ques...","\n\nSELECT major, age FROM student WHERE pet_..."
63,pets_1,SELECT stuid FROM student EXCEPT SELECT T1.stu...,Find the id of students who do not have a cat ...,"[SELECT, stuid, FROM, student, EXCEPT, SELECT,...","[select, stuid, from, student, except, select,...","[Find, the, id, of, students, who, do, not, ha...","""Write a query that answers the following ques...",<strong>SELECT student_id FROM students WHERE...
64,pets_1,SELECT stuid FROM student EXCEPT SELECT T1.stu...,What are the ids of the students who do not ow...,"[SELECT, stuid, FROM, student, EXCEPT, SELECT,...","[select, stuid, from, student, except, select,...","[What, are, the, ids, of, the, students, who, ...","""Write a query that answers the following ques...",\n\nSELECT student_id FROM students WHERE pe...
65,pets_1,"SELECT T1.fname , T1.age FROM student AS T1 J...",Find the first name and age of students who ha...,"[SELECT, T1.fname, ,, T1.age, FROM, student, A...","[select, t1, ., fname, ,, t1, ., age, from, st...","[Find, the, first, name, and, age, of, student...","""Write a query that answers the following ques...","<strong>SELECT first_name , age FROM student ..."
66,pets_1,"SELECT T1.fname , T1.age FROM student AS T1 J...",What is the first name of every student who ha...,"[SELECT, T1.fname, ,, T1.age, FROM, student, A...","[select, t1, ., fname, ,, t1, ., age, from, st...","[What, is, the, first, name, of, every, studen...","""Write a query that answers the following ques...",\n\nSELECT firstname FROM student WHERE dog...
67,pets_1,"SELECT pettype , weight FROM pets ORDER BY pe...",Find the type and weight of the youngest pet.,"[SELECT, pettype, ,, weight, FROM, pets, ORDER...","[select, pettype, ,, weight, from, pets, order...","[Find, the, type, and, weight, of, the, younge...","""Write a query that answers the following ques...","<strong>SELECT type , weight FROM pets WHERE ..."
68,pets_1,"SELECT pettype , weight FROM pets ORDER BY pe...","What type of pet is the youngest animal, and h...","[SELECT, pettype, ,, weight, FROM, pets, ORDER...","[select, pettype, ,, weight, from, pets, order...","[What, type, of, pet, is, the, youngest, anima...","""Write a query that answers the following ques...","\n\nSELECT pet_type , weight FROM pet WHER..."
69,pets_1,"SELECT petid , weight FROM pets WHERE pet_age...",Find the id and weight of all pets whose age i...,"[SELECT, petid, ,, weight, FROM, pets, WHERE, ...","[select, petid, ,, weight, from, pets, where, ...","[Find, the, id, and, weight, of, all, pets, wh...","""Write a query that answers the following ques...","<strong>SELECT pet_id , weight FROM pets WHER..."
70,pets_1,"SELECT petid , weight FROM pets WHERE pet_age...",What is the id and weight of every pet who is ...,"[SELECT, petid, ,, weight, FROM, pets, WHERE, ...","[select, petid, ,, weight, from, pets, where, ...","[What, is, the, id, and, weight, of, every, pe...","""Write a query that answers the following ques...","\n\nSELECT pet_id , weight FROM pets WHERE a..."
71,pets_1,"SELECT avg(pet_age) , max(pet_age) , pettype...",Find the average and maximum age for each type...,"[SELECT, avg, (, pet_age, ), ,, max, (, pet_ag...","[select, avg, (, pet_age, ), ,, max, (, pet_ag...","[Find, the, average, and, maximum, age, for, e...","""Write a query that answers the following ques...","\n\nSELECT AVG(age) , type FROM pets GROUP ..."
72,pets_1,"SELECT avg(pet_age) , max(pet_age) , pettype...",What is the average and maximum age for each p...,"[SELECT, avg, (, pet_age, ), ,, max, (, pet_ag...","[select, avg, (, pet_age, ), ,, max, (, pet_ag...","[What, is, the, average, and, maximum, age, fo...","""Write a query that answers the following ques...","\n\nSELECT AVG(age) , MAX(age) FROM pet_type"
73,pets_1,"SELECT avg(weight) , pettype FROM pets GROUP ...",Find the average weight for each pet type.,"[SELECT, avg, (, weight, ), ,, pettype, FROM, ...","[select, avg, (, weight, ), ,, pettype, from, ...","[Find, the, average, weight, for, each, pet, t...","""Write a query that answers the following ques...","\n\nSELECT pet_type , AVG(weight) FROM pe..."
74,pets_1,"SELECT avg(weight) , pettype FROM pets GROUP ...",What is the average weight for each type of pet?,"[SELECT, avg, (, weight, ), ,, pettype, FROM, ...","[select, avg, (, weight, ), ,, pettype, from, ...","[What, is, the, average, weight, for, each, ty...","""Write a query that answers the following ques...","\n\nSELECT type , AVG(weight) FROM pet G..."
75,pets_1,"SELECT DISTINCT T1.fname , T1.age FROM studen...",Find the first name and age of students who ha...,"[SELECT, DISTINCT, T1.fname, ,, T1.age, FROM, ...","[select, distinct, t1, ., fname, ,, t1, ., age...","[Find, the, first, name, and, age, of, student...","""Write a query that answers the following ques...","<strong>SELECT first_name , age FROM student ..."
76,pets_1,"SELECT DISTINCT T1.fname , T1.age FROM studen...",What are the different first names and ages of...,"[SELECT, DISTINCT, T1.fname, ,, T1.age, FROM, ...","[select, distinct, t1, ., fname, ,, t1, ., age...","[What, are, the, different, first, names, and,...","""Write a query that answers the following ques...","\n\nSELECT DISTINCT first_name , age FROM stu..."
77,pets_1,SELECT T2.petid FROM student AS T1 JOIN has_pe...,Find the id of the pet owned by student whose ...,"[SELECT, T2.petid, FROM, student, AS, T1, JOIN...","[select, t2, ., petid, from, student, as, t1, ...","[Find, the, id, of, the, pet, owned, by, stude...","""Write a query that answers the following ques...",<strong>SELECT pet_id FROM pet WHERE owner_na...
78,pets_1,SELECT T2.petid FROM student AS T1 JOIN has_pe...,What is the id of the pet owned by the student...,"[SELECT, T2.petid, FROM, student, AS, T1, JOIN...","[select, t2, ., petid, from, student, as, t1, ...","[What, is, the, id, of, the, pet, owned, by, t...","""Write a query that answers the following ques...",\n\nSELECT pet_id FROM pet WHERE owner_nam...
79,pets_1,"SELECT count(*) , T1.stuid FROM student AS T1...",Find the number of pets for each student who h...,"[SELECT, count, (, *, ), ,, T1.stuid, FROM, st...","[select, count, (, *, ), ,, t1, ., stuid, from...","[Find, the, number, of, pets, for, each, stude...","""Write a query that answers the following ques...",\n\nSELECT count(*) FROM pet_owner JOIN pet O...
80,pets_1,"select count(*) , t1.stuid from student as t1...","For students who have pets , how many pets doe...","[select, count, (, *, ), ,, t1.stuid, from, st...","[select, count, (, *, ), ,, t1, ., stuid, from...","[For, students, who, have, pets, ,, how, many,...","""Write a query that answers the following ques...","\n\nSELECT student_id , count(*) FROM studen..."
81,pets_1,"SELECT T1.fname , T1.sex FROM student AS T1 J...",Find the first name and gender of student who ...,"[SELECT, T1.fname, ,, T1.sex, FROM, student, A...","[select, t1, ., fname, ,, t1, ., sex, from, st...","[Find, the, first, name, and, gender, of, stud...","""Write a query that answers the following ques...","<strong>SELECT first_name , gender FROM stude..."
82,pets_1,"SELECT T1.fname , T1.sex FROM student AS T1 J...",What is the first name and gender of the all t...,"[SELECT, T1.fname, ,, T1.sex, FROM, student, A...","[select, t1, ., fname, ,, t1, ., sex, from, st...","[What, is, the, first, name, and, gender, of, ...","""Write a query that answers the following ques...","\n\nSELECT firstname , gender FROM student W..."
83,pets_1,SELECT T1.lname FROM student AS T1 JOIN has_pe...,Find the last name of the student who has a ca...,"[SELECT, T1.lname, FROM, student, AS, T1, JOIN...","[select, t1, ., lname, from, student, as, t1, ...","[Find, the, last, name, of, the, student, who,...","""Write a query that answers the following ques...",<strong>SELECT last_name FROM student WHERE c...
84,pets_1,SELECT T1.lname FROM student AS T1 JOIN has_pe...,What is the last name of the student who has a...,"[SELECT, T1.lname, FROM, student, AS, T1, JOIN...","[select, t1, ., lname, from, student, as, t1, ...","[What, is, the, last, name, of, the, student, ...","""Write a query that answers the following ques...",\n\nSELECT last_name FROM student WHERE cat_a...
85,pets_1,select avg(age) from student where stuid not i...,Find the average age of students who do not ha...,"[select, avg, (, age, ), from, student, where,...","[select, avg, (, age, ), from, student, where,...","[Find, the, average, age, of, students, who, d...","""Write a query that answers the following ques...",\n\nSELECT AVG(age) FROM student WHERE pet_co...
86,pets_1,select avg(age) from student where stuid not i...,What is the average age for all students who d...,"[select, avg, (, age, ), from, student, where,...","[select, avg, (, age, ), from, student, where,...","[What, is, the, average, age, for, all, studen...","""Write a query that answers the following ques...",\n\nSELECT AVG(age) FROM student WHERE pet_co...
87,car_1,SELECT count(*) FROM CONTINENTS;,How many continents are there?,"[SELECT, count, (, *, ), FROM, CONTINENTS, ;]","[select, count, (, *, ), from, continents]","[How, many, continents, are, there, ?]","""Write a query that answers the following ques...",\n\nSELECT count(*) FROM continent
88,car_1,SELECT count(*) FROM CONTINENTS;,What is the number of continents?,"[SELECT, count, (, *, ), FROM, CONTINENTS, ;]","[select, count, (, *, ), from, continents]","[What, is, the, number, of, continents, ?]","""Write a query that answers the following ques...",\n\nSELECT count(*) FROM continent
89,car_1,"SELECT T1.ContId , T1.Continent , count(*) F...",How many countries does each continent have? L...,"[SELECT, T1.ContId, ,, T1.Continent, ,, count,...","[select, t1, ., contid, ,, t1, ., continent, ,...","[How, many, countries, does, each, continent, ...","""Write a query that answers the following ques...","\n\nSELECT continent_id, continent_name, coun..."
90,car_1,"SELECT T1.ContId , T1.Continent , count(*) F...","For each continent, list its id, name, and how...","[SELECT, T1.ContId, ,, T1.Continent, ,, count,...","[select, t1, ., contid, ,, t1, ., continent, ,...","[For, each, continent, ,, list, its, id, ,, na...","""Write a query that answers the following ques...","\n\nSELECT continent.id, continent.name, coun..."
91,car_1,SELECT count(*) FROM COUNTRIES;,How many countries are listed?,"[SELECT, count, (, *, ), FROM, COUNTRIES, ;]","[select, count, (, *, ), from, countries]","[How, many, countries, are, listed, ?]","""Write a query that answers the following ques...",\n\nSELECT COUNT(*) FROM countries
92,car_1,SELECT count(*) FROM COUNTRIES;,How many countries exist?,"[SELECT, count, (, *, ), FROM, COUNTRIES, ;]","[select, count, (, *, ), from, countries]","[How, many, countries, exist, ?]","""Write a query that answers the following ques...",\n\nSELECT count(*) FROM countries
93,car_1,"SELECT T1.FullName , T1.Id , count(*) FROM C...",How many models does each car maker produce? L...,"[SELECT, T1.FullName, ,, T1.Id, ,, count, (, *...","[select, t1, ., fullname, ,, t1, ., id, ,, cou...","[How, many, models, does, each, car, maker, pr...","""Write a query that answers the following ques...","\n\nSELECT maker_name , maker_id , count(*)..."
94,car_1,"SELECT T1.FullName , T1.Id , count(*) FROM C...","What is the full name of each car maker, along...","[SELECT, T1.FullName, ,, T1.Id, ,, count, (, *...","[select, t1, ., fullname, ,, t1, ., id, ,, cou...","[What, is, the, full, name, of, each, car, mak...","""Write a query that answers the following ques...","\n\nSELECT car_maker_name , car_maker_id , ..."
95,car_1,SELECT T1.Model FROM CAR_NAMES AS T1 JOIN CARS...,Which model of the car has the minimum horsepo...,"[SELECT, T1.Model, FROM, CAR_NAMES, AS, T1, JO...","[select, t1, ., model, from, car_names, as, t1...","[Which, model, of, the, car, has, the, minimum...","""Write a query that answers the following ques...",\n\nSELECT MIN(horsepower) FROM car_model
96,car_1,SELECT T1.Model FROM CAR_NAMES AS T1 JOIN CARS...,What is the model of the car with the smallest...,"[SELECT, T1.Model, FROM, CAR_NAMES, AS, T1, JO...","[select, t1, ., model, from, car_names, as, t1...","[What, is, the, model, of, the, car, with, the...","""Write a query that answers the following ques...",\n\nSELECT model FROM car WHERE horsepower =...
97,car_1,SELECT T1.model FROM CAR_NAMES AS T1 JOIN CARS...,Find the model of the car whose weight is belo...,"[SELECT, T1.model, FROM, CAR_NAMES, AS, T1, JO...","[select, t1, ., model, from, car_names, as, t1...","[Find, the, model, of, the, car, whose, weight...","""Write a query that answers the following ques...",<strong>SELECT model FROM car WHERE weight < ...
98,car_1,SELECT T1.model FROM CAR_NAMES AS T1 JOIN CARS...,What is the model for the car with a weight sm...,"[SELECT, T1.model, FROM, CAR_NAMES, AS, T1, JO...","[select, t1, ., model, from, car_names, as, t1...","[What, is, the, model, for, the, car, with, a,...","""Write a query that answers the following ques...",\n\nSELECT model FROM car WHERE weight < AVG(...
99,car_1,SELECT DISTINCT T1.Maker FROM CAR_MAKERS AS T1...,Find the name of the makers that produced some...,"[SELECT, DISTINCT, T1.Maker, FROM, CAR_MAKERS,...","[select, distinct, t1, ., maker, from, car_mak...","[Find, the, name, of, the, makers, that, produ...","""Write a query that answers the following ques...",\n\nSELECT maker FROM cars WHERE year = 1970
100,car_1,SELECT DISTINCT T1.Maker FROM CAR_MAKERS AS T1...,What is the name of the different car makers w...,"[SELECT, DISTINCT, T1.Maker, FROM, CAR_MAKERS,...","[select, distinct, t1, ., maker, from, car_mak...","[What, is, the, name, of, the, different, car,...","""Write a query that answers the following ques...",\n\nSELECT DISTINCT car_maker FROM cars WHERE...
101,car_1,"SELECT T2.Make , T1.Year FROM CARS_DATA AS T1...",Find the make and production time of the cars ...,"[SELECT, T2.Make, ,, T1.Year, FROM, CARS_DATA,...","[select, t2, ., make, ,, t1, ., year, from, ca...","[Find, the, make, and, production, time, of, t...","""Write a query that answers the following ques...","<strong>SELECT make , production_time FROM ca..."
102,car_1,"SELECT T2.Make , T1.Year FROM CARS_DATA AS T1...",What is the maker of the carr produced in the ...,"[SELECT, T2.Make, ,, T1.Year, FROM, CARS_DATA,...","[select, t2, ., make, ,, t1, ., year, from, ca...","[What, is, the, maker, of, the, carr, produced...","""Write a query that answers the following ques...","\n\nSELECT carr.maker , carr.year FROM car..."
103,car_1,SELECT DISTINCT T1.model FROM MODEL_LIST AS T1...,Which distinct car models are the produced aft...,"[SELECT, DISTINCT, T1.model, FROM, MODEL_LIST,...","[select, distinct, t1, ., model, from, model_l...","[Which, distinct, car, models, are, the, produ...","""Write a query that answers the following ques...",\n\nSELECT DISTINCT car_model FROM cars WHERE...

====================================================================================================
(52, 7)
Input:  ['"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the different models for the cards produced after 1980? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> How many car makers are there in each continents? List the continent name and the count. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the name of each continent and how many car makers are there in each one? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Which of the countries has the most car makers? List the country name. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the name of the country with the most car makers? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> How many car models are produced by each maker ? Only list the count and the maker full name . <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the number of car models that are produced by each maker and what is the id and full name of each maker? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the accelerate of the car make amc hornet sportabout (sw)? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> How much does the car accelerate that makes amc hornet sportabout (sw)? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> How many car makers are there in france? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the number of makers of care in France? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> How many car models are produced in the usa? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the count of the car models produced in the United States? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the average miles per gallon(mpg) of the cars with 4 cylinders? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the average miles per gallon of all the cards with 4 cylinders? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the smallest weight of the car produced with 8 cylinders on 1974 ? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the minimum weight of the car with 8 cylinders produced in 1974 ? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are all the makers and models? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the makers and models? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the countries having at least one car maker? List name and id. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the names and ids of all countries with at least one car maker? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the number of the cars with horsepower more than 150? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the number of cars with a horsepower greater than 150? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the average weight of cars each year? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the average weight and year for each year? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Which countries in europe have at least 3 car manufacturers? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the names of all European countries with at least 3 manufacturers? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the maximum horsepower and the make of the car models with 3 cylinders? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the largest amount of horsepower for the models with 3 cylinders and what make is it? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Which model saves the most gasoline? That is to say, have the maximum miles per gallon. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the car model with the highest mpg ? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the average horsepower of the cars before 1980? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the average horsepower for all cars produced before 1980 ? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the average edispl of the cars of model volvo? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the average edispl for all volvos? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the maximum accelerate for different number of cylinders? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the maximum accelerate for all the different cylinders? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Which model has the most version(make) of cars? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What model has the most different versions? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> How many cars have more than 4 cylinders? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the number of cars with more than 4 cylinders? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> how many cars were produced in 1980? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> In 1980, how many cars were made? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> How many car models were produced by the maker with full name American Motor Company? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the number of car models created by the car maker American Motor Company? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Which makers designed more than 3 car models? List full name and the id. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the names and ids of all makers with more than 3 models? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Which distinctive models are produced by maker with the full name General Motors or weighing more than 3500? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the different models created by either the car maker General Motors or weighed more than 3500? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> In which years cars were produced weighing no less than 3000 and no more than 4000 ? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the different years in which there were cars produced that weighed less than 4000 and also cars that weighted more than 3000 ? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the horsepower of the car with the largest accelerate? <query> ']
Original query:
SELECT DISTINCT T1.model FROM MODEL_LIST AS T1 JOIN CAR_NAMES AS T2 ON T1.model  =  T2.model JOIN CARS_DATA AS T3 ON T2.MakeId  =  T3.id WHERE T3.year  >  1980;
Generated query:


SELECT DISTINCT model FROM cards WHERE year > 1980<eos>
____________________________________________________________________________________________________
Original query:
SELECT T1.Continent ,  count(*) FROM CONTINENTS AS T1 JOIN COUNTRIES AS T2 ON T1.ContId  =  T2.continent JOIN car_makers AS T3 ON T2.CountryId  =  T3.Country GROUP BY T1.Continent;
Generated query:


SELECT  continent_name , count(*) FROM car_maker GROUP BY continent_name<eos>
____________________________________________________________________________________________________
Original query:
SELECT T1.Continent ,  count(*) FROM CONTINENTS AS T1 JOIN COUNTRIES AS T2 ON T1.ContId  =  T2.continent JOIN car_makers AS T3 ON T2.CountryId  =  T3.Country GROUP BY T1.Continent;
Generated query:


SELECT continent_name , count(*) FROM car_maker GROUP BY continent_name<eos>
____________________________________________________________________________________________________
Original query:
SELECT T2.CountryName FROM CAR_MAKERS AS T1 JOIN COUNTRIES AS T2 ON T1.Country  =  T2.CountryId GROUP BY T1.Country ORDER BY Count(*) DESC LIMIT 1;
Generated query:


SELECT  country_name FROM  car_maker GROUP BY country_name ORDER BY  country_name DESC<eos>
____________________________________________________________________________________________________
Original query:
SELECT T2.CountryName FROM CAR_MAKERS AS T1 JOIN COUNTRIES AS T2 ON T1.Country  =  T2.CountryId GROUP BY T1.Country ORDER BY Count(*) DESC LIMIT 1;
Generated query:


SELECT country_name FROM car_maker ORDER BY car_maker_count DESC LIMIT 1<eos>
____________________________________________________________________________________________________
Original query:
select count(*) ,  t2.fullname from model_list as t1 join car_makers as t2 on t1.maker  =  t2.id group by t2.id;
Generated query:


SELECT COUNT(*) ,  maker_name FROM car GROUP BY maker_name<eos>
____________________________________________________________________________________________________
Original query:
SELECT Count(*) ,  T2.FullName ,  T2.id FROM MODEL_LIST AS T1 JOIN CAR_MAKERS AS T2 ON T1.Maker  =  T2.Id GROUP BY T2.id;
Generated query:


SELECT  car_model_id ,  maker_id ,  maker_name FROM car_model<eos>
____________________________________________________________________________________________________
Original query:
SELECT T1.Accelerate FROM CARS_DATA AS T1 JOIN CAR_NAMES AS T2 ON T1.Id  =  T2.MakeId WHERE T2.Make  =  'amc hornet sportabout (sw)';
Generated query:


SELECT  * FROM  car_make  WHERE  make  =  "amc"  AND  model  =  "hornet"  AND  accelerate  =  "sport"<eos>
____________________________________________________________________________________________________
Original query:
SELECT T1.Accelerate FROM CARS_DATA AS T1 JOIN CAR_NAMES AS T2 ON T1.Id  =  T2.MakeId WHERE T2.Make  =  'amc hornet sportabout (sw)';
Generated query:


SELECT  SUM(amc_hornet_sportabout_acceleration) FROM  car<eos>
____________________________________________________________________________________________________
Original query:
SELECT count(*) FROM CAR_MAKERS AS T1 JOIN COUNTRIES AS T2 ON T1.Country  =  T2.CountryId WHERE T2.CountryName  =  'france';
Generated query:


SELECT count(*) FROM car_maker WHERE country_code = 'FRA'<eos>
____________________________________________________________________________________________________
Original query:
SELECT count(*) FROM CAR_MAKERS AS T1 JOIN COUNTRIES AS T2 ON T1.Country  =  T2.CountryId WHERE T2.CountryName  =  'france';
Generated query:


SELECT COUNT(*) FROM care_maker<eos>
____________________________________________________________________________________________________
Original query:
SELECT count(*) FROM MODEL_LIST AS T1 JOIN CAR_MAKERS AS T2 ON T1.Maker  =  T2.Id JOIN COUNTRIES AS T3 ON T2.Country  =  T3.CountryId WHERE T3.CountryName  =  'usa';
Generated query:


SELECT count(*) FROM car_model WHERE country_code = 'USA'<eos>
____________________________________________________________________________________________________
Original query:
SELECT count(*) FROM MODEL_LIST AS T1 JOIN CAR_MAKERS AS T2 ON T1.Maker  =  T2.Id JOIN COUNTRIES AS T3 ON T2.Country  =  T3.CountryId WHERE T3.CountryName  =  'usa';
Generated query:


SELECT COUNT(*) FROM car_model WHERE country_code = 'USA'<eos>
____________________________________________________________________________________________________
Original query:
SELECT avg(mpg) FROM CARS_DATA WHERE Cylinders  =  4;
Generated query:


SELECT AVG(mpg) FROM cars WHERE cylinders = 4<eos>
____________________________________________________________________________________________________
Original query:
SELECT avg(mpg) FROM CARS_DATA WHERE Cylinders  =  4;
Generated query:


SELECT AVG(miles_per_gallon) FROM cards WHERE cylinders = 4<eos>
____________________________________________________________________________________________________
Original query:
select min(weight) from cars_data where cylinders  =  8 and year  =  1974
Generated query:


SELECT MIN(weight) FROM car WHERE cylinders = 8 AND year = 1974<eos>
____________________________________________________________________________________________________
Original query:
select min(weight) from cars_data where cylinders  =  8 and year  =  1974
Generated query:


SELECT MIN(weight) FROM car WHERE cylinder_count = 8 AND year = 1974<eos>
____________________________________________________________________________________________________
Original query:
SELECT Maker ,  Model FROM MODEL_LIST;
Generated query:


SELECT DISTINCT maker, model FROM cars<eos>
____________________________________________________________________________________________________
Original query:
SELECT Maker ,  Model FROM MODEL_LIST;
Generated query:


SELECT  maker ,  model FROM  products<eos>
____________________________________________________________________________________________________
Original query:
SELECT T1.CountryName ,  T1.CountryId FROM COUNTRIES AS T1 JOIN CAR_MAKERS AS T2 ON T1.CountryId  =  T2.Country GROUP BY T1.CountryId HAVING count(*)  >=  1;
Generated query:


SELECT  country_name ,  country_id  FROM  country  WHERE  car_maker_count  >=  1<eos>
____________________________________________________________________________________________________
Original query:
SELECT T1.CountryName ,  T1.CountryId FROM COUNTRIES AS T1 JOIN CAR_MAKERS AS T2 ON T1.CountryId  =  T2.Country GROUP BY T1.CountryId HAVING count(*)  >=  1;
Generated query:


SELECT  country_name ,  country_id  FROM countries  WHERE  country_id  IN  ( SELECT  country_id  FROM cars  GROUP BY  country_id  HAVING  COUNT(*)  >=  1 )<eos>
____________________________________________________________________________________________________
Original query:
SELECT count(*) FROM CARS_DATA WHERE horsepower  >  150;
Generated query:


SELECT COUNT(*) FROM cars WHERE horsepower > 150<eos>
____________________________________________________________________________________________________
Original query:
SELECT count(*) FROM CARS_DATA WHERE horsepower  >  150;
Generated query:


SELECT COUNT(*) FROM cars WHERE horsepower > 150<eos>
____________________________________________________________________________________________________
Original query:
SELECT avg(Weight) ,  YEAR FROM CARS_DATA GROUP BY YEAR;
Generated query:


SELECT AVG(weight) FROM car<eos>
____________________________________________________________________________________________________
Original query:
SELECT avg(Weight) ,  YEAR FROM CARS_DATA GROUP BY YEAR;
Generated query:


SELECT  year ,  avg(weight) AS avg_weight ,  year FROM  "weight" GROUP BY  year<eos>
____________________________________________________________________________________________________
Original query:
SELECT T1.CountryName FROM COUNTRIES AS T1 JOIN CONTINENTS AS T2 ON T1.Continent  =  T2.ContId JOIN CAR_MAKERS AS T3 ON T1.CountryId  =  T3.Country WHERE T2.Continent  =  'europe' GROUP BY T1.CountryName HAVING count(*)  >=  3;
Generated query:


SELECT  country FROM  manufacturers WHERE  count(*) >= 3<eos>
____________________________________________________________________________________________________
Original query:
SELECT T1.CountryName FROM COUNTRIES AS T1 JOIN CONTINENTS AS T2 ON T1.Continent  =  T2.ContId JOIN CAR_MAKERS AS T3 ON T1.CountryId  =  T3.Country WHERE T2.Continent  =  'europe' GROUP BY T1.CountryName HAVING count(*)  >=  3;
Generated query:


SELECT  country_name FROM  manufacturers  WHERE  country_name  LIKE  'Europe%'  AND  manufacturer_count  >=  3<eos>
____________________________________________________________________________________________________
Original query:
SELECT T2.horsepower ,  T1.Make FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId  =  T2.Id WHERE T2.cylinders  =  3 ORDER BY T2.horsepower DESC LIMIT 1;
Generated query:


SELECT MAX(power) ,  model FROM car GROUP BY model<eos>
____________________________________________________________________________________________________
Original query:
SELECT T2.horsepower ,  T1.Make FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId  =  T2.Id WHERE T2.cylinders  =  3 ORDER BY T2.horsepower DESC LIMIT 1;
Generated query:


SELECT MAX(horsepower) ,  model_name FROM cars WHERE  cylinder_count = 3<eos>

,db_id,query,question,query_toks,query_toks_no_value,question_toks,modified question,generated_query
104,car_1,SELECT DISTINCT T1.model FROM MODEL_LIST AS T1...,What are the different models for the cards pr...,"[SELECT, DISTINCT, T1.model, FROM, MODEL_LIST,...","[select, distinct, t1, ., model, from, model_l...","[What, are, the, different, models, for, the, ...","""Write a query that answers the following ques...",\n\nSELECT DISTINCT model FROM cards WHERE ye...
105,car_1,"SELECT T1.Continent , count(*) FROM CONTINENT...",How many car makers are there in each continen...,"[SELECT, T1.Continent, ,, count, (, *, ), FROM...","[select, t1, ., continent, ,, count, (, *, ), ...","[How, many, car, makers, are, there, in, each,...","""Write a query that answers the following ques...","\n\nSELECT continent_name , count(*) FROM ca..."
106,car_1,"SELECT T1.Continent , count(*) FROM CONTINENT...",What is the name of each continent and how man...,"[SELECT, T1.Continent, ,, count, (, *, ), FROM...","[select, t1, ., continent, ,, count, (, *, ), ...","[What, is, the, name, of, each, continent, and...","""Write a query that answers the following ques...","\n\nSELECT continent_name , count(*) FROM car..."
107,car_1,SELECT T2.CountryName FROM CAR_MAKERS AS T1 JO...,Which of the countries has the most car makers...,"[SELECT, T2.CountryName, FROM, CAR_MAKERS, AS,...","[select, t2, ., countryname, from, car_makers,...","[Which, of, the, countries, has, the, most, ca...","""Write a query that answers the following ques...",\n\nSELECT country_name FROM car_maker GROU...
108,car_1,SELECT T2.CountryName FROM CAR_MAKERS AS T1 JO...,What is the name of the country with the most ...,"[SELECT, T2.CountryName, FROM, CAR_MAKERS, AS,...","[select, t2, ., countryname, from, car_makers,...","[What, is, the, name, of, the, country, with, ...","""Write a query that answers the following ques...",\n\nSELECT country_name FROM car_maker ORDER ...
109,car_1,"select count(*) , t2.fullname from model_list...",How many car models are produced by each maker...,"[select, count, (, *, ), ,, t2.fullname, from,...","[select, count, (, *, ), ,, t2, ., fullname, f...","[How, many, car, models, are, produced, by, ea...","""Write a query that answers the following ques...","\n\nSELECT COUNT(*) , maker_name FROM car GR..."
110,car_1,"SELECT Count(*) , T2.FullName , T2.id FROM M...",What is the number of car models that are prod...,"[SELECT, Count, (, *, ), ,, T2.FullName, ,, T2...","[select, count, (, *, ), ,, t2, ., fullname, ,...","[What, is, the, number, of, car, models, that,...","""Write a query that answers the following ques...","\n\nSELECT car_model_id , maker_id , maker..."
111,car_1,SELECT T1.Accelerate FROM CARS_DATA AS T1 JOIN...,What is the accelerate of the car make amc hor...,"[SELECT, T1.Accelerate, FROM, CARS_DATA, AS, T...","[select, t1, ., accelerate, from, cars_data, a...","[What, is, the, accelerate, of, the, car, make...","""Write a query that answers the following ques...",\n\nSELECT * FROM car_make WHERE make = ...
112,car_1,SELECT T1.Accelerate FROM CARS_DATA AS T1 JOIN...,How much does the car accelerate that makes am...,"[SELECT, T1.Accelerate, FROM, CARS_DATA, AS, T...","[select, t1, ., accelerate, from, cars_data, a...","[How, much, does, the, car, accelerate, that, ...","""Write a query that answers the following ques...",\n\nSELECT SUM(amc_hornet_sportabout_acceler...
113,car_1,SELECT count(*) FROM CAR_MAKERS AS T1 JOIN COU...,How many car makers are there in france?,"[SELECT, count, (, *, ), FROM, CAR_MAKERS, AS,...","[select, count, (, *, ), from, car_makers, as,...","[How, many, car, makers, are, there, in, franc...","""Write a query that answers the following ques...",\n\nSELECT count(*) FROM car_maker WHERE coun...
114,car_1,SELECT count(*) FROM CAR_MAKERS AS T1 JOIN COU...,What is the number of makers of care in France?,"[SELECT, count, (, *, ), FROM, CAR_MAKERS, AS,...","[select, count, (, *, ), from, car_makers, as,...","[What, is, the, number, of, makers, of, care, ...","""Write a query that answers the following ques...",\n\nSELECT COUNT(*) FROM care_maker
115,car_1,SELECT count(*) FROM MODEL_LIST AS T1 JOIN CAR...,How many car models are produced in the usa?,"[SELECT, count, (, *, ), FROM, MODEL_LIST, AS,...","[select, count, (, *, ), from, model_list, as,...","[How, many, car, models, are, produced, in, th...","""Write a query that answers the following ques...",\n\nSELECT count(*) FROM car_model WHERE coun...
116,car_1,SELECT count(*) FROM MODEL_LIST AS T1 JOIN CAR...,What is the count of the car models produced i...,"[SELECT, count, (, *, ), FROM, MODEL_LIST, AS,...","[select, count, (, *, ), from, model_list, as,...","[What, is, the, count, of, the, car, models, p...","""Write a query that answers the following ques...",\n\nSELECT COUNT(*) FROM car_model WHERE coun...
117,car_1,SELECT avg(mpg) FROM CARS_DATA WHERE Cylinders...,What is the average miles per gallon(mpg) of t...,"[SELECT, avg, (, mpg, ), FROM, CARS_DATA, WHER...","[select, avg, (, mpg, ), from, cars_data, wher...","[What, is, the, average, miles, per, gallon, (...","""Write a query that answers the following ques...",\n\nSELECT AVG(mpg) FROM cars WHERE cylinders...
118,car_1,SELECT avg(mpg) FROM CARS_DATA WHERE Cylinders...,What is the average miles per gallon of all th...,"[SELECT, avg, (, mpg, ), FROM, CARS_DATA, WHER...","[select, avg, (, mpg, ), from, cars_data, wher...","[What, is, the, average, miles, per, gallon, o...","""Write a query that answers the following ques...",\n\nSELECT AVG(miles_per_gallon) FROM cards W...
119,car_1,select min(weight) from cars_data where cylind...,What is the smallest weight of the car produce...,"[select, min, (, weight, ), from, cars_data, w...","[select, min, (, weight, ), from, cars_data, w...","[What, is, the, smallest, weight, of, the, car...","""Write a query that answers the following ques...",\n\nSELECT MIN(weight) FROM car WHERE cylinde...
120,car_1,select min(weight) from cars_data where cylind...,What is the minimum weight of the car with 8 c...,"[select, min, (, weight, ), from, cars_data, w...","[select, min, (, weight, ), from, cars_data, w...","[What, is, the, minimum, weight, of, the, car,...","""Write a query that answers the following ques...",\n\nSELECT MIN(weight) FROM car WHERE cylinde...
121,car_1,"SELECT Maker , Model FROM MODEL_LIST;",What are all the makers and models?,"[SELECT, Maker, ,, Model, FROM, MODEL_LIST, ;]","[select, maker, ,, model, from, model_list]","[What, are, all, the, makers, and, models, ?]","""Write a query that answers the following ques...","\n\nSELECT DISTINCT maker, model FROM cars"
122,car_1,"SELECT Maker , Model FROM MODEL_LIST;",What are the makers and models?,"[SELECT, Maker, ,, Model, FROM, MODEL_LIST, ;]","[select, maker, ,, model, from, model_list]","[What, are, the, makers, and, models, ?]","""Write a query that answers the following ques...","\n\nSELECT maker , model FROM products"
123,car_1,"SELECT T1.CountryName , T1.CountryId FROM COU...",What are the countries having at least one car...,"[SELECT, T1.CountryName, ,, T1.CountryId, FROM...","[select, t1, ., countryname, ,, t1, ., country...","[What, are, the, countries, having, at, least,...","""Write a query that answers the following ques...","\n\nSELECT country_name , country_id FROM ..."
124,car_1,"SELECT T1.CountryName , T1.CountryId FROM COU...",What are the names and ids of all countries wi...,"[SELECT, T1.CountryName, ,, T1.CountryId, FROM...","[select, t1, ., countryname, ,, t1, ., country...","[What, are, the, names, and, ids, of, all, cou...","""Write a query that answers the following ques...","\n\nSELECT country_name , country_id FROM ..."
125,car_1,SELECT count(*) FROM CARS_DATA WHERE horsepowe...,What is the number of the cars with horsepower...,"[SELECT, count, (, *, ), FROM, CARS_DATA, WHER...","[select, count, (, *, ), from, cars_data, wher...","[What, is, the, number, of, the, cars, with, h...","""Write a query that answers the following ques...",\n\nSELECT COUNT(*) FROM cars WHERE horsepowe...
126,car_1,SELECT count(*) FROM CARS_DATA WHERE horsepowe...,What is the number of cars with a horsepower g...,"[SELECT, count, (, *, ), FROM, CARS_DATA, WHER...","[select, count, (, *, ), from, cars_data, wher...","[What, is, the, number, of, cars, with, a, hor...","""Write a query that answers the following ques...",\n\nSELECT COUNT(*) FROM cars WHERE horsepowe...
127,car_1,"SELECT avg(Weight) , YEAR FROM CARS_DATA GROU...",What is the average weight of cars each year?,"[SELECT, avg, (, Weight, ), ,, YEAR, FROM, CAR...","[select, avg, (, weight, ), ,, year, from, car...","[What, is, the, average, weight, of, cars, eac...","""Write a query that answers the following ques...",\n\nSELECT AVG(weight) FROM car
128,car_1,"SELECT avg(Weight) , YEAR FROM CARS_DATA GROU...",What is the average weight and year for each y...,"[SELECT, avg, (, Weight, ), ,, YEAR, FROM, CAR...","[select, avg, (, weight, ), ,, year, from, car...","[What, is, the, average, weight, and, year, fo...","""Write a query that answers the following ques...","\n\nSELECT year , avg(weight) AS avg_weight..."
129,car_1,SELECT T1.CountryName FROM COUNTRIES AS T1 JOI...,Which countries in europe have at least 3 car ...,"[SELECT, T1.CountryName, FROM, COUNTRIES, AS, ...","[select, t1, ., countryname, from, countries, ...","[Which, countries, in, europe, have, at, least...","""Write a query that answers the following ques...",\n\nSELECT country FROM manufacturers WHERE...
130,car_1,SELECT T1.CountryName FROM COUNTRIES AS T1 JOI...,What are the names of all European countries w...,"[SELECT, T1.CountryName, FROM, COUNTRIES, AS, ...","[select, t1, ., countryname, from, countries, ...","[What, are, the, names, of, all, European, cou...","""Write a query that answers the following ques...",\n\nSELECT country_name FROM manufacturers ...
131,car_1,"SELECT T2.horsepower , T1.Make FROM CAR_NAMES...",What is the maximum horsepower and the make of...,"[SELECT, T2.horsepower, ,, T1.Make, FROM, CAR_...","[select, t2, ., horsepower, ,, t1, ., make, fr...","[What, is, the, maximum, horsepower, and, the,...","""Write a query that answers the following ques...","\n\nSELECT MAX(power) , model FROM car GROUP..."
132,car_1,"SELECT T2.horsepower , T1.Make FROM CAR_NAMES...",What is the largest amount of horsepower for t...,"[SELECT, T2.horsepower, ,, T1.Make, FROM, CAR_...","[select, t2, ., horsepower, ,, t1, ., make, fr...","[What, is, the, largest, amount, of, horsepowe...","""Write a query that answers the following ques...","\n\nSELECT MAX(horsepower) , model_name FROM..."
133,car_1,SELECT T1.Model FROM CAR_NAMES AS T1 JOIN CARS...,Which model saves the most gasoline? That is t...,"[SELECT, T1.Model, FROM, CAR_NAMES, AS, T1, JO...","[select, t1, ., model, from, car_names, as, t1...","[Which, model, saves, the, most, gasoline, ?, ...","""Write a query that answers the following ques...","\n\nSELECT model_name , miles_per_gallon F..."
134,car_1,select t1.model from car_names as t1 join cars...,What is the car model with the highest mpg ?,"[select, t1.model, from, car_names, as, t1, jo...","[select, t1, ., model, from, car_names, as, t1...","[What, is, the, car, model, with, the, highest...","""Write a query that answers the following ques...",\n\nSELECT * FROM car_model ORDER BY mpg ...
135,car_1,SELECT avg(horsepower) FROM CARS_DATA WHERE YE...,What is the average horsepower of the cars bef...,"[SELECT, avg, (, horsepower, ), FROM, CARS_DAT...","[select, avg, (, horsepower, ), from, cars_dat...","[What, is, the, average, horsepower, of, the, ...","""Write a query that answers the following ques...",\n\nSELECT AVG(horsepower) FROM cars WHERE ye...
136,car_1,select avg(horsepower) from cars_data where ye...,What is the average horsepower for all cars pr...,"[select, avg, (, horsepower, ), from, cars_dat...","[select, avg, (, horsepower, ), from, cars_dat...","[What, is, the, average, horsepower, for, all,...","""Write a query that answers the following ques...",\n\nSELECT AVG(horsepower) FROM cars WHERE ye...
137,car_1,SELECT avg(T2.edispl) FROM CAR_NAMES AS T1 JOI...,What is the average edispl of the cars of mode...,"[SELECT, avg, (, T2.edispl, ), FROM, CAR_NAMES...","[select, avg, (, t2, ., edispl, ), from, car_n...","[What, is, the, average, edispl, of, the, cars...","""Write a query that answers the following ques...",\n\nSELECT AVG(edispl) FROM cars WHERE model ...
138,car_1,SELECT avg(T2.edispl) FROM CAR_NAMES AS T1 JOI...,What is the average edispl for all volvos?,"[SELECT, avg, (, T2.edispl, ), FROM, CAR_NAMES...","[select, avg, (, t2, ., edispl, ), from, car_n...","[What, is, the, average, edispl, for, all, vol...","""Write a query that answers the following ques...",\n\nSELECT AVG(edispl) FROM cars WHERE brand ...
139,car_1,"SELECT max(Accelerate) , Cylinders FROM CARS_...",What is the maximum accelerate for different n...,"[SELECT, max, (, Accelerate, ), ,, Cylinders, ...","[select, max, (, accelerate, ), ,, cylinders, ...","[What, is, the, maximum, accelerate, for, diff...","""Write a query that answers the following ques...",\n\nSELECT MAX(accelerate) FROM cylinder
140,car_1,"SELECT max(Accelerate) , Cylinders FROM CARS_...",What is the maximum accelerate for all the dif...,"[SELECT, max, (, Accelerate, ), ,, Cylinders, ...","[select, max, (, accelerate, ), ,, cylinders, ...","[What, is, the, maximum, accelerate, for, all,...","""Write a query that answers the following ques...",\n\nSELECT MAX(accelerate) FROM cylinder
141,car_1,SELECT Model FROM CAR_NAMES GROUP BY Model ORD...,Which model has the most version(make) of cars?,"[SELECT, Model, FROM, CAR_NAMES, GROUP, BY, Mo...","[select, model, from, car_names, group, by, mo...","[Which, model, has, the, most, version, (, mak...","""Write a query that answers the following ques...",\n\nSELECT model FROM car GROUP BY model...
142,car_1,SELECT Model FROM CAR_NAMES GROUP BY Model ORD...,What model has the most different versions?,"[SELECT, Model, FROM, CAR_NAMES, GROUP, BY, Mo...","[select, model, from, car_names, group, by, mo...","[What, model, has, the, most, different, versi...","""Write a query that answers the following ques...","\n\nSELECT model_name , count(*) FROM mode..."
143,car_1,SELECT count(*) FROM CARS_DATA WHERE Cylinders...,How many cars have more than 4 cylinders?,"[SELECT, count, (, *, ), FROM, CARS_DATA, WHER...","[select, count, (, *, ), from, cars_data, wher...","[How, many, cars, have, more, than, 4, cylinde...","""Write a query that answers the following ques...",\nSELECT count(*) FROM cars WHERE cylinders > 4
144,car_1,SELECT count(*) FROM CARS_DATA WHERE Cylinders...,What is the number of cars with more than 4 cy...,"[SELECT, count, (, *, ), FROM, CARS_DATA, WHER...","[select, count, (, *, ), from, cars_data, wher...","[What, is, the, number, of, cars, with, more, ...","""Write a query that answers the following ques...",\n\nSELECT COUNT(*) FROM cars WHERE cylinders...
145,car_1,SELECT count(*) FROM CARS_DATA WHERE YEAR = ...,how many cars were produced in 1980?,"[SELECT, count, (, *, ), FROM, CARS_DATA, WHER...","[select, count, (, *, ), from, cars_data, wher...","[how, many, cars, were, produced, in, 1980, ?]","""Write a query that answers the following ques...",\n\nSELECT COUNT(*) FROM cars WHERE year = 1980
146,car_1,SELECT count(*) FROM CARS_DATA WHERE YEAR = ...,"In 1980, how many cars were made?","[SELECT, count, (, *, ), FROM, CARS_DATA, WHER...","[select, count, (, *, ), from, cars_data, wher...","[In, 1980, ,, how, many, cars, were, made, ?]","""Write a query that answers the following ques...",\n\nSELECT count(*) FROM cars WHERE year = 1980
147,car_1,SELECT count(*) FROM CAR_MAKERS AS T1 JOIN MOD...,How many car models were produced by the maker...,"[SELECT, count, (, *, ), FROM, CAR_MAKERS, AS,...","[select, count, (, *, ), from, car_makers, as,...","[How, many, car, models, were, produced, by, t...","""Write a query that answers the following ques...",\n\nSELECT COUNT(*) FROM car_model WHERE make...
148,car_1,SELECT count(*) FROM CAR_MAKERS AS T1 JOIN MOD...,What is the number of car models created by th...,"[SELECT, count, (, *, ), FROM, CAR_MAKERS, AS,...","[select, count, (, *, ), from, car_makers, as,...","[What, is, the, number, of, car, models, creat...","""Write a query that answers the following ques...",\n\nSELECT COUNT(*) FROM car_model WHERE car_...
149,car_1,"SELECT T1.FullName , T1.Id FROM CAR_MAKERS AS...",Which makers designed more than 3 car models? ...,"[SELECT, T1.FullName, ,, T1.Id, FROM, CAR_MAKE...","[select, t1, ., fullname, ,, t1, ., id, from, ...","[Which, makers, designed, more, than, 3, car, ...","""Write a query that answers the following ques...","\n\nSELECT maker_name , maker_id FROM make..."
150,car_1,"SELECT T1.FullName , T1.Id FROM CAR_MAKERS AS...",What are the names and ids of all makers with ...,"[SELECT, T1.FullName, ,, T1.Id, FROM, CAR_MAKE...","[select, t1, ., fullname, ,, t1, ., id, from, ...","[What, are, the, names, and, ids, of, all, mak...","""Write a query that answers the following ques...","\n\nSELECT maker_name , maker_id FROM makers ..."
151,car_1,SELECT DISTINCT T2.Model FROM CAR_NAMES AS T1 ...,Which distinctive models are produced by maker...,"[SELECT, DISTINCT, T2.Model, FROM, CAR_NAMES, ...","[select, distinct, t2, ., model, from, car_nam...","[Which, distinctive, models, are, produced, by...","""Write a query that answers the following ques...",\n\nSELECT DISTINCT DISTINCT DISTINCT DIST...
152,car_1,SELECT DISTINCT T2.Model FROM CAR_NAMES AS T1 ...,What are the different models created by eithe...,"[SELECT, DISTINCT, T2.Model, FROM, CAR_NAMES, ...","[select, distinct, t2, ., model, from, car_nam...","[What, are, the, different, models, created, b...","""Write a query that answers the following ques...",\n\nSELECT DISTINCT model FROM cars WHERE mak...
153,car_1,select distinct year from cars_data where weig...,In which years cars were produced weighing no ...,"[select, distinct, year, from, cars_data, wher...","[select, distinct, year, from, cars_data, wher...","[In, which, years, cars, were, produced, weigh...","""Write a query that answers the following ques...",\n\nSELECT year FROM cars WHERE weight BETWE...
154,car_1,select distinct year from cars_data where weig...,What are the different years in which there we...,"[select, distinct, year, from, cars_data, wher...","[select, distinct, year, from, cars_data, wher...","[What, are, the, different, years, in, which, ...","""Write a query that answers the following ques...",\n\nSELECT DISTINCT YEAR FROM CAR_WEIGHT WHER...
155,car_1,SELECT T1.horsepower FROM CARS_DATA AS T1 ORDE...,What is the horsepower of the car with the lar...,"[SELECT, T1.horsepower, FROM, CARS_DATA, AS, T...","[select, t1, ., horsepower, from, cars_data, a...","[What, is, the, horsepower, of, the, car, with...","""Write a query that answers the following ques...",\n\nSELECT MAX(power) FROM car

====================================================================================================
(52, 7)
Input:  ['"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the horsepower of the car with the greatest accelerate? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> For model volvo, how many cylinders does the car with the least accelerate have? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> For a volvo model, how many cylinders does the version with least accelerate have? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> How many cars have a larger accelerate than the car with the largest horsepower? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the number of cars with a greater accelerate than the one with the most horsepower? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> How many countries has more than 2 car makers ? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the number of countries with more than 2 car makers ? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> How many cars has over 6 cylinders? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the number of carsw ith over 6 cylinders? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> For the cars with 4 cylinders, which model has the largest horsepower? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> For all of the 4 cylinder cars, which model has the most horsepower? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Among the cars with more than lowest horsepower, which ones do not have more than 3 cylinders? List the car makeid and make name. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Among the cars that do not have the minimum horsepower , what are the make ids and names of all those with less than 4 cylinders ? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the maximum miles per gallon of the car with 8 cylinders or produced before 1980 ? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the maximum mpg of the cars that had 8 cylinders or that were produced before 1980 ? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Which models are lighter than 3500 but not built by the \'Ford Motor Company\'? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the different models wthat are lighter than 3500 but were not built by the Ford Motor Company? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the name of the countries where there is not a single car maker? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the names of the countries with no car makers? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Which are the car makers which produce at least 2 models and more than 3 car makers ? List the id and the maker . <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the ids and makers of all car makers that produce at least 2 models and make more than 3 cars? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the id and names of the countries which have more than 3 car makers or produce the \'fiat\' model? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the ids and names of all countries that either have more than 3 car makers or produce fiat model ? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Which country does Airline "JetBlue Airways" belong to? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What country is Jetblue Airways affiliated with? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the abbreviation of Airline "JetBlue Airways"? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Which abbreviation corresponds to Jetblue Airways? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> List all airline names and their abbreviations in "USA". <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the airline names and abbreviations for airlines in the USA? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> List the airport code and name in the city of Anthony. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Give the airport code and airport name corresonding to the city Anthony. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> How many airlines do we have? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the total number of airlines? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> How many airports do we have? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Return the number of  airports. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> How many flights do we have? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Return the number of flights. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Which airline has abbreviation \'UAL\'? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Give the airline with abbreviation \'UAL\'. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> How many airlines are from USA? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Return the number of airlines in the USA. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Which city and country is the Alton airport at? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Give the city and country for the Alton airport. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the airport name for airport \'AKO\'? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Return the name of the airport with code \'AKO\'. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are airport names at City \'Aberdeen\'? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the names of airports in Aberdeen? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> How many flights depart from \'APG\'? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Count the number of flights departing from \'APG\'. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> How many flights have destination ATO? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Count the number of flights into ATO. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> How many flights depart from City Aberdeen? <query> ']
Original query:
SELECT T1.horsepower FROM CARS_DATA AS T1 ORDER BY T1.accelerate DESC LIMIT 1;
Generated query:


SELECT  MAX(power) FROM car<eos>
____________________________________________________________________________________________________
Original query:
SELECT T1.cylinders FROM CARS_DATA AS T1 JOIN CAR_NAMES AS T2 ON T1.Id  =  T2.MakeId WHERE T2.Model  =  'volvo' ORDER BY T1.accelerate ASC LIMIT 1;
Generated query:


SELECT COUNT(*) FROM volvo WHERE accelerate = (SELECT MIN(accelerate) FROM volvo)<eos>
____________________________________________________________________________________________________
Original query:
SELECT T1.cylinders FROM CARS_DATA AS T1 JOIN CAR_NAMES AS T2 ON T1.Id  =  T2.MakeId WHERE T2.Model  =  'volvo' ORDER BY T1.accelerate ASC LIMIT 1;
Generated query:


SELECT  count(*) FROM  Volvo WHERE  model = 'V40'  ORDER BY  accelerate  DESC LIMIT  1<eos>
____________________________________________________________________________________________________
Original query:
SELECT COUNT(*) FROM CARS_DATA WHERE Accelerate  >  ( SELECT Accelerate FROM CARS_DATA ORDER BY Horsepower DESC LIMIT 1 );
Generated query:


SELECT count(*) FROM car WHERE accelerate > (SELECT max(accelerate) FROM car)<eos>
____________________________________________________________________________________________________
Original query:
SELECT COUNT(*) FROM CARS_DATA WHERE Accelerate  >  ( SELECT Accelerate FROM CARS_DATA ORDER BY Horsepower DESC LIMIT 1 );
Generated query:


SELECT count(*) FROM cars WHERE horsepower > (SELECT max(horsepower) FROM cars)<eos>
____________________________________________________________________________________________________
Original query:
select count(*) from countries as t1 join car_makers as t2 on t1.countryid  =  t2.country group by t1.countryid having count(*)  >  2
Generated query:


SELECT count(*) FROM country GROUP BY country HAVING count(*) > 2<eos>
____________________________________________________________________________________________________
Original query:
select count(*) from countries as t1 join car_makers as t2 on t1.countryid  =  t2.country group by t1.countryid having count(*)  >  2
Generated query:


SELECT COUNT(*) FROM country WHERE  COUNT(*) > 2<eos>
____________________________________________________________________________________________________
Original query:
SELECT COUNT(*) FROM CARS_DATA WHERE Cylinders  >  6;
Generated query:

SELECT count(*) FROM car WHERE cylinders > 6<eos>
____________________________________________________________________________________________________
Original query:
SELECT COUNT(*) FROM CARS_DATA WHERE Cylinders  >  6;
Generated query:


SELECT COUNT(*) FROM car WHERE cylinders > 6<eos>
____________________________________________________________________________________________________
Original query:
SELECT T1.Model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId  =  T2.Id WHERE T2.Cylinders  =  4 ORDER BY T2.horsepower DESC LIMIT 1;
Generated query:


SELECT  * FROM  car WHERE  cylinders = 4 ORDER BY horsepower DESC LIMIT 1<eos>
____________________________________________________________________________________________________
Original query:
SELECT T1.Model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId  =  T2.Id WHERE T2.Cylinders  =  4 ORDER BY T2.horsepower DESC LIMIT 1;
Generated query:


SELECT  model_name ,  horsepower  FROM  car  WHERE  car_type  =  4  ORDER BY  horsepower  DESC<eos>
____________________________________________________________________________________________________
Original query:
SELECT T2.MakeId ,  T2.Make FROM CARS_DATA AS T1 JOIN CAR_NAMES AS T2 ON T1.Id  =  T2.MakeId WHERE T1.Horsepower  >  (SELECT min(Horsepower) FROM CARS_DATA) AND T1.Cylinders  <=  3;
Generated query:


SELECT car_makeid , car_name FROM cars WHERE horsepower > (SELECT MIN(horsepower) FROM cars)<eos>
____________________________________________________________________________________________________
Original query:
select t2.makeid ,  t2.make from cars_data as t1 join car_names as t2 on t1.id  =  t2.makeid where t1.horsepower  >  (select min(horsepower) from cars_data) and t1.cylinders  <  4;
Generated query:


SELECT  car_make_id , car_name FROM cars WHERE car_hp < 4<eos>
____________________________________________________________________________________________________
Original query:
select max(mpg) from cars_data where cylinders  =  8 or year  <  1980
Generated query:


SELECT MAX(miles_per_gallon) FROM car WHERE cylinders = 8 AND produced < 1980<eos>
____________________________________________________________________________________________________
Original query:
select max(mpg) from cars_data where cylinders  =  8 or year  <  1980
Generated query:


SELECT MAX(mpg) FROM cars WHERE cylinders = 8 OR year < 1980<eos>
____________________________________________________________________________________________________
Original query:
SELECT DISTINCT T1.model FROM MODEL_LIST AS T1 JOIN CAR_NAMES AS T2 ON T1.Model  =  T2.Model JOIN CARS_DATA AS T3 ON T2.MakeId  =  T3.Id JOIN CAR_MAKERS AS T4 ON T1.Maker  =  T4.Id WHERE T3.weight  <  3500 AND T4.FullName != 'Ford Motor Company';
Generated query:


SELECT  * FROM  models WHERE  weight < 3500 AND  brand  NOT  =  "Ford Motor Company"<eos>
____________________________________________________________________________________________________
Original query:
SELECT DISTINCT T1.model FROM MODEL_LIST AS T1 JOIN CAR_NAMES AS T2 ON T1.Model  =  T2.Model JOIN CARS_DATA AS T3 ON T2.MakeId  =  T3.Id JOIN CAR_MAKERS AS T4 ON T1.Maker  =  T4.Id WHERE T3.weight  <  3500 AND T4.FullName != 'Ford Motor Company';
Generated query:


SELECT DISTINCT model FROM cars WHERE weight < 3500<eos>
____________________________________________________________________________________________________
Original query:
SELECT CountryName FROM countries EXCEPT SELECT T1.CountryName FROM countries AS T1 JOIN CAR_MAKERS AS T2 ON T1.countryId  =  T2.Country;
Generated query:


SELECT DISTINCT country FROM cars WHERE manufacturer IS NULL<eos>
____________________________________________________________________________________________________
Original query:
SELECT CountryName FROM countries EXCEPT SELECT T1.CountryName FROM countries AS T1 JOIN CAR_MAKERS AS T2 ON T1.countryId  =  T2.Country;
Generated query:


SELECT DISTINCT country FROM country WHERE car_maker IS NULL<eos>
____________________________________________________________________________________________________
Original query:
select t1.id ,  t1.maker from car_makers as t1 join model_list as t2 on t1.id  =  t2.maker group by t1.id having count(*)  >=  2 intersect select t1.id ,  t1.maker from car_makers as t1 join model_list as t2 on t1.id  =  t2.maker join car_names as t3 on t2.model  =  t3.model group by t1.id having count(*)  >  3;
Generated query:


SELECT  car_maker_id ,  car_maker  FROM  car_maker  WHERE  car_maker_id  >  3  AND  count  >  2<eos>
____________________________________________________________________________________________________
Original query:
SELECT T1.Id ,  T1.Maker FROM CAR_MAKERS AS T1 JOIN MODEL_LIST AS T2 ON T1.Id  =  T2.Maker GROUP BY T1.Id HAVING count(*)  >=  2 INTERSECT SELECT T1.Id ,  T1.Maker FROM CAR_MAKERS AS T1 JOIN MODEL_LIST AS T2 ON T1.Id  =  T2.Maker JOIN CAR_NAMES AS T3 ON T2.model  =  T3.model GROUP BY T1.Id HAVING count(*)  >  3;
Generated query:


SELECT  car_maker_id ,  car_maker_name  FROM  car_maker  WHERE  car_maker_id  IN  ( SELECT  car_maker_id  FROM  car_maker  WHERE  model_count  >=  2  AND  car_count  >=  3  )<eos>
____________________________________________________________________________________________________
Original query:
SELECT T1.countryId ,  T1.CountryName FROM Countries AS T1 JOIN CAR_MAKERS AS T2 ON T1.CountryId  =  T2.Country GROUP BY T1.countryId HAVING count(*)  >  3 UNION SELECT T1.countryId ,  T1.CountryName FROM Countries AS T1 JOIN CAR_MAKERS AS T2 ON T1.CountryId  =  T2.Country JOIN MODEL_LIST AS T3 ON T2.Id  =  T3.Maker WHERE T3.Model  =  'fiat';
Generated query:


SELECT  country_id ,  country_name FROM countries WHERE  COUNT(*)  >  3<eos>
____________________________________________________________________________________________________
Original query:
select t1.countryid ,  t1.countryname from countries as t1 join car_makers as t2 on t1.countryid  =  t2.country group by t1.countryid having count(*)  >  3 union select t1.countryid ,  t1.countryname from countries as t1 join car_makers as t2 on t1.countryid  =  t2.country join model_list as t3 on t2.id  =  t3.maker where t3.model  =  'fiat';
Generated query:


SELECT  country_id ,  country_name  FROM  country  WHERE  car_makers  >  3  OR  model  =  "fiat"<eos>
____________________________________________________________________________________________________
Original query:
SELECT Country FROM AIRLINES WHERE Airline  =  "JetBlue Airways"
Generated query:


SELECT  country FROM Airline WHERE Airline_name  =  "JetBlue Airways"<eos>
____________________________________________________________________________________________________
Original query:
SELECT Country FROM AIRLINES WHERE Airline  =  "JetBlue Airways"
Generated query:


SELECT  country FROM airlines WHERE airline_name  =  "Jetblue Airways"<eos>
____________________________________________________________________________________________________
Original query:
SELECT Abbreviation FROM AIRLINES WHERE Airline  =  "JetBlue Airways"
Generated query:


SELECT  abbr  FROM  Airline  WHERE  name  =  "JetBlue Airways"<eos>
____________________________________________________________________________________________________
Original query:
SELECT Abbreviation FROM AIRLINES WHERE Airline  =  "JetBlue Airways"
Generated query:



,db_id,query,question,query_toks,query_toks_no_value,question_toks,modified question,generated_query
156,car_1,SELECT T1.horsepower FROM CARS_DATA AS T1 ORDE...,What is the horsepower of the car with the gre...,"[SELECT, T1.horsepower, FROM, CARS_DATA, AS, T...","[select, t1, ., horsepower, from, cars_data, a...","[What, is, the, horsepower, of, the, car, with...","""Write a query that answers the following ques...",\n\nSELECT MAX(power) FROM car
157,car_1,SELECT T1.cylinders FROM CARS_DATA AS T1 JOIN ...,"For model volvo, how many cylinders does the c...","[SELECT, T1.cylinders, FROM, CARS_DATA, AS, T1...","[select, t1, ., cylinders, from, cars_data, as...","[For, model, volvo, ,, how, many, cylinders, d...","""Write a query that answers the following ques...",\n\nSELECT COUNT(*) FROM volvo WHERE accelera...
158,car_1,SELECT T1.cylinders FROM CARS_DATA AS T1 JOIN ...,"For a volvo model, how many cylinders does the...","[SELECT, T1.cylinders, FROM, CARS_DATA, AS, T1...","[select, t1, ., cylinders, from, cars_data, as...","[For, a, volvo, model, ,, how, many, cylinders...","""Write a query that answers the following ques...",\n\nSELECT count(*) FROM Volvo WHERE model...
159,car_1,SELECT COUNT(*) FROM CARS_DATA WHERE Accelerat...,How many cars have a larger accelerate than th...,"[SELECT, COUNT, (, *, ), FROM, CARS_DATA, WHER...","[select, count, (, *, ), from, cars_data, wher...","[How, many, cars, have, a, larger, accelerate,...","""Write a query that answers the following ques...",\n\nSELECT count(*) FROM car WHERE accelerate...
160,car_1,SELECT COUNT(*) FROM CARS_DATA WHERE Accelerat...,What is the number of cars with a greater acce...,"[SELECT, COUNT, (, *, ), FROM, CARS_DATA, WHER...","[select, count, (, *, ), from, cars_data, wher...","[What, is, the, number, of, cars, with, a, gre...","""Write a query that answers the following ques...",\n\nSELECT count(*) FROM cars WHERE horsepowe...
161,car_1,select count(*) from countries as t1 join car_...,How many countries has more than 2 car makers ?,"[select, count, (, *, ), from, countries, as, ...","[select, count, (, *, ), from, countries, as, ...","[How, many, countries, has, more, than, 2, car...","""Write a query that answers the following ques...",\n\nSELECT count(*) FROM country GROUP BY cou...
162,car_1,select count(*) from countries as t1 join car_...,What is the number of countries with more than...,"[select, count, (, *, ), from, countries, as, ...","[select, count, (, *, ), from, countries, as, ...","[What, is, the, number, of, countries, with, m...","""Write a query that answers the following ques...",\n\nSELECT COUNT(*) FROM country WHERE COUNT...
163,car_1,SELECT COUNT(*) FROM CARS_DATA WHERE Cylinders...,How many cars has over 6 cylinders?,"[SELECT, COUNT, (, *, ), FROM, CARS_DATA, WHER...","[select, count, (, *, ), from, cars_data, wher...","[How, many, cars, has, over, 6, cylinders, ?]","""Write a query that answers the following ques...",\nSELECT count(*) FROM car WHERE cylinders > 6
164,car_1,SELECT COUNT(*) FROM CARS_DATA WHERE Cylinders...,What is the number of carsw ith over 6 cylinders?,"[SELECT, COUNT, (, *, ), FROM, CARS_DATA, WHER...","[select, count, (, *, ), from, cars_data, wher...","[What, is, the, number, of, carsw, ith, over, ...","""Write a query that answers the following ques...",\n\nSELECT COUNT(*) FROM car WHERE cylinders > 6
165,car_1,SELECT T1.Model FROM CAR_NAMES AS T1 JOIN CARS...,"For the cars with 4 cylinders, which model has...","[SELECT, T1.Model, FROM, CAR_NAMES, AS, T1, JO...","[select, t1, ., model, from, car_names, as, t1...","[For, the, cars, with, 4, cylinders, ,, which,...","""Write a query that answers the following ques...",\n\nSELECT * FROM car WHERE cylinders = 4 ...
166,car_1,SELECT T1.Model FROM CAR_NAMES AS T1 JOIN CARS...,"For all of the 4 cylinder cars, which model ha...","[SELECT, T1.Model, FROM, CAR_NAMES, AS, T1, JO...","[select, t1, ., model, from, car_names, as, t1...","[For, all, of, the, 4, cylinder, cars, ,, whic...","""Write a query that answers the following ques...","\n\nSELECT model_name , horsepower FROM c..."
167,car_1,"SELECT T2.MakeId , T2.Make FROM CARS_DATA AS ...",Among the cars with more than lowest horsepowe...,"[SELECT, T2.MakeId, ,, T2.Make, FROM, CARS_DAT...","[select, t2, ., makeid, ,, t2, ., make, from, ...","[Among, the, cars, with, more, than, lowest, h...","""Write a query that answers the following ques...","\n\nSELECT car_makeid , car_name FROM cars WH..."
168,car_1,"select t2.makeid , t2.make from cars_data as ...",Among the cars that do not have the minimum ho...,"[select, t2.makeid, ,, t2.make, from, cars_dat...","[select, t2, ., makeid, ,, t2, ., make, from, ...","[Among, the, cars, that, do, not, have, the, m...","""Write a query that answers the following ques...","\n\nSELECT car_make_id , car_name FROM cars ..."
169,car_1,select max(mpg) from cars_data where cylinders...,What is the maximum miles per gallon of the ca...,"[select, max, (, mpg, ), from, cars_data, wher...","[select, max, (, mpg, ), from, cars_data, wher...","[What, is, the, maximum, miles, per, gallon, o...","""Write a query that answers the following ques...",\n\nSELECT MAX(miles_per_gallon) FROM car WHE...
170,car_1,select max(mpg) from cars_data where cylinders...,What is the maximum mpg of the cars that had 8...,"[select, max, (, mpg, ), from, cars_data, wher...","[select, max, (, mpg, ), from, cars_data, wher...","[What, is, the, maximum, mpg, of, the, cars, t...","""Write a query that answers the following ques...",\n\nSELECT MAX(mpg) FROM cars WHERE cylinders...
171,car_1,SELECT DISTINCT T1.model FROM MODEL_LIST AS T1...,Which models are lighter than 3500 but not bui...,"[SELECT, DISTINCT, T1.model, FROM, MODEL_LIST,...","[select, distinct, t1, ., model, from, model_l...","[Which, models, are, lighter, than, 3500, but,...","""Write a query that answers the following ques...",\n\nSELECT * FROM models WHERE weight < 35...
172,car_1,SELECT DISTINCT T1.model FROM MODEL_LIST AS T1...,What are the different models wthat are lighte...,"[SELECT, DISTINCT, T1.model, FROM, MODEL_LIST,...","[select, distinct, t1, ., model, from, model_l...","[What, are, the, different, models, wthat, are...","""Write a query that answers the following ques...",\n\nSELECT DISTINCT model FROM cars WHERE wei...
173,car_1,SELECT CountryName FROM countries EXCEPT SELEC...,What are the name of the countries where there...,"[SELECT, CountryName, FROM, countries, EXCEPT,...","[select, countryname, from, countries, except,...","[What, are, the, name, of, the, countries, whe...","""Write a query that answers the following ques...",\n\nSELECT DISTINCT country FROM cars WHERE m...
174,car_1,SELECT CountryName FROM countries EXCEPT SELEC...,What are the names of the countries with no ca...,"[SELECT, CountryName, FROM, countries, EXCEPT,...","[select, countryname, from, countries, except,...","[What, are, the, names, of, the, countries, wi...","""Write a query that answers the following ques...",\n\nSELECT DISTINCT country FROM country WHER...
175,car_1,"select t1.id , t1.maker from car_makers as t1...",Which are the car makers which produce at leas...,"[select, t1.id, ,, t1.maker, from, car_makers,...","[select, t1, ., id, ,, t1, ., maker, from, car...","[Which, are, the, car, makers, which, produce,...","""Write a query that answers the following ques...","\n\nSELECT car_maker_id , car_maker FROM ..."
176,car_1,"SELECT T1.Id , T1.Maker FROM CAR_MAKERS AS T1...",What are the ids and makers of all car makers ...,"[SELECT, T1.Id, ,, T1.Maker, FROM, CAR_MAKERS,...","[select, t1, ., id, ,, t1, ., maker, from, car...","[What, are, the, ids, and, makers, of, all, ca...","""Write a query that answers the following ques...","\n\nSELECT car_maker_id , car_maker_name F..."
177,car_1,"SELECT T1.countryId , T1.CountryName FROM Cou...",What are the id and names of the countries whi...,"[SELECT, T1.countryId, ,, T1.CountryName, FROM...","[select, t1, ., countryid, ,, t1, ., countryna...","[What, are, the, id, and, names, of, the, coun...","""Write a query that answers the following ques...","\n\nSELECT country_id , country_name FROM c..."
178,car_1,"select t1.countryid , t1.countryname from cou...",What are the ids and names of all countries th...,"[select, t1.countryid, ,, t1.countryname, from...","[select, t1, ., countryid, ,, t1, ., countryna...","[What, are, the, ids, and, names, of, all, cou...","""Write a query that answers the following ques...","\n\nSELECT country_id , country_name FROM ..."
179,flight_2,SELECT Country FROM AIRLINES WHERE Airline = ...,"Which country does Airline ""JetBlue Airways"" b...","[SELECT, Country, FROM, AIRLINES, WHERE, Airli...","[select, country, from, airlines, where, airli...","[Which, country, does, Airline, ``, JetBlue, A...","""Write a query that answers the following ques...",\n\nSELECT country FROM Airline WHERE Airlin...
180,flight_2,SELECT Country FROM AIRLINES WHERE Airline = ...,What country is Jetblue Airways affiliated with?,"[SELECT, Country, FROM, AIRLINES, WHERE, Airli...","[select, country, from, airlines, where, airli...","[What, country, is, Jetblue, Airways, affiliat...","""Write a query that answers the following ques...",\n\nSELECT country FROM airlines WHERE airli...
181,flight_2,SELECT Abbreviation FROM AIRLINES WHERE Airlin...,"What is the abbreviation of Airline ""JetBlue A...","[SELECT, Abbreviation, FROM, AIRLINES, WHERE, ...","[select, abbreviation, from, airlines, where, ...","[What, is, the, abbreviation, of, Airline, ``,...","""Write a query that answers the following ques...",\n\nSELECT abbr FROM Airline WHERE name ...
182,flight_2,SELECT Abbreviation FROM AIRLINES WHERE Airlin...,Which abbreviation corresponds to Jetblue Airw...,"[SELECT, Abbreviation, FROM, AIRLINES, WHERE, ...","[select, abbreviation, from, airlines, where, ...","[Which, abbreviation, corresponds, to, Jetblue...","""Write a query that answers the following ques...",\n\nSELECT abbrev FROM airlines WHERE airlin...
183,flight_2,"SELECT Airline , Abbreviation FROM AIRLINES W...",List all airline names and their abbreviations...,"[SELECT, Airline, ,, Abbreviation, FROM, AIRLI...","[select, airline, ,, abbreviation, from, airli...","[List, all, airline, names, and, their, abbrev...","""Write a query that answers the following ques...","\n\nSELECT a.name , a.abbrev FROM airline ..."
184,flight_2,"SELECT Airline , Abbreviation FROM AIRLINES W...",What are the airline names and abbreviations f...,"[SELECT, Airline, ,, Abbreviation, FROM, AIRLI...","[select, airline, ,, abbreviation, from, airli...","[What, are, the, airline, names, and, abbrevia...","""Write a query that answers the following ques...","\n\nSELECT airline_name , airline_abbrev F..."
185,flight_2,"SELECT AirportCode , AirportName FROM AIRPORT...",List the airport code and name in the city of ...,"[SELECT, AirportCode, ,, AirportName, FROM, AI...","[select, airportcode, ,, airportname, from, ai...","[List, the, airport, code, and, name, in, the,...","""Write a query that answers the following ques...","\n\nSELECT airport_code , city FROM airports..."
186,flight_2,"SELECT AirportCode , AirportName FROM AIRPORT...",Give the airport code and airport name correso...,"[SELECT, AirportCode, ,, AirportName, FROM, AI...","[select, airportcode, ,, airportname, from, ai...","[Give, the, airport, code, and, airport, name,...","""Write a query that answers the following ques...","\n\nSELECT airport_code , airport_name FROM a..."
187,flight_2,SELECT count(*) FROM AIRLINES,How many airlines do we have?,"[SELECT, count, (, *, ), FROM, AIRLINES]","[select, count, (, *, ), from, airlines]","[How, many, airlines, do, we, have, ?]","""Write a query that answers the following ques...",\n\nSELECT count(*) FROM airlines
188,flight_2,SELECT count(*) FROM AIRLINES,What is the total number of airlines?,"[SELECT, count, (, *, ), FROM, AIRLINES]","[select, count, (, *, ), from, airlines]","[What, is, the, total, number, of, airlines, ?]","""Write a query that answers the following ques...",\n\nSELECT COUNT(*) FROM airlines
189,flight_2,SELECT count(*) FROM AIRPORTS,How many airports do we have?,"[SELECT, count, (, *, ), FROM, AIRPORTS]","[select, count, (, *, ), from, airports]","[How, many, airports, do, we, have, ?]","""Write a query that answers the following ques...",\n\nSELECT count(*) FROM airports
190,flight_2,SELECT count(*) FROM AIRPORTS,Return the number of airports.,"[SELECT, count, (, *, ), FROM, AIRPORTS]","[select, count, (, *, ), from, airports]","[Return, the, number, of, airports, .]","""Write a query that answers the following ques...",SELECT COUNT(*) FROM airports
191,flight_2,SELECT count(*) FROM FLIGHTS,How many flights do we have?,"[SELECT, count, (, *, ), FROM, FLIGHTS]","[select, count, (, *, ), from, flights]","[How, many, flights, do, we, have, ?]","""Write a query that answers the following ques...",<strong>SELECT COUNT(*) FROM flights</strong>
192,flight_2,SELECT count(*) FROM FLIGHTS,Return the number of flights.,"[SELECT, count, (, *, ), FROM, FLIGHTS]","[select, count, (, *, ), from, flights]","[Return, the, number, of, flights, .]","""Write a query that answers the following ques...",SELECT COUNT(*) FROM flights
193,flight_2,SELECT Airline FROM AIRLINES WHERE Abbreviatio...,Which airline has abbreviation 'UAL'?,"[SELECT, Airline, FROM, AIRLINES, WHERE, Abbre...","[select, airline, from, airlines, where, abbre...","[Which, airline, has, abbreviation, 'UAL, ', ?]","""Write a query that answers the following ques...",\n\nSELECT * FROM airline WHERE abbrevia...
194,flight_2,SELECT Airline FROM AIRLINES WHERE Abbreviatio...,Give the airline with abbreviation 'UAL'.,"[SELECT, Airline, FROM, AIRLINES, WHERE, Abbre...","[select, airline, from, airlines, where, abbre...","[Give, the, airline, with, abbreviation, 'UAL,...","""Write a query that answers the following ques...",<strong>SELECT * FROM airline WHERE abbrev...
195,flight_2,SELECT count(*) FROM AIRLINES WHERE Country =...,How many airlines are from USA?,"[SELECT, count, (, *, ), FROM, AIRLINES, WHERE...","[select, count, (, *, ), from, airlines, where...","[How, many, airlines, are, from, USA, ?]","""Write a query that answers the following ques...",\n\nSELECT count(*) FROM airlines WHERE count...
196,flight_2,SELECT count(*) FROM AIRLINES WHERE Country =...,Return the number of airlines in the USA.,"[SELECT, count, (, *, ), FROM, AIRLINES, WHERE...","[select, count, (, *, ), from, airlines, where...","[Return, the, number, of, airlines, in, the, U...","""Write a query that answers the following ques...",\n\nSELECT COUNT(*) FROM airlines WHERE count...
197,flight_2,"SELECT City , Country FROM AIRPORTS WHERE Air...",Which city and country is the Alton airport at?,"[SELECT, City, ,, Country, FROM, AIRPORTS, WHE...","[select, city, ,, country, from, airports, whe...","[Which, city, and, country, is, the, Alton, ai...","""Write a query that answers the following ques...","\n\nSELECT city , country FROM airports WHER..."
198,flight_2,"SELECT City , Country FROM AIRPORTS WHERE Air...",Give the city and country for the Alton airport.,"[SELECT, City, ,, Country, FROM, AIRPORTS, WHE...","[select, city, ,, country, from, airports, whe...","[Give, the, city, and, country, for, the, Alto...","""Write a query that answers the following ques...","\n\nSELECT city , country FROM airports WHERE..."
199,flight_2,SELECT AirportName FROM AIRPORTS WHERE Airport...,What is the airport name for airport 'AKO'?,"[SELECT, AirportName, FROM, AIRPORTS, WHERE, A...","[select, airportname, from, airports, where, a...","[What, is, the, airport, name, for, airport, '...","""Write a query that answers the following ques...",\n\nSELECT airport_name FROM airports WHERE ...
200,flight_2,SELECT AirportName FROM AIRPORTS WHERE Airport...,Return the name of the airport with code 'AKO'.,"[SELECT, AirportName, FROM, AIRPORTS, WHERE, A...","[select, airportname, from, airports, where, a...","[Return, the, name, of, the, airport, with, co...","""Write a query that answers the following ques...",\n\nSELECT airport_name FROM airports WHERE ...
201,flight_2,SELECT AirportName FROM AIRPORTS WHERE City = ...,What are airport names at City 'Aberdeen'?,"[SELECT, AirportName, FROM, AIRPORTS, WHERE, C...","[select, airportname, from, airports, where, c...","[What, are, airport, names, at, City, 'Aberdee...","""Write a query that answers the following ques...",\n\nSELECT airport_name FROM airports WHERE c...
202,flight_2,SELECT AirportName FROM AIRPORTS WHERE City = ...,What are the names of airports in Aberdeen?,"[SELECT, AirportName, FROM, AIRPORTS, WHERE, C...","[select, airportname, from, airports, where, c...","[What, are, the, names, of, airports, in, Aber...","""Write a query that answers the following ques...",\n\nSELECT airport_name FROM airports WHERE ...
203,flight_2,SELECT count(*) FROM FLIGHTS WHERE SourceAirpo...,How many flights depart from 'APG'?,"[SELECT, count, (, *, ), FROM, FLIGHTS, WHERE,...","[select, count, (, *, ), from, flights, where,...","[How, many, flights, depart, from, 'APG, ', ?]","""Write a query that answers the following ques...",\n\nSELECT count(*) FROM flights WHERE origin...
204,flight_2,SELECT count(*) FROM FLIGHTS WHERE SourceAirpo...,Count the number of flights departing from 'APG'.,"[SELECT, count, (, *, ), FROM, FLIGHTS, WHERE,...","[select, count, (, *, ), from, flights, where,...","[Count, the, number, of, flights, departing, f...","""Write a query that answers the following ques...",\n\nSELECT COUNT(*) FROM flights WHERE origi...
205,flight_2,SELECT count(*) FROM FLIGHTS WHERE DestAirport...,How many flights have destination ATO?,"[SELECT, count, (, *, ), FROM, FLIGHTS, WHERE,...","[select, count, (, *, ), from, flights, where,...","[How, many, flights, have, destination, ATO, ?]","""Write a query that answers the following ques...",\n\nSELECT count(*) FROM flights WHERE destin...
206,flight_2,SELECT count(*) FROM FLIGHTS WHERE DestAirport...,Count the number of flights into ATO.,"[SELECT, count, (, *, ), FROM, FLIGHTS, WHERE,...","[select, count, (, *, ), from, flights, where,...","[Count, the, number, of, flights, into, ATO, .]","""Write a query that answers the following ques...",\n\nSELECT COUNT(*) FROM flights WHERE ori...
207,flight_2,SELECT count(*) FROM FLIGHTS AS T1 JOIN AIRPOR...,How many flights depart from City Aberdeen?,"[SELECT, count, (, *, ), FROM, FLIGHTS, AS, T1...","[select, count, (, *, ), from, flights, as, t1...","[How, many, flights, depart, from, City, Aberd...","""Write a query that answers the following ques...",\n\nSELECT COUNT(*) FROM flights WHERE city =...

====================================================================================================
(52, 7)
Input:  ['"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Return the number of flights departing from Aberdeen. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> How many flights arriving in Aberdeen city? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Return the number of flights arriving in Aberdeen. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> How many flights depart from City \'Aberdeen\' and have destination City \'Ashley\'? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> How many flights fly from Aberdeen to Ashley? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> How many flights does airline \'JetBlue Airways\' have? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Give the number of Jetblue Airways flights. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> How many \'United Airlines\' flights go to Airport \'ASY\'? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Count the number of United Airlines flights arriving in ASY Airport. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> How many \'United Airlines\' flights depart from Airport \'AHD\'? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Return the number of United Airlines flights leaving from AHD Airport. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> How many United Airlines flights go to City \'Aberdeen\'? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Count the number of United Airlines flights that arrive in Aberdeen. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Which city has most number of arriving flights? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Which city has the most frequent destination airport? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Which city has most number of departing flights? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Which city is the most frequent source airport? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the code of airport that has the highest number of flights? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the airport code of the airport with the most flights? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the code of airport that has fewest number of flights? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Give the code of the airport with the least flights. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Which airline has most number of flights? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What airline serves the most flights? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Find the abbreviation and country of the airline that has fewest number of flights? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the abbreviation of the airilne has the fewest flights and what country is it in? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are airlines that have some flight departing from airport \'AHD\'? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Which airlines have a flight with source airport AHD? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are airlines that have flights arriving at airport \'AHD\'? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Which airlines have a flight with destination airport AHD? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Find all airlines that have flights from both airports \'APG\' and \'CVO\'. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Which airlines have departing flights from both APG and CVO airports? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Find all airlines that have flights from airport \'CVO\' but not from \'APG\'. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Which airlines have departures from CVO but not from APG airports? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Find all airlines that have at least 10 flights. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Which airlines have at least 10 flights? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Find all airlines that have fewer than 200 flights. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Which airlines have less than 200 flights? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are flight numbers of Airline "United Airlines"? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Which flight numbers correspond to United Airlines flights? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are flight numbers of flights departing from Airport "APG"? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Give the flight numbers of flights leaving from APG. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are flight numbers of flights arriving at Airport "APG"? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Give the flight numbers of flights landing at APG. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are flight numbers of flights departing from City "Aberdeen "? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Give the flight numbers of flights leaving from Aberdeen. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are flight numbers of flights arriving at City "Aberdeen"? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Give the flight numbers of flights arriving in Aberdeen. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Find the number of flights landing in the city of Aberdeen or Abilene. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> How many flights land in Aberdeen or Abilene? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Find the name of airports which do not have any flight in and out. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Which airports do not have departing or arriving flights? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> How many employees are there? <query> ']
Original query:
SELECT count(*) FROM FLIGHTS AS T1 JOIN AIRPORTS AS T2 ON T1.SourceAirport  =  T2.AirportCode WHERE T2.City  =  "Aberdeen"
Generated query:
 <strong>SELECT COUNT(*) FROM flights WHERE origin = "Aberdeen"</strong><eos>
____________________________________________________________________________________________________
Original query:
SELECT count(*) FROM FLIGHTS AS T1 JOIN AIRPORTS AS T2 ON T1.DestAirport  =  T2.AirportCode WHERE T2.City  =  "Aberdeen"
Generated query:


SELECT count(*) FROM flights WHERE city = 'Aberdeen'<eos>
____________________________________________________________________________________________________
Original query:
SELECT count(*) FROM FLIGHTS AS T1 JOIN AIRPORTS AS T2 ON T1.DestAirport  =  T2.AirportCode WHERE T2.City  =  "Aberdeen"
Generated query:
 <strong>SELECT COUNT(*) FROM flights WHERE origin = "Aberdeen"</strong><eos>
____________________________________________________________________________________________________
Original query:
SELECT count(*) FROM FLIGHTS AS T1 JOIN AIRPORTS AS T2 ON T1.DestAirport  =  T2.AirportCode JOIN AIRPORTS AS T3 ON T1.SourceAirport  =  T3.AirportCode WHERE T2.City  =  "Ashley" AND T3.City  =  "Aberdeen"
Generated query:


SELECT count(*) FROM flights WHERE departure_city = 'Aberdeen' AND destination_city = 'Ashley'<eos>
____________________________________________________________________________________________________
Original query:
SELECT count(*) FROM FLIGHTS AS T1 JOIN AIRPORTS AS T2 ON T1.DestAirport  =  T2.AirportCode JOIN AIRPORTS AS T3 ON T1.SourceAirport  =  T3.AirportCode WHERE T2.City  =  "Ashley" AND T3.City  =  "Aberdeen"
Generated query:


SELECT count(*) FROM flights WHERE origin_city_name = 'Aberdeen' AND destination_city_name = 'Ashley'<eos>
____________________________________________________________________________________________________
Original query:
SELECT count(*) FROM FLIGHTS AS T1 JOIN AIRLINES AS T2 ON T1.Airline  =  T2.uid WHERE T2.Airline = "JetBlue Airways"
Generated query:


SELECT count(*) FROM flights WHERE airline_name = 'JetBlue Airways'<eos>
____________________________________________________________________________________________________
Original query:
SELECT count(*) FROM FLIGHTS AS T1 JOIN AIRLINES AS T2 ON T1.Airline  =  T2.uid WHERE T2.Airline = "JetBlue Airways"
Generated query:
 <strong>SELECT COUNT(*) FROM flights WHERE airline = "Jetblue"</strong><eos>
____________________________________________________________________________________________________
Original query:
SELECT count(*) FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T2.Airline  =  T1.uid WHERE T1.Airline  =  "United Airlines" AND T2.DestAirport  =  "ASY"
Generated query:


SELECT count(*) FROM flights WHERE airline_name = 'United Airlines' AND airport_name = 'ASY'<eos>
____________________________________________________________________________________________________
Original query:
SELECT count(*) FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T2.Airline  =  T1.uid WHERE T1.Airline  =  "United Airlines" AND T2.DestAirport  =  "ASY"
Generated query:


SELECT  COUNT(*) FROM  flights WHERE  origin_airport_code  =  "AS"<eos>
____________________________________________________________________________________________________
Original query:
SELECT count(*) FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T2.Airline  =  T1.uid WHERE T1.Airline  =  "United Airlines" AND T2.SourceAirport  =  "AHD"
Generated query:


SELECT count(*) FROM flights WHERE airline_name = 'United Airlines'<eos>
____________________________________________________________________________________________________
Original query:
SELECT count(*) FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T2.Airline  =  T1.uid WHERE T1.Airline  =  "United Airlines" AND T2.SourceAirport  =  "AHD"
Generated query:


SELECT COUNT(*) FROM flights WHERE origin_airport_code = "AHD"<eos>
____________________________________________________________________________________________________
Original query:
SELECT count(*) FROM FLIGHTS AS T1 JOIN AIRPORTS AS T2 ON T1.DestAirport  =  T2.AirportCode JOIN AIRLINES AS T3 ON T3.uid  =  T1.Airline WHERE T2.City  =  "Aberdeen" AND T3.Airline  =  "United Airlines"
Generated query:


SELECT count(*) FROM flights WHERE origin_city = 'Aberdeen'<eos>
____________________________________________________________________________________________________
Original query:
SELECT count(*) FROM FLIGHTS AS T1 JOIN AIRPORTS AS T2 ON T1.DestAirport  =  T2.AirportCode JOIN AIRLINES AS T3 ON T3.uid  =  T1.Airline WHERE T2.City  =  "Aberdeen" AND T3.Airline  =  "United Airlines"
Generated query:


SELECT  COUNT(*) FROM  flights WHERE  origin_airport_code  =  "ABZ"<eos>
____________________________________________________________________________________________________
Original query:
SELECT T1.City FROM AIRPORTS AS T1 JOIN FLIGHTS AS T2 ON T1.AirportCode  =  T2.DestAirport GROUP BY T1.City ORDER BY count(*) DESC LIMIT 1
Generated query:


SELECT  city_name ,  count(*) AS  count_of_arriving_flights  FROM  flights  GROUP BY  city_name  ORDER BY  count_of_arriving_flights DESC LIMIT  1<eos>
____________________________________________________________________________________________________
Original query:
SELECT T1.City FROM AIRPORTS AS T1 JOIN FLIGHTS AS T2 ON T1.AirportCode  =  T2.DestAirport GROUP BY T1.City ORDER BY count(*) DESC LIMIT 1
Generated query:


SELECT  city_name ,  count(*) AS  count_of_destination_airport  FROM  airport_city  GROUP BY  city_name  ORDER BY  count_of_destination_airport  DESC LIMIT  1<eos>
____________________________________________________________________________________________________
Original query:
SELECT T1.City FROM AIRPORTS AS T1 JOIN FLIGHTS AS T2 ON T1.AirportCode  =  T2.SourceAirport GROUP BY T1.City ORDER BY count(*) DESC LIMIT 1
Generated query:


SELECT  city_name ,  COUNT(*) AS  count_of_departing_flights  FROM  flights  GROUP BY  city_name  ORDER BY  count_of_departing_flights DESC LIMIT  1<eos>
____________________________________________________________________________________________________
Original query:
SELECT T1.City FROM AIRPORTS AS T1 JOIN FLIGHTS AS T2 ON T1.AirportCode  =  T2.SourceAirport GROUP BY T1.City ORDER BY count(*) DESC LIMIT 1
Generated query:


SELECT  city FROM  airport GROUP BY city ORDER BY count(*) DESC LIMIT 1<eos>
____________________________________________________________________________________________________
Original query:
SELECT T1.AirportCode FROM AIRPORTS AS T1 JOIN FLIGHTS AS T2 ON T1.AirportCode  =  T2.DestAirport OR T1.AirportCode  =  T2.SourceAirport GROUP BY T1.AirportCode ORDER BY count(*) DESC LIMIT 1
Generated query:


SELECT  airport_code FROM airports ORDER BY  flight_count DESC LIMIT 1<eos>
____________________________________________________________________________________________________
Original query:
SELECT T1.AirportCode FROM AIRPORTS AS T1 JOIN FLIGHTS AS T2 ON T1.AirportCode  =  T2.DestAirport OR T1.AirportCode  =  T2.SourceAirport GROUP BY T1.AirportCode ORDER BY count(*) DESC LIMIT 1
Generated query:


SELECT  airport_code FROM airports ORDER BY  count(*) DESC LIMIT 1<eos>
____________________________________________________________________________________________________
Original query:
SELECT T1.AirportCode FROM AIRPORTS AS T1 JOIN FLIGHTS AS T2 ON T1.AirportCode  =  T2.DestAirport OR T1.AirportCode  =  T2.SourceAirport GROUP BY T1.AirportCode ORDER BY count(*) LIMIT 1
Generated query:


SELECT  airport_code FROM airports WHERE  count_of_flights  =  (SELECT  count_of_flights FROM airports ORDER BY count_of_flights  DESC LIMIT  1)<eos>
____________________________________________________________________________________________________
Original query:
SELECT T1.AirportCode FROM AIRPORTS AS T1 JOIN FLIGHTS AS T2 ON T1.AirportCode  =  T2.DestAirport OR T1.AirportCode  =  T2.SourceAirport GROUP BY T1.AirportCode ORDER BY count(*) LIMIT 1
Generated query:


SELECT  airport_code FROM airports WHERE  count_flights  =  (SELECT  min(count_flights) FROM airports)<eos>
____________________________________________________________________________________________________
Original query:
SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid  =  T2.Airline GROUP BY T1.Airline ORDER BY count(*) DESC LIMIT 1
Generated query:


SELECT  count(*) FROM  flights<eos>
____________________________________________________________________________________________________
Original query:
SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid  =  T2.Airline GROUP BY T1.Airline ORDER BY count(*) DESC LIMIT 1
Generated query:


SELECT  airline_name  FROM  flights  GROUP BY  airline_name  ORDER BY  count(*) DESC<eos>
____________________________________________________________________________________________________
Original query:
SELECT T1.Abbreviation ,  T1.Country FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid  =  T2.Airline GROUP BY T1.Airline ORDER BY count(*) LIMIT 1
Generated query:


SELECT  abbr ,  country  FROM  airline  GROUP BY  abbr  ORDER BY  count  DESC<eos>
____________________________________________________________________________________________________
Original query:
SELECT T1.Abbreviation ,  T1.Country FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid  =  T2.Airline GROUP BY T1.Airline ORDER BY count(*) LIMIT 1
Generated query:


SELECT  abbr  FROM  airlines  WHERE  flights  =  (SELECT  MIN  FROM  flights)<eos>
____________________________________________________________________________________________________
Original query:
SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid  =  T2.Airline WHERE T2.SourceAirport  =  "AHD"
Generated query:


SELECT  * FROM airlines WHERE airport_code  =  'AHD'<eos>
____________________________________________________________________________________________________
Original query:

,db_id,query,question,query_toks,query_toks_no_value,question_toks,modified question,generated_query
208,flight_2,SELECT count(*) FROM FLIGHTS AS T1 JOIN AIRPOR...,Return the number of flights departing from Ab...,"[SELECT, count, (, *, ), FROM, FLIGHTS, AS, T1...","[select, count, (, *, ), from, flights, as, t1...","[Return, the, number, of, flights, departing, ...","""Write a query that answers the following ques...",<strong>SELECT COUNT(*) FROM flights WHERE or...
209,flight_2,SELECT count(*) FROM FLIGHTS AS T1 JOIN AIRPOR...,How many flights arriving in Aberdeen city?,"[SELECT, count, (, *, ), FROM, FLIGHTS, AS, T1...","[select, count, (, *, ), from, flights, as, t1...","[How, many, flights, arriving, in, Aberdeen, c...","""Write a query that answers the following ques...",\n\nSELECT count(*) FROM flights WHERE city =...
210,flight_2,SELECT count(*) FROM FLIGHTS AS T1 JOIN AIRPOR...,Return the number of flights arriving in Aberd...,"[SELECT, count, (, *, ), FROM, FLIGHTS, AS, T1...","[select, count, (, *, ), from, flights, as, t1...","[Return, the, number, of, flights, arriving, i...","""Write a query that answers the following ques...",<strong>SELECT COUNT(*) FROM flights WHERE or...
211,flight_2,SELECT count(*) FROM FLIGHTS AS T1 JOIN AIRPOR...,How many flights depart from City 'Aberdeen' a...,"[SELECT, count, (, *, ), FROM, FLIGHTS, AS, T1...","[select, count, (, *, ), from, flights, as, t1...","[How, many, flights, depart, from, City, 'Aber...","""Write a query that answers the following ques...",\n\nSELECT count(*) FROM flights WHERE depart...
212,flight_2,SELECT count(*) FROM FLIGHTS AS T1 JOIN AIRPOR...,How many flights fly from Aberdeen to Ashley?,"[SELECT, count, (, *, ), FROM, FLIGHTS, AS, T1...","[select, count, (, *, ), from, flights, as, t1...","[How, many, flights, fly, from, Aberdeen, to, ...","""Write a query that answers the following ques...",\n\nSELECT count(*) FROM flights WHERE origin...
213,flight_2,SELECT count(*) FROM FLIGHTS AS T1 JOIN AIRLIN...,How many flights does airline 'JetBlue Airways...,"[SELECT, count, (, *, ), FROM, FLIGHTS, AS, T1...","[select, count, (, *, ), from, flights, as, t1...","[How, many, flights, does, airline, 'JetBlue, ...","""Write a query that answers the following ques...",\n\nSELECT count(*) FROM flights WHERE airlin...
214,flight_2,SELECT count(*) FROM FLIGHTS AS T1 JOIN AIRLIN...,Give the number of Jetblue Airways flights.,"[SELECT, count, (, *, ), FROM, FLIGHTS, AS, T1...","[select, count, (, *, ), from, flights, as, t1...","[Give, the, number, of, Jetblue, Airways, flig...","""Write a query that answers the following ques...",<strong>SELECT COUNT(*) FROM flights WHERE ai...
215,flight_2,SELECT count(*) FROM AIRLINES AS T1 JOIN FLIGH...,How many 'United Airlines' flights go to Airpo...,"[SELECT, count, (, *, ), FROM, AIRLINES, AS, T...","[select, count, (, *, ), from, airlines, as, t...","[How, many, 'United, Airlines, ', flights, go,...","""Write a query that answers the following ques...",\n\nSELECT count(*) FROM flights WHERE airlin...
216,flight_2,SELECT count(*) FROM AIRLINES AS T1 JOIN FLIGH...,Count the number of United Airlines flights ar...,"[SELECT, count, (, *, ), FROM, AIRLINES, AS, T...","[select, count, (, *, ), from, airlines, as, t...","[Count, the, number, of, United, Airlines, fli...","""Write a query that answers the following ques...",\n\nSELECT COUNT(*) FROM flights WHERE ori...
217,flight_2,SELECT count(*) FROM AIRLINES AS T1 JOIN FLIGH...,How many 'United Airlines' flights depart from...,"[SELECT, count, (, *, ), FROM, AIRLINES, AS, T...","[select, count, (, *, ), from, airlines, as, t...","[How, many, 'United, Airlines, ', flights, dep...","""Write a query that answers the following ques...",\n\nSELECT count(*) FROM flights WHERE airlin...
218,flight_2,SELECT count(*) FROM AIRLINES AS T1 JOIN FLIGH...,Return the number of United Airlines flights l...,"[SELECT, count, (, *, ), FROM, AIRLINES, AS, T...","[select, count, (, *, ), from, airlines, as, t...","[Return, the, number, of, United, Airlines, fl...","""Write a query that answers the following ques...",\n\nSELECT COUNT(*) FROM flights WHERE origin...
219,flight_2,SELECT count(*) FROM FLIGHTS AS T1 JOIN AIRPOR...,How many United Airlines flights go to City 'A...,"[SELECT, count, (, *, ), FROM, FLIGHTS, AS, T1...","[select, count, (, *, ), from, flights, as, t1...","[How, many, United, Airlines, flights, go, to,...","""Write a query that answers the following ques...",\n\nSELECT count(*) FROM flights WHERE origin...
220,flight_2,SELECT count(*) FROM FLIGHTS AS T1 JOIN AIRPOR...,Count the number of United Airlines flights th...,"[SELECT, count, (, *, ), FROM, FLIGHTS, AS, T1...","[select, count, (, *, ), from, flights, as, t1...","[Count, the, number, of, United, Airlines, fli...","""Write a query that answers the following ques...",\n\nSELECT COUNT(*) FROM flights WHERE ori...
221,flight_2,SELECT T1.City FROM AIRPORTS AS T1 JOIN FLIGHT...,Which city has most number of arriving flights?,"[SELECT, T1.City, FROM, AIRPORTS, AS, T1, JOIN...","[select, t1, ., city, from, airports, as, t1, ...","[Which, city, has, most, number, of, arriving,...","""Write a query that answers the following ques...","\n\nSELECT city_name , count(*) AS count_o..."
222,flight_2,SELECT T1.City FROM AIRPORTS AS T1 JOIN FLIGHT...,Which city has the most frequent destination a...,"[SELECT, T1.City, FROM, AIRPORTS, AS, T1, JOIN...","[select, t1, ., city, from, airports, as, t1, ...","[Which, city, has, the, most, frequent, destin...","""Write a query that answers the following ques...","\n\nSELECT city_name , count(*) AS count_o..."
223,flight_2,SELECT T1.City FROM AIRPORTS AS T1 JOIN FLIGHT...,Which city has most number of departing flights?,"[SELECT, T1.City, FROM, AIRPORTS, AS, T1, JOIN...","[select, t1, ., city, from, airports, as, t1, ...","[Which, city, has, most, number, of, departing...","""Write a query that answers the following ques...","\n\nSELECT city_name , COUNT(*) AS count_o..."
224,flight_2,SELECT T1.City FROM AIRPORTS AS T1 JOIN FLIGHT...,Which city is the most frequent source airport?,"[SELECT, T1.City, FROM, AIRPORTS, AS, T1, JOIN...","[select, t1, ., city, from, airports, as, t1, ...","[Which, city, is, the, most, frequent, source,...","""Write a query that answers the following ques...",\n\nSELECT city FROM airport GROUP BY city ...
225,flight_2,SELECT T1.AirportCode FROM AIRPORTS AS T1 JOIN...,What is the code of airport that has the highe...,"[SELECT, T1.AirportCode, FROM, AIRPORTS, AS, T...","[select, t1, ., airportcode, from, airports, a...","[What, is, the, code, of, airport, that, has, ...","""Write a query that answers the following ques...",\n\nSELECT airport_code FROM airports ORDER ...
226,flight_2,SELECT T1.AirportCode FROM AIRPORTS AS T1 JOIN...,What is the airport code of the airport with t...,"[SELECT, T1.AirportCode, FROM, AIRPORTS, AS, T...","[select, t1, ., airportcode, from, airports, a...","[What, is, the, airport, code, of, the, airpor...","""Write a query that answers the following ques...",\n\nSELECT airport_code FROM airports ORDER ...
227,flight_2,SELECT T1.AirportCode FROM AIRPORTS AS T1 JOIN...,What is the code of airport that has fewest nu...,"[SELECT, T1.AirportCode, FROM, AIRPORTS, AS, T...","[select, t1, ., airportcode, from, airports, a...","[What, is, the, code, of, airport, that, has, ...","""Write a query that answers the following ques...",\n\nSELECT airport_code FROM airports WHERE ...
228,flight_2,SELECT T1.AirportCode FROM AIRPORTS AS T1 JOIN...,Give the code of the airport with the least fl...,"[SELECT, T1.AirportCode, FROM, AIRPORTS, AS, T...","[select, t1, ., airportcode, from, airports, a...","[Give, the, code, of, the, airport, with, the,...","""Write a query that answers the following ques...",\n\nSELECT airport_code FROM airports WHERE ...
229,flight_2,SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLI...,Which airline has most number of flights?,"[SELECT, T1.Airline, FROM, AIRLINES, AS, T1, J...","[select, t1, ., airline, from, airlines, as, t...","[Which, airline, has, most, number, of, flight...","""Write a query that answers the following ques...",\n\nSELECT count(*) FROM flights
230,flight_2,SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLI...,What airline serves the most flights?,"[SELECT, T1.Airline, FROM, AIRLINES, AS, T1, J...","[select, t1, ., airline, from, airlines, as, t...","[What, airline, serves, the, most, flights, ?]","""Write a query that answers the following ques...",\n\nSELECT airline_name FROM flights GROU...
231,flight_2,"SELECT T1.Abbreviation , T1.Country FROM AIRL...",Find the abbreviation and country of the airli...,"[SELECT, T1.Abbreviation, ,, T1.Country, FROM,...","[select, t1, ., abbreviation, ,, t1, ., countr...","[Find, the, abbreviation, and, country, of, th...","""Write a query that answers the following ques...","\n\nSELECT abbr , country FROM airline G..."
232,flight_2,"SELECT T1.Abbreviation , T1.Country FROM AIRL...",What is the abbreviation of the airilne has th...,"[SELECT, T1.Abbreviation, ,, T1.Country, FROM,...","[select, t1, ., abbreviation, ,, t1, ., countr...","[What, is, the, abbreviation, of, the, airilne...","""Write a query that answers the following ques...",\n\nSELECT abbr FROM airlines WHERE flig...
233,flight_2,SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLI...,What are airlines that have some flight depart...,"[SELECT, T1.Airline, FROM, AIRLINES, AS, T1, J...","[select, t1, ., airline, from, airlines, as, t...","[What, are, airlines, that, have, some, flight...","""Write a query that answers the following ques...",\n\nSELECT * FROM airlines WHERE airport_cod...
234,flight_2,SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLI...,Which airlines have a flight with source airpo...,"[SELECT, T1.Airline, FROM, AIRLINES, AS, T1, J...","[select, t1, ., airline, from, airlines, as, t...","[Which, airlines, have, a, flight, with, sourc...","""Write a query that answers the following ques...",\n\nSELECT * FROM airlines WHERE source_ai...
235,flight_2,SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLI...,What are airlines that have flights arriving a...,"[SELECT, T1.Airline, FROM, AIRLINES, AS, T1, J...","[select, t1, ., airline, from, airlines, as, t...","[What, are, airlines, that, have, flights, arr...","""Write a query that answers the following ques...",\n\nSELECT * FROM flights WHERE airport_c...
236,flight_2,SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLI...,Which airlines have a flight with destination ...,"[SELECT, T1.Airline, FROM, AIRLINES, AS, T1, J...","[select, t1, ., airline, from, airlines, as, t...","[Which, airlines, have, a, flight, with, desti...","""Write a query that answers the following ques...",\n\nSELECT * FROM airlines WHERE destinati...
237,flight_2,SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLI...,Find all airlines that have flights from both ...,"[SELECT, T1.Airline, FROM, AIRLINES, AS, T1, J...","[select, t1, ., airline, from, airlines, as, t...","[Find, all, airlines, that, have, flights, fro...","""Write a query that answers the following ques...",<strong>SELECT DISTINCT airline FROM flights ...
238,flight_2,SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLI...,Which airlines have departing flights from bot...,"[SELECT, T1.Airline, FROM, AIRLINES, AS, T1, J...","[select, t1, ., airline, from, airlines, as, t...","[Which, airlines, have, departing, flights, fr...","""Write a query that answers the following ques...",\n\nSELECT * FROM flights WHERE origin_air...
239,flight_2,SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLI...,Find all airlines that have flights from airpo...,"[SELECT, T1.Airline, FROM, AIRLINES, AS, T1, J...","[select, t1, ., airline, from, airlines, as, t...","[Find, all, airlines, that, have, flights, fro...","""Write a query that answers the following ques...",<strong>SELECT DISTINCT airline FROM flights ...
240,flight_2,SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLI...,Which airlines have departures from CVO but no...,"[SELECT, T1.Airline, FROM, AIRLINES, AS, T1, J...","[select, t1, ., airline, from, airlines, as, t...","[Which, airlines, have, departures, from, CVO,...","""Write a query that answers the following ques...",\n\nSELECT DISTINCT a.airline_name FROM air...
241,flight_2,SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLI...,Find all airlines that have at least 10 flights.,"[SELECT, T1.Airline, FROM, AIRLINES, AS, T1, J...","[select, t1, ., airline, from, airlines, as, t...","[Find, all, airlines, that, have, at, least, 1...","""Write a query that answers the following ques...",<strong>SELECT DISTINCT airline FROM flights ...
242,flight_2,SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLI...,Which airlines have at least 10 flights?,"[SELECT, T1.Airline, FROM, AIRLINES, AS, T1, J...","[select, t1, ., airline, from, airlines, as, t...","[Which, airlines, have, at, least, 10, flights...","""Write a query that answers the following ques...",\n\nSELECT * FROM airlines
243,flight_2,SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLI...,Find all airlines that have fewer than 200 fli...,"[SELECT, T1.Airline, FROM, AIRLINES, AS, T1, J...","[select, t1, ., airline, from, airlines, as, t...","[Find, all, airlines, that, have, fewer, than,...","""Write a query that answers the following ques...",<strong>SELECT DISTINCT airline FROM flights ...
244,flight_2,SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLI...,Which airlines have less than 200 flights?,"[SELECT, T1.Airline, FROM, AIRLINES, AS, T1, J...","[select, t1, ., airline, from, airlines, as, t...","[Which, airlines, have, less, than, 200, fligh...","""Write a query that answers the following ques...",\n\nSELECT * FROM flights WHERE count_of_f...
245,flight_2,SELECT T1.FlightNo FROM FLIGHTS AS T1 JOIN AIR...,"What are flight numbers of Airline ""United Air...","[SELECT, T1.FlightNo, FROM, FLIGHTS, AS, T1, J...","[select, t1, ., flightno, from, flights, as, t...","[What, are, flight, numbers, of, Airline, ``, ...","""Write a query that answers the following ques...",\n\nSELECT flight_number FROM flights WHERE...
246,flight_2,SELECT T1.FlightNo FROM FLIGHTS AS T1 JOIN AIR...,Which flight numbers correspond to United Airl...,"[SELECT, T1.FlightNo, FROM, FLIGHTS, AS, T1, J...","[select, t1, ., flightno, from, flights, as, t...","[Which, flight, numbers, correspond, to, Unite...","""Write a query that answers the following ques...",\n\nSELECT flight_number FROM flights WHERE a...
247,flight_2,SELECT FlightNo FROM FLIGHTS WHERE SourceAirpo...,What are flight numbers of flights departing f...,"[SELECT, FlightNo, FROM, FLIGHTS, WHERE, Sourc...","[select, flightno, from, flights, where, sourc...","[What, are, flight, numbers, of, flights, depa...","""Write a query that answers the following ques...",\n\nSELECT flight_number FROM flights WHERE ...
248,flight_2,SELECT FlightNo FROM FLIGHTS WHERE SourceAirpo...,Give the flight numbers of flights leaving fro...,"[SELECT, FlightNo, FROM, FLIGHTS, WHERE, Sourc...","[select, flightno, from, flights, where, sourc...","[Give, the, flight, numbers, of, flights, leav...","""Write a query that answers the following ques...",\n\nSELECT flight_number FROM flights WHERE d...
249,flight_2,SELECT FlightNo FROM FLIGHTS WHERE DestAirport...,What are flight numbers of flights arriving at...,"[SELECT, FlightNo, FROM, FLIGHTS, WHERE, DestA...","[select, flightno, from, flights, where, desta...","[What, are, flight, numbers, of, flights, arri...","""Write a query that answers the following ques...",\n\nSELECT flight_number FROM flights WHERE ...
250,flight_2,SELECT FlightNo FROM FLIGHTS WHERE DestAirport...,Give the flight numbers of flights landing at ...,"[SELECT, FlightNo, FROM, FLIGHTS, WHERE, DestA...","[select, flightno, from, flights, where, desta...","[Give, the, flight, numbers, of, flights, land...","""Write a query that answers the following ques...",\n\nSELECT flight_number FROM flights WHERE a...
251,flight_2,SELECT T1.FlightNo FROM FLIGHTS AS T1 JOIN AIR...,What are flight numbers of flights departing f...,"[SELECT, T1.FlightNo, FROM, FLIGHTS, AS, T1, J...","[select, t1, ., flightno, from, flights, as, t...","[What, are, flight, numbers, of, flights, depa...","""Write a query that answers the following ques...",\n\nSELECT flight_number FROM flights WHERE ...
252,flight_2,SELECT T1.FlightNo FROM FLIGHTS AS T1 JOIN AIR...,Give the flight numbers of flights leaving fro...,"[SELECT, T1.FlightNo, FROM, FLIGHTS, AS, T1, J...","[select, t1, ., flightno, from, flights, as, t...","[Give, the, flight, numbers, of, flights, leav...","""Write a query that answers the following ques...",\n\nSELECT flight_number FROM flights WHERE d...
253,flight_2,SELECT T1.FlightNo FROM FLIGHTS AS T1 JOIN AIR...,What are flight numbers of flights arriving at...,"[SELECT, T1.FlightNo, FROM, FLIGHTS, AS, T1, J...","[select, t1, ., flightno, from, flights, as, t...","[What, are, flight, numbers, of, flights, arri...","""Write a query that answers the following ques...",\n\nSELECT flight_number FROM flights WHERE ...
254,flight_2,SELECT T1.FlightNo FROM FLIGHTS AS T1 JOIN AIR...,Give the flight numbers of flights arriving in...,"[SELECT, T1.FlightNo, FROM, FLIGHTS, AS, T1, J...","[select, t1, ., flightno, from, flights, as, t...","[Give, the, flight, numbers, of, flights, arri...","""Write a query that answers the following ques...",<strong>SELECT flight_number FROM flight WHER...
255,flight_2,SELECT count(*) FROM Flights AS T1 JOIN Airpor...,Find the number of flights landing in the city...,"[SELECT, count, (, *, ), FROM, Flights, AS, T1...","[select, count, (, *, ), from, flights, as, t1...","[Find, the, number, of, flights, landing, in, ...","""Write a query that answers the following ques...",\n\nSELECT COUNT(*) FROM flights WHERE city_n...
256,flight_2,SELECT count(*) FROM Flights AS T1 JOIN Airpor...,How many flights land in Aberdeen or Abilene?,"[SELECT, count, (, *, ), FROM, Flights, AS, T1...","[select, count, (, *, ), from, flights, as, t1...","[How, many, flights, land, in, Aberdeen, or, A...","""Write a query that answers the following ques...",\n\nSELECT count(*) FROM flights WHERE airpor...
257,flight_2,SELECT AirportName FROM Airports WHERE Airport...,Find the name of airports which do not have an...,"[SELECT, AirportName, FROM, Airports, WHERE, A...","[select, airportname, from, airports, where, a...","[Find, the, name, of, airports, which, do, not...","""Write a query that answers the following ques...",\n\nSELECT airport_name FROM airports WHERE ...
258,flight_2,SELECT AirportName FROM Airports WHERE Airport...,Which airports do not have departing or arrivi...,"[SELECT, AirportName, FROM, Airports, WHERE, A...","[select, airportname, from, airports, where, a...","[Which, airports, do, not, have, departing, or...","""Write a query that answers the following ques...",\n\nSELECT * FROM airports WHERE NOT EXISTS...
259,employee_hire_evaluation,SELECT count(*) FROM employee,How many employees are there?,"[SELECT, count, (, *, ), FROM, employee]","[select, count, (, *, ), from, employee]","[How, many, employees, are, there, ?]","""Write a query that answers the following ques...",<strong>SELECT COUNT(*) FROM Employee</strong>

====================================================================================================
(52, 7)
Input:  ['"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Count the number of employees <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Sort employee names by their age in ascending order. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> List the names of employees and sort in ascending order of age. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the number of employees from each city? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Count the number of employees for each city. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Which cities do more than one employee under age 30 come from? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Find the cities that have more than one employee under age 30. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Find the number of shops in each location. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> How many shops are there in each location? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Find the manager name and district of the shop whose number of products is the largest. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the manager name and district of the shop that sells the largest number of products? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> find the minimum and maximum number of products of all stores. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the minimum and maximum number of products across all the shops? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Return the name, location and district of all shops in descending order of number of products. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Sort all the shops by number products in descending order, and return the name, location and district of each shop. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Find the names of stores whose number products is more than the average number of products. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Which shops\' number products is above the average? Give me the shop names. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> find the name of employee who was awarded the most times in the evaluation. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Which employee received the most awards in evaluations? Give me the employee name. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Find the name of the employee who got the highest one time bonus. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Which employee received the biggest bonus? Give me the employee name. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Find the names of employees who never won any award in the evaluation. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the names of the employees who never received any evaluation? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the name of the shop that is hiring the largest number of employees? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Which shop has the most employees? Give me the shop name. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Find the name of the shops that do not hire any employee. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Which shops run with no employees? Find the shop names <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Find the number of employees hired in each shop; show the shop name as well. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> For each shop, return the number of employees working there and the name of the shop. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is total bonus given in all evaluations? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Find the total amount of bonus given in all the evaluations. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Give me all the information about hiring. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is all the information about hiring? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Which district has both stores with less than 3000 products and stores with more than 10000 products? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Find the districts in which there are both shops selling less than 3000 products and shops selling more than 10000 products. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> How many different store locations are there? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Count the number of distinct store locations. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> How many documents do we have? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Count the number of documents. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> List document IDs, document names, and document descriptions for all documents. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the ids, names, and descriptions for all documents? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the document name and template id for document with description with the letter \'w\' in it? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Return the names and template ids for documents that contain the letter w in their description. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the document id, template id and description for document named "Robbin CV"? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Return the document id, template id, and description for the document with the name Robbin CV. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> How many different templates do all document use? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Count the number of different templates used for documents. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> How many documents are using the template with type code \'PPT\'? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Count the number of documents that use the PPT template type. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Show all template ids and number of documents using each template. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are all different template ids used for documents, and how many times were each of them used? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the id and type code for the template used by the most documents? <query> ']
Original query:
SELECT count(*) FROM employee
Generated query:


SELECT  COUNT(*) FROM  employees<eos>
____________________________________________________________________________________________________
Original query:
SELECT name FROM employee ORDER BY age
Generated query:
 <strong>SELECT</strong>  employee_name  <strong>FROM</strong>  employee  <strong>ORDER BY</strong>  age<eos>
____________________________________________________________________________________________________
Original query:
SELECT name FROM employee ORDER BY age
Generated query:
 <strong>SELECT</strong>  name ,  age  <strong>FROM</strong>  employee ORDER BY  age<eos>
____________________________________________________________________________________________________
Original query:
SELECT count(*) ,  city FROM employee GROUP BY city
Generated query:


SELECT  count(*) FROM  employee<eos>
____________________________________________________________________________________________________
Original query:
SELECT count(*) ,  city FROM employee GROUP BY city
Generated query:


SELECT COUNT(*) FROM Employee GROUP BY City<eos>
____________________________________________________________________________________________________
Original query:
SELECT city FROM employee WHERE age  <  30 GROUP BY city HAVING count(*)  >  1
Generated query:


SELECT  city FROM employee WHERE age < 30<eos>
____________________________________________________________________________________________________
Original query:
SELECT city FROM employee WHERE age  <  30 GROUP BY city HAVING count(*)  >  1
Generated query:
 <strong>SELECT</strong>  city FROM  employee WHERE  age < 30<eos>
____________________________________________________________________________________________________
Original query:
SELECT count(*) ,  LOCATION FROM shop GROUP BY LOCATION
Generated query:


SELECT COUNT(*) FROM shop_location<eos>
____________________________________________________________________________________________________
Original query:
SELECT count(*) ,  LOCATION FROM shop GROUP BY LOCATION
Generated query:


SELECT  count(*) FROM  shop<eos>
____________________________________________________________________________________________________
Original query:
SELECT manager_name ,  district FROM shop ORDER BY number_products DESC LIMIT 1
Generated query:
 <strong>SELECT manager_name , district FROM shop ORDER BY product_count DESC LIMIT 1</strong><eos>
____________________________________________________________________________________________________
Original query:
SELECT manager_name ,  district FROM shop ORDER BY number_products DESC LIMIT 1
Generated query:


SELECT  manager_name ,  district FROM  shop_product_sales  GROUP BY  manager_name ,  district  ORDER BY  COUNT(*) DESC LIMIT 1<eos>
____________________________________________________________________________________________________
Original query:
SELECT min(Number_products) ,  max(Number_products) FROM shop
Generated query:


SELECT MIN(products) , MAX(products) FROM stores<eos>
____________________________________________________________________________________________________
Original query:
SELECT min(Number_products) ,  max(Number_products) FROM shop
Generated query:


SELECT MIN(products) , MAX(products) FROM shops<eos>
____________________________________________________________________________________________________
Original query:
SELECT name ,  LOCATION ,  district FROM shop ORDER BY number_products DESC
Generated query:
 SELECT name, location, district FROM shop ORDER BY product_count DESC<eos>
____________________________________________________________________________________________________
Original query:
SELECT name ,  LOCATION ,  district FROM shop ORDER BY number_products DESC
Generated query:
 SELECT  shop_name ,  shop_location ,  shop_district FROM  shop ORDER BY  product_count DESC<eos>
____________________________________________________________________________________________________
Original query:
SELECT name FROM shop WHERE number_products  >  (SELECT avg(number_products) FROM shop)
Generated query:
 <strong>SELECT store_name FROM store WHERE  number_of_products >  (SELECT  avg(number_of_products) FROM product)</strong><eos>
____________________________________________________________________________________________________
Original query:
SELECT name FROM shop WHERE number_products  >  (SELECT avg(number_products) FROM shop)
Generated query:


SELECT  shop_name FROM  shop_product GROUP BY shop_name HAVING  SUM(product_count) >  (SELECT  SUM(product_count) FROM  shop_product GROUP BY shop_name)<eos>
____________________________________________________________________________________________________
Original query:
SELECT t1.name FROM employee AS t1 JOIN evaluation AS t2 ON t1.Employee_ID  =  t2.Employee_ID GROUP BY t2.Employee_ID ORDER BY count(*) DESC LIMIT 1
Generated query:


SELECT  name FROM  employee  WHERE  count  =  (SELECT  MAX  (count)  FROM  employee)<eos>
____________________________________________________________________________________________________
Original query:
SELECT t1.name FROM employee AS t1 JOIN evaluation AS t2 ON t1.Employee_ID  =  t2.Employee_ID GROUP BY t2.Employee_ID ORDER BY count(*) DESC LIMIT 1
Generated query:


SELECT  Employee_Name FROM  Employee_Awards WHERE  Employee_Awards_Count  =  (SELECT  MAX(Employee_Awards_Count) FROM  Employee_Awards)<eos>
____________________________________________________________________________________________________
Original query:
SELECT t1.name FROM employee AS t1 JOIN evaluation AS t2 ON t1.Employee_ID  =  t2.Employee_ID ORDER BY t2.bonus DESC LIMIT 1
Generated query:


SELECT  name FROM  bonus WHERE bonus_amount  =  (SELECT  MAX(bonus_amount) FROM bonus)<eos>
____________________________________________________________________________________________________
Original query:
SELECT t1.name FROM employee AS t1 JOIN evaluation AS t2 ON t1.Employee_ID  =  t2.Employee_ID ORDER BY t2.bonus DESC LIMIT 1
Generated query:


SELECT  employee_name FROM bonus ORDER BY bonus_amount DESC LIMIT 1<eos>
____________________________________________________________________________________________________
Original query:
SELECT name FROM employee WHERE Employee_ID NOT IN (SELECT Employee_ID FROM evaluation)
Generated query:
 <strong>SELECT</strong>  name FROM  employee WHERE  award_count = 0<eos>
____________________________________________________________________________________________________
Original query:
SELECT name FROM employee WHERE Employee_ID NOT IN (SELECT Employee_ID FROM evaluation)
Generated query:


SELECT  e.name FROM employees AS e JOIN evaluations AS e1 ON e.id = e1.employee_id WHERE e1.evaluation_date IS NULL<eos>
____________________________________________________________________________________________________
Original query:
SELECT t2.name FROM hiring AS t1 JOIN shop AS t2 ON t1.shop_id  =  t2.shop_id GROUP BY t1.shop_id ORDER BY count(*) DESC LIMIT 1
Generated query:


SELECT  shop_name FROM  shop_hire_employee  GROUP BY  shop_name  ORDER BY  COUNT(*) DESC LIMIT 1<eos>
____________________________________________________________________________________________________
Original query:
SELECT t2.name FROM hiring AS t1 JOIN shop AS t2 ON t1.shop_id  =  t2.shop_id GROUP BY t1.shop_id ORDER BY count(*) DESC LIMIT 1
Generated query:


SELECT  shop_name FROM  shop_employee GROUP BY  shop_name ORDER BY  COUNT(*) DESC LIMIT 1<eos>
____________________________________________________________________________________________________
Original query:
SELECT name FROM shop WHERE shop_id NOT IN (SELECT shop_id FROM hiring)
Generated query:
 <strong>SELECT</strong>  shop_name FROM  shop WHERE  no_employee > 0<eos>
____________________________________________________________________________________________________
Original query:
SELECT name FROM shop WHERE shop_id NOT IN (SELECT shop_id FROM hiring)
Generated query:


SELECT  shop_name FROM shops WHERE employees_count = 0<eos>
____________________________________________________________________________________________________
Original query:
SELECT count(*) ,  t2.name FROM hiring AS t1 JOIN shop AS t2 ON t1.shop_id  =  t2.shop_id GROUP BY t2.name
Generated query:
 <strong>SELECT</strong>  shop_name , count(*) FROM employee GROUP BY shop_name<eos>
____________________________________________________________________________________________________
Original query:
SELECT count(*) ,  t2.name FROM hiring AS t1 JOIN shop AS t2 ON t1.shop_id  =  t2.shop_id GROUP BY t2.name
Generated query:


SELECT  COUNT(employee_id) ,  shop_name FROM employee JOIN shop ON employee.shop_id  =  shop.shop_id GROUP BY shop_name<eos>
____________________________________________________________________________________________________
Original query:
SELECT sum(bonus) FROM evaluation
Generated query:


SELECT SUM(bonus) FROM evaluation<eos>
____________________________________________________________________________________________________
Original query:
SELECT sum(bonus) FROM evaluation
Generated query:
 SELECT SUM(bonus) FROM evaluation<eos>
____________________________________________________________________________________________________
Original query:
SELECT * FROM hiring
Generated query:


SELECT  * FROM  hire<eos>
____________________________________________________________________________________________________
Original query:
SELECT * FROM hiring

,db_id,query,question,query_toks,query_toks_no_value,question_toks,modified question,generated_query
260,employee_hire_evaluation,SELECT count(*) FROM employee,Count the number of employees,"[SELECT, count, (, *, ), FROM, employee]","[select, count, (, *, ), from, employee]","[Count, the, number, of, employees]","""Write a query that answers the following ques...",\n\nSELECT COUNT(*) FROM employees
261,employee_hire_evaluation,SELECT name FROM employee ORDER BY age,Sort employee names by their age in ascending ...,"[SELECT, name, FROM, employee, ORDER, BY, age]","[select, name, from, employee, order, by, age]","[Sort, employee, names, by, their, age, in, as...","""Write a query that answers the following ques...",<strong>SELECT</strong> employee_name <stro...
262,employee_hire_evaluation,SELECT name FROM employee ORDER BY age,List the names of employees and sort in ascend...,"[SELECT, name, FROM, employee, ORDER, BY, age]","[select, name, from, employee, order, by, age]","[List, the, names, of, employees, and, sort, i...","""Write a query that answers the following ques...","<strong>SELECT</strong> name , age <strong..."
263,employee_hire_evaluation,"SELECT count(*) , city FROM employee GROUP BY...",What is the number of employees from each city?,"[SELECT, count, (, *, ), ,, city, FROM, employ...","[select, count, (, *, ), ,, city, from, employ...","[What, is, the, number, of, employees, from, e...","""Write a query that answers the following ques...",\n\nSELECT count(*) FROM employee
264,employee_hire_evaluation,"SELECT count(*) , city FROM employee GROUP BY...",Count the number of employees for each city.,"[SELECT, count, (, *, ), ,, city, FROM, employ...","[select, count, (, *, ), ,, city, from, employ...","[Count, the, number, of, employees, for, each,...","""Write a query that answers the following ques...",\n\nSELECT COUNT(*) FROM Employee GROUP BY City
265,employee_hire_evaluation,SELECT city FROM employee WHERE age < 30 GRO...,Which cities do more than one employee under a...,"[SELECT, city, FROM, employee, WHERE, age, <, ...","[select, city, from, employee, where, age, <, ...","[Which, cities, do, more, than, one, employee,...","""Write a query that answers the following ques...",\n\nSELECT city FROM employee WHERE age < 30
266,employee_hire_evaluation,SELECT city FROM employee WHERE age < 30 GRO...,Find the cities that have more than one employ...,"[SELECT, city, FROM, employee, WHERE, age, <, ...","[select, city, from, employee, where, age, <, ...","[Find, the, cities, that, have, more, than, on...","""Write a query that answers the following ques...",<strong>SELECT</strong> city FROM employee ...
267,employee_hire_evaluation,"SELECT count(*) , LOCATION FROM shop GROUP BY...",Find the number of shops in each location.,"[SELECT, count, (, *, ), ,, LOCATION, FROM, sh...","[select, count, (, *, ), ,, location, from, sh...","[Find, the, number, of, shops, in, each, locat...","""Write a query that answers the following ques...",\n\nSELECT COUNT(*) FROM shop_location
268,employee_hire_evaluation,"SELECT count(*) , LOCATION FROM shop GROUP BY...",How many shops are there in each location?,"[SELECT, count, (, *, ), ,, LOCATION, FROM, sh...","[select, count, (, *, ), ,, location, from, sh...","[How, many, shops, are, there, in, each, locat...","""Write a query that answers the following ques...",\n\nSELECT count(*) FROM shop
269,employee_hire_evaluation,"SELECT manager_name , district FROM shop ORDE...",Find the manager name and district of the shop...,"[SELECT, manager_name, ,, district, FROM, shop...","[select, manager_name, ,, district, from, shop...","[Find, the, manager, name, and, district, of, ...","""Write a query that answers the following ques...","<strong>SELECT manager_name , district FROM s..."
270,employee_hire_evaluation,"SELECT manager_name , district FROM shop ORDE...",What are the manager name and district of the ...,"[SELECT, manager_name, ,, district, FROM, shop...","[select, manager_name, ,, district, from, shop...","[What, are, the, manager, name, and, district,...","""Write a query that answers the following ques...","\n\nSELECT manager_name , district FROM sh..."
271,employee_hire_evaluation,"SELECT min(Number_products) , max(Number_prod...",find the minimum and maximum number of product...,"[SELECT, min, (, Number_products, ), ,, max, (...","[select, min, (, number_products, ), ,, max, (...","[find, the, minimum, and, maximum, number, of,...","""Write a query that answers the following ques...","\n\nSELECT MIN(products) , MAX(products) FROM..."
272,employee_hire_evaluation,"SELECT min(Number_products) , max(Number_prod...",What are the minimum and maximum number of pro...,"[SELECT, min, (, Number_products, ), ,, max, (...","[select, min, (, number_products, ), ,, max, (...","[What, are, the, minimum, and, maximum, number...","""Write a query that answers the following ques...","\n\nSELECT MIN(products) , MAX(products) FROM..."
273,employee_hire_evaluation,"SELECT name , LOCATION , district FROM shop ...","Return the name, location and district of all ...","[SELECT, name, ,, LOCATION, ,, district, FROM,...","[select, name, ,, location, ,, district, from,...","[Return, the, name, ,, location, and, district...","""Write a query that answers the following ques...","SELECT name, location, district FROM shop ORD..."
274,employee_hire_evaluation,"SELECT name , LOCATION , district FROM shop ...",Sort all the shops by number products in desce...,"[SELECT, name, ,, LOCATION, ,, district, FROM,...","[select, name, ,, location, ,, district, from,...","[Sort, all, the, shops, by, number, products, ...","""Write a query that answers the following ques...","SELECT shop_name , shop_location , shop_di..."
275,employee_hire_evaluation,SELECT name FROM shop WHERE number_products >...,Find the names of stores whose number products...,"[SELECT, name, FROM, shop, WHERE, number_produ...","[select, name, from, shop, where, number_produ...","[Find, the, names, of, stores, whose, number, ...","""Write a query that answers the following ques...",<strong>SELECT store_name FROM store WHERE n...
276,employee_hire_evaluation,SELECT name FROM shop WHERE number_products >...,Which shops' number products is above the aver...,"[SELECT, name, FROM, shop, WHERE, number_produ...","[select, name, from, shop, where, number_produ...","[Which, shops, ', number, products, is, above,...","""Write a query that answers the following ques...",\n\nSELECT shop_name FROM shop_product GROU...
277,employee_hire_evaluation,SELECT t1.name FROM employee AS t1 JOIN evalua...,find the name of employee who was awarded the ...,"[SELECT, t1.name, FROM, employee, AS, t1, JOIN...","[select, t1, ., name, from, employee, as, t1, ...","[find, the, name, of, employee, who, was, awar...","""Write a query that answers the following ques...",\n\nSELECT name FROM employee WHERE count...
278,employee_hire_evaluation,SELECT t1.name FROM employee AS t1 JOIN evalua...,Which employee received the most awards in eva...,"[SELECT, t1.name, FROM, employee, AS, t1, JOIN...","[select, t1, ., name, from, employee, as, t1, ...","[Which, employee, received, the, most, awards,...","""Write a query that answers the following ques...",\n\nSELECT Employee_Name FROM Employee_Awar...
279,employee_hire_evaluation,SELECT t1.name FROM employee AS t1 JOIN evalua...,Find the name of the employee who got the high...,"[SELECT, t1.name, FROM, employee, AS, t1, JOIN...","[select, t1, ., name, from, employee, as, t1, ...","[Find, the, name, of, the, employee, who, got,...","""Write a query that answers the following ques...",\n\nSELECT name FROM bonus WHERE bonus_amou...
280,employee_hire_evaluation,SELECT t1.name FROM employee AS t1 JOIN evalua...,Which employee received the biggest bonus? Giv...,"[SELECT, t1.name, FROM, employee, AS, t1, JOIN...","[select, t1, ., name, from, employee, as, t1, ...","[Which, employee, received, the, biggest, bonu...","""Write a query that answers the following ques...",\n\nSELECT employee_name FROM bonus ORDER BY...
281,employee_hire_evaluation,SELECT name FROM employee WHERE Employee_ID NO...,Find the names of employees who never won any ...,"[SELECT, name, FROM, employee, WHERE, Employee...","[select, name, from, employee, where, employee...","[Find, the, names, of, employees, who, never, ...","""Write a query that answers the following ques...",<strong>SELECT</strong> name FROM employee ...
282,employee_hire_evaluation,SELECT name FROM employee WHERE Employee_ID NO...,What are the names of the employees who never ...,"[SELECT, name, FROM, employee, WHERE, Employee...","[select, name, from, employee, where, employee...","[What, are, the, names, of, the, employees, wh...","""Write a query that answers the following ques...",\n\nSELECT e.name FROM employees AS e JOIN e...
283,employee_hire_evaluation,SELECT t2.name FROM hiring AS t1 JOIN shop AS ...,What is the name of the shop that is hiring th...,"[SELECT, t2.name, FROM, hiring, AS, t1, JOIN, ...","[select, t2, ., name, from, hiring, as, t1, jo...","[What, is, the, name, of, the, shop, that, is,...","""Write a query that answers the following ques...",\n\nSELECT shop_name FROM shop_hire_employe...
284,employee_hire_evaluation,SELECT t2.name FROM hiring AS t1 JOIN shop AS ...,Which shop has the most employees? Give me the...,"[SELECT, t2.name, FROM, hiring, AS, t1, JOIN, ...","[select, t2, ., name, from, hiring, as, t1, jo...","[Which, shop, has, the, most, employees, ?, Gi...","""Write a query that answers the following ques...",\n\nSELECT shop_name FROM shop_employee GRO...
285,employee_hire_evaluation,SELECT name FROM shop WHERE shop_id NOT IN (SE...,Find the name of the shops that do not hire an...,"[SELECT, name, FROM, shop, WHERE, shop_id, NOT...","[select, name, from, shop, where, shop_id, not...","[Find, the, name, of, the, shops, that, do, no...","""Write a query that answers the following ques...",<strong>SELECT</strong> shop_name FROM shop...
286,employee_hire_evaluation,SELECT name FROM shop WHERE shop_id NOT IN (SE...,Which shops run with no employees? Find the sh...,"[SELECT, name, FROM, shop, WHERE, shop_id, NOT...","[select, name, from, shop, where, shop_id, not...","[Which, shops, run, with, no, employees, ?, Fi...","""Write a query that answers the following ques...",\n\nSELECT shop_name FROM shops WHERE employ...
287,employee_hire_evaluation,"SELECT count(*) , t2.name FROM hiring AS t1 J...",Find the number of employees hired in each sho...,"[SELECT, count, (, *, ), ,, t2.name, FROM, hir...","[select, count, (, *, ), ,, t2, ., name, from,...","[Find, the, number, of, employees, hired, in, ...","""Write a query that answers the following ques...","<strong>SELECT</strong> shop_name , count(*)..."
288,employee_hire_evaluation,"SELECT count(*) , t2.name FROM hiring AS t1 J...","For each shop, return the number of employees ...","[SELECT, count, (, *, ), ,, t2.name, FROM, hir...","[select, count, (, *, ), ,, t2, ., name, from,...","[For, each, shop, ,, return, the, number, of, ...","""Write a query that answers the following ques...","\n\nSELECT COUNT(employee_id) , shop_name F..."
289,employee_hire_evaluation,SELECT sum(bonus) FROM evaluation,What is total bonus given in all evaluations?,"[SELECT, sum, (, bonus, ), FROM, evaluation]","[select, sum, (, bonus, ), from, evaluation]","[What, is, total, bonus, given, in, all, evalu...","""Write a query that answers the following ques...",\n\nSELECT SUM(bonus) FROM evaluation
290,employee_hire_evaluation,SELECT sum(bonus) FROM evaluation,Find the total amount of bonus given in all th...,"[SELECT, sum, (, bonus, ), FROM, evaluation]","[select, sum, (, bonus, ), from, evaluation]","[Find, the, total, amount, of, bonus, given, i...","""Write a query that answers the following ques...",SELECT SUM(bonus) FROM evaluation
291,employee_hire_evaluation,SELECT * FROM hiring,Give me all the information about hiring.,"[SELECT, *, FROM, hiring]","[select, *, from, hiring]","[Give, me, all, the, information, about, hirin...","""Write a query that answers the following ques...",\n\nSELECT * FROM hire
292,employee_hire_evaluation,SELECT * FROM hiring,What is all the information about hiring?,"[SELECT, *, FROM, hiring]","[select, *, from, hiring]","[What, is, all, the, information, about, hirin...","""Write a query that answers the following ques...",\n\nSELECT * FROM hire
293,employee_hire_evaluation,SELECT district FROM shop WHERE Number_product...,Which district has both stores with less than ...,"[SELECT, district, FROM, shop, WHERE, Number_p...","[select, district, from, shop, where, number_p...","[Which, district, has, both, stores, with, les...","""Write a query that answers the following ques...",\n\nSELECT DISTINCT district_name FROM st...
294,employee_hire_evaluation,SELECT district FROM shop WHERE Number_product...,Find the districts in which there are both sho...,"[SELECT, district, FROM, shop, WHERE, Number_p...","[select, district, from, shop, where, number_p...","[Find, the, districts, in, which, there, are, ...","""Write a query that answers the following ques...",<strong>SELECT district FROM shops WHERE ( ...
295,employee_hire_evaluation,SELECT count(DISTINCT LOCATION) FROM shop,How many different store locations are there?,"[SELECT, count, (, DISTINCT, LOCATION, ), FROM...","[select, count, (, distinct, location, ), from...","[How, many, different, store, locations, are, ...","""Write a query that answers the following ques...",\n\nSELECT DISTINCT store_location FROM store
296,employee_hire_evaluation,SELECT count(DISTINCT LOCATION) FROM shop,Count the number of distinct store locations.,"[SELECT, count, (, DISTINCT, LOCATION, ), FROM...","[select, count, (, distinct, location, ), from...","[Count, the, number, of, distinct, store, loca...","""Write a query that answers the following ques...",\n\nSELECT DISTINCT store_location FROM store
297,cre_Doc_Template_Mgt,SELECT count(*) FROM Documents,How many documents do we have?,"[SELECT, count, (, *, ), FROM, Documents]","[select, count, (, *, ), from, documents]","[How, many, documents, do, we, have, ?]","""Write a query that answers the following ques...",<strong>SELECT count(*) FROM documents</strong>
298,cre_Doc_Template_Mgt,SELECT count(*) FROM Documents,Count the number of documents.,"[SELECT, count, (, *, ), FROM, Documents]","[select, count, (, *, ), from, documents]","[Count, the, number, of, documents, .]","""Write a query that answers the following ques...",\n\nSELECT COUNT(*) FROM documents
299,cre_Doc_Template_Mgt,"SELECT document_id , document_name , documen...","List document IDs, document names, and documen...","[SELECT, document_id, ,, document_name, ,, doc...","[select, document_id, ,, document_name, ,, doc...","[List, document, IDs, ,, document, names, ,, a...","""Write a query that answers the following ques...","\n\nSELECT document_id , document_name , doc..."
300,cre_Doc_Template_Mgt,"SELECT document_id , document_name , documen...","What are the ids, names, and descriptions for ...","[SELECT, document_id, ,, document_name, ,, doc...","[select, document_id, ,, document_name, ,, doc...","[What, are, the, ids, ,, names, ,, and, descri...","""Write a query that answers the following ques...","\n\nSELECT document_id , document_name , d..."
301,cre_Doc_Template_Mgt,"SELECT document_name , template_id FROM Docum...",What is the document name and template id for ...,"[SELECT, document_name, ,, template_id, FROM, ...","[select, document_name, ,, template_id, from, ...","[What, is, the, document, name, and, template,...","""Write a query that answers the following ques...","\n\nSELECT document_name , template_id FROM..."
302,cre_Doc_Template_Mgt,"SELECT document_name , template_id FROM Docum...",Return the names and template ids for document...,"[SELECT, document_name, ,, template_id, FROM, ...","[select, document_name, ,, template_id, from, ...","[Return, the, names, and, template, ids, for, ...","""Write a query that answers the following ques...","\n\nSELECT document_name , template_id FROM..."
303,cre_Doc_Template_Mgt,"SELECT document_id , template_id , Document_...","What is the document id, template id and descr...","[SELECT, document_id, ,, template_id, ,, Docum...","[select, document_id, ,, template_id, ,, docum...","[What, is, the, document, id, ,, template, id,...","""Write a query that answers the following ques...","\n\nSELECT document_id , template_id , des..."
304,cre_Doc_Template_Mgt,"SELECT document_id , template_id , Document_...","Return the document id, template id, and descr...","[SELECT, document_id, ,, template_id, ,, Docum...","[select, document_id, ,, template_id, ,, docum...","[Return, the, document, id, ,, template, id, ,...","""Write a query that answers the following ques...","\n\nSELECT document_id , template_id , des..."
305,cre_Doc_Template_Mgt,SELECT count(DISTINCT template_id) FROM Documents,How many different templates do all document use?,"[SELECT, count, (, DISTINCT, template_id, ), F...","[select, count, (, distinct, template_id, ), f...","[How, many, different, templates, do, all, doc...","""Write a query that answers the following ques...",\n\nSELECT DISTINCT template FROM document
306,cre_Doc_Template_Mgt,SELECT count(DISTINCT template_id) FROM Documents,Count the number of different templates used f...,"[SELECT, count, (, DISTINCT, template_id, ), F...","[select, count, (, distinct, template_id, ), f...","[Count, the, number, of, different, templates,...","""Write a query that answers the following ques...",\n\nSELECT COUNT(DISTINCT template) FROM docu...
307,cre_Doc_Template_Mgt,SELECT count(*) FROM Documents AS T1 JOIN Temp...,How many documents are using the template with...,"[SELECT, count, (, *, ), FROM, Documents, AS, ...","[select, count, (, *, ), from, documents, as, ...","[How, many, documents, are, using, the, templa...","""Write a query that answers the following ques...",\n\nSELECT COUNT(*) FROM Document WHERE Templ...
308,cre_Doc_Template_Mgt,SELECT count(*) FROM Documents AS T1 JOIN Temp...,Count the number of documents that use the PPT...,"[SELECT, count, (, *, ), FROM, Documents, AS, ...","[select, count, (, *, ), from, documents, as, ...","[Count, the, number, of, documents, that, use,...","""Write a query that answers the following ques...",\n\nSELECT COUNT(*) FROM Document WHERE Templ...
309,cre_Doc_Template_Mgt,"SELECT template_id , count(*) FROM Documents ...",Show all template ids and number of documents ...,"[SELECT, template_id, ,, count, (, *, ), FROM,...","[select, template_id, ,, count, (, *, ), from,...","[Show, all, template, ids, and, number, of, do...","""Write a query that answers the following ques...","\n\nSELECT template_id , count(*) FROM doc..."
310,cre_Doc_Template_Mgt,"SELECT template_id , count(*) FROM Documents ...",What are all different template ids used for d...,"[SELECT, template_id, ,, count, (, *, ), FROM,...","[select, template_id, ,, count, (, *, ), from,...","[What, are, all, different, template, ids, use...","""Write a query that answers the following ques...",\n\nSELECT DISTINCT template_id FROM document...
311,cre_Doc_Template_Mgt,"SELECT T1.template_id , T2.Template_Type_Code...",What is the id and type code for the template ...,"[SELECT, T1.template_id, ,, T2.Template_Type_C...","[select, t1, ., template_id, ,, t2, ., templat...","[What, is, the, id, and, type, code, for, the,...","""Write a query that answers the following ques...","\n\nSELECT template_id , template_type FROM..."

====================================================================================================
(52, 7)
Input:  ['"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Return the id and type code of the template that is used for the greatest number of documents. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Show ids for all templates that are used by more than one document. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the template ids of any templates used in more than a single document? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Show ids for all templates not used by any document. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the ids for templates that are not used in any documents? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> How many templates do we have? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Count the number of templates. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Show template ids, version numbers, and template type codes for all templates. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the ids, version numbers, and type codes for each template? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Show all distinct template type codes for all templates. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the different template type codes? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the ids of templates with template type code PP or PPT? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Return the ids of templates that have the code PP or PPT. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> How many templates have template type code CV? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Count the number of templates of the type CV. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the version number and template type code for the template with version number later than 5? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Return the version numbers and template type codes of templates with a version number greater than 5. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Show all template type codes and number of templates for each. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the different template type codes, and how many templates correspond to each? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Which template type code has most number of templates? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Return the type code of the template type that the most templates belong to. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Show all template type codes with less than three templates. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the codes of template types that have fewer than 3 templates? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What the smallest version number and its template type code? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Return the lowest version number, along with its corresponding template type code. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the template type code of the template used by document with the name "Data base"? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Return the template type code of the template that is used by a document named Data base. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Show all document names using templates with template type code BK. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the names of documents that use templates with the code BK? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Show all template type codes and the number of documents using each type. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the different template type codes, and how many documents use each type? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Which template type code is used by most number of documents? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Return the code of the template type that is most commonly used in documents. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Show all template type codes that are not used by any document. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the codes of template types that are not used for any document? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Show all template type codes and descriptions. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the type codes and descriptions for all template types? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the template type descriptions for template type code "AD". <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Return the template type description of the template type with the code AD. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the template type code for template type description "Book". <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Return the type code of the template type with the description "Book". <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the distinct template type descriptions for the templates ever used by any document? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Return the different descriptions for templates that have been used in a document. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the template ids with template type description "Presentation". <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Return the ids corresponding to templates with the description \'Presentation\'. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> How many paragraphs in total? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Count the number of paragraphs. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> How many paragraphs for the document with name \'Summer Show\'? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Count the number of paragraphs in the document named \'Summer Show\'. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Show paragraph details for paragraph with text \'Korea \' . <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the details for the paragraph that includes the text \'Korea \' ? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Show all paragraph ids and texts for the document with name \'Welcome to NY\'. <query> ']
Original query:
SELECT T1.template_id ,  T2.Template_Type_Code FROM Documents AS T1 JOIN Templates AS T2 ON T1.template_id  =  T2.template_id GROUP BY T1.template_id ORDER BY count(*) DESC LIMIT 1
Generated query:


SELECT  t.id ,  t.type_code FROM  template AS t  GROUP BY  t.id  ORDER BY  COUNT(*) DESC LIMIT 1<eos>
____________________________________________________________________________________________________
Original query:
SELECT template_id FROM Documents GROUP BY template_id HAVING count(*)  >  1
Generated query:
 <strong>SELECT</strong>  template_id FROM  template_document_template GROUP BY  template_id HAVING  COUNT(*) > 1<eos>
____________________________________________________________________________________________________
Original query:
SELECT template_id FROM Documents GROUP BY template_id HAVING count(*)  >  1
Generated query:


SELECT DISTINCT template_id FROM template_document<eos>
____________________________________________________________________________________________________
Original query:
SELECT template_id FROM Templates EXCEPT SELECT template_id FROM Documents
Generated query:


SELECT  t.template_id FROM  template AS t WHERE NOT EXISTS  ( SELECT  1 FROM  document AS d WHERE  d.template_id  =  t.template_id )<eos>
____________________________________________________________________________________________________
Original query:
SELECT template_id FROM Templates EXCEPT SELECT template_id FROM Documents
Generated query:


SELECT DISTINCT  template_id FROM  template WHERE  template_id NOT IN  (SELECT  template_id FROM  document)<eos>
____________________________________________________________________________________________________
Original query:
SELECT count(*) FROM Templates
Generated query:


SELECT COUNT(*) FROM template<eos>
____________________________________________________________________________________________________
Original query:
SELECT count(*) FROM Templates
Generated query:
 SELECT COUNT(*) FROM template<eos>
____________________________________________________________________________________________________
Original query:
SELECT template_id ,  version_number ,  template_type_code FROM Templates
Generated query:
 <strong>SELECT template_id, version_number, template_type_code FROM template</strong><eos>
____________________________________________________________________________________________________
Original query:
SELECT template_id ,  version_number ,  template_type_code FROM Templates
Generated query:


SELECT  t.id ,  t.version_number ,  t.type_code FROM  template AS t<eos>
____________________________________________________________________________________________________
Original query:
SELECT DISTINCT template_type_code FROM Templates
Generated query:


SELECT DISTINCT template_type_code FROM template<eos>
____________________________________________________________________________________________________
Original query:
SELECT DISTINCT template_type_code FROM Templates
Generated query:


SELECT DISTINCT template_type_code FROM template_type<eos>
____________________________________________________________________________________________________
Original query:
SELECT template_id FROM Templates WHERE template_type_code  =  "PP" OR template_type_code  =  "PPT"
Generated query:


SELECT  template_id FROM  template WHERE  template_type_code  =  'PP'  OR  template_type_code  =  'PPT'<eos>
____________________________________________________________________________________________________
Original query:
SELECT template_id FROM Templates WHERE template_type_code  =  "PP" OR template_type_code  =  "PPT"
Generated query:
 SELECT template_id FROM template WHERE code IN ('PP','PPT')<eos>
____________________________________________________________________________________________________
Original query:
SELECT count(*) FROM Templates WHERE template_type_code  =  "CV"
Generated query:


SELECT COUNT(*) FROM template WHERE template_type_code = 'CV'<eos>
____________________________________________________________________________________________________
Original query:
SELECT count(*) FROM Templates WHERE template_type_code  =  "CV"
Generated query:


SELECT COUNT(*) FROM template WHERE type = 'CV'<eos>
____________________________________________________________________________________________________
Original query:
SELECT version_number ,  template_type_code FROM Templates WHERE version_number  >  5
Generated query:


SELECT  version_number ,  template_type_code FROM  template WHERE  version_number >  5<eos>
____________________________________________________________________________________________________
Original query:
SELECT version_number ,  template_type_code FROM Templates WHERE version_number  >  5
Generated query:
 <strong>SELECT</strong>  version_number ,  template_type_code  <strong>FROM</strong>  template  <strong>WHERE</strong>  version_number  >  5<eos>
____________________________________________________________________________________________________
Original query:
SELECT template_type_code ,  count(*) FROM Templates GROUP BY template_type_code
Generated query:


SELECT  t.template_type_code ,  COUNT(*) AS  "Number of Templates" FROM  template AS t GROUP BY  t.template_type_code<eos>
____________________________________________________________________________________________________
Original query:
SELECT template_type_code ,  count(*) FROM Templates GROUP BY template_type_code
Generated query:


SELECT DISTINCT template_type_code FROM template_type<eos>
____________________________________________________________________________________________________
Original query:
SELECT template_type_code FROM Templates GROUP BY template_type_code ORDER BY count(*) DESC LIMIT 1
Generated query:


SELECT  template_type_code ,  count(*) FROM  template GROUP BY  template_type_code<eos>
____________________________________________________________________________________________________
Original query:
SELECT template_type_code FROM Templates GROUP BY template_type_code ORDER BY count(*) DESC LIMIT 1
Generated query:


SELECT  t.type_code FROM  template_type AS t JOIN template AS t1 ON t1.template_type_code = t.type_code GROUP BY t.type_code ORDER BY COUNT(*) DESC LIMIT 1<eos>
____________________________________________________________________________________________________
Original query:
SELECT template_type_code FROM Templates GROUP BY template_type_code HAVING count(*)  <  3
Generated query:


SELECT  t.template_type_code FROM template_type AS t WHERE  t.template_type_code <  3<eos>
____________________________________________________________________________________________________
Original query:
SELECT template_type_code FROM Templates GROUP BY template_type_code HAVING count(*)  <  3
Generated query:


SELECT  template_type_code FROM  template_type WHERE  template_type_code <  3<eos>
____________________________________________________________________________________________________
Original query:
SELECT min(Version_Number) ,  template_type_code FROM Templates
Generated query:


SELECT  MIN(version_number) ,  template_type_code FROM  template_version<eos>
____________________________________________________________________________________________________
Original query:
SELECT min(Version_Number) ,  template_type_code FROM Templates
Generated query:
 <strong>SELECT MIN(version) ,  template_type FROM template_version GROUP BY template_type</strong><eos>
____________________________________________________________________________________________________
Original query:
SELECT T1.template_type_code FROM Templates AS T1 JOIN Documents AS T2 ON T1.template_id  =  T2.template_id WHERE T2.document_name  =  "Data base"
Generated query:


SELECT  t.template_type_code FROM  template AS t WHERE  t.document_name  =  'Data base'<eos>
____________________________________________________________________________________________________
Original query:
SELECT T1.template_type_code FROM Templates AS T1 JOIN Documents AS T2 ON T1.template_id  =  T2.template_id WHERE T2.document_name  =  "Data base"
Generated query:
 <strong>SELECT template_type_code FROM template WHERE document_name = 'Data base'</strong><eos>
____________________________________________________________________________________________________
Original query:
SELECT T2.document_name FROM Templates AS T1 JOIN Documents AS T2 ON T1.template_id  =  T2.template_id WHERE T1.template_type_code  =  "BK"
Generated query:


SELECT  document_name FROM  document_template WHERE  template_type_code  =  'BK'<eos>
____________________________________________________________________________________________________
Original query:
SELECT T2.document_name FROM Templates AS T1 JOIN Documents AS T2 ON T1.template_id  =  T2.template_id WHERE T1.template_type_code  =  "BK"
Generated query:


SELECT  document_name FROM  document_template WHERE  template_code  =  'BK'<eos>
____________________________________________________________________________________________________
Original query:
SELECT T1.template_type_code ,  count(*) FROM Templates AS T1 JOIN Documents AS T2 ON T1.template_id  =  T2.template_id GROUP BY T1.template_type_code
Generated query:


SELECT  t.template_type_code ,  COUNT(*) AS count FROM template AS t GROUP BY t.template_type_code<eos>
____________________________________________________________________________________________________
Original query:

,db_id,query,question,query_toks,query_toks_no_value,question_toks,modified question,generated_query
312,cre_Doc_Template_Mgt,"SELECT T1.template_id , T2.Template_Type_Code...",Return the id and type code of the template th...,"[SELECT, T1.template_id, ,, T2.Template_Type_C...","[select, t1, ., template_id, ,, t2, ., templat...","[Return, the, id, and, type, code, of, the, te...","""Write a query that answers the following ques...","\n\nSELECT t.id , t.type_code FROM templat..."
313,cre_Doc_Template_Mgt,SELECT template_id FROM Documents GROUP BY tem...,Show ids for all templates that are used by mo...,"[SELECT, template_id, FROM, Documents, GROUP, ...","[select, template_id, from, documents, group, ...","[Show, ids, for, all, templates, that, are, us...","""Write a query that answers the following ques...",<strong>SELECT</strong> template_id FROM te...
314,cre_Doc_Template_Mgt,SELECT template_id FROM Documents GROUP BY tem...,What are the template ids of any templates use...,"[SELECT, template_id, FROM, Documents, GROUP, ...","[select, template_id, from, documents, group, ...","[What, are, the, template, ids, of, any, templ...","""Write a query that answers the following ques...",\n\nSELECT DISTINCT template_id FROM template...
315,cre_Doc_Template_Mgt,SELECT template_id FROM Templates EXCEPT SELEC...,Show ids for all templates not used by any doc...,"[SELECT, template_id, FROM, Templates, EXCEPT,...","[select, template_id, from, templates, except,...","[Show, ids, for, all, templates, not, used, by...","""Write a query that answers the following ques...",\n\nSELECT t.template_id FROM template AS t...
316,cre_Doc_Template_Mgt,SELECT template_id FROM Templates EXCEPT SELEC...,What are the ids for templates that are not us...,"[SELECT, template_id, FROM, Templates, EXCEPT,...","[select, template_id, from, templates, except,...","[What, are, the, ids, for, templates, that, ar...","""Write a query that answers the following ques...",\n\nSELECT DISTINCT template_id FROM templa...
317,cre_Doc_Template_Mgt,SELECT count(*) FROM Templates,How many templates do we have?,"[SELECT, count, (, *, ), FROM, Templates]","[select, count, (, *, ), from, templates]","[How, many, templates, do, we, have, ?]","""Write a query that answers the following ques...",\n\nSELECT COUNT(*) FROM template
318,cre_Doc_Template_Mgt,SELECT count(*) FROM Templates,Count the number of templates.,"[SELECT, count, (, *, ), FROM, Templates]","[select, count, (, *, ), from, templates]","[Count, the, number, of, templates, .]","""Write a query that answers the following ques...",SELECT COUNT(*) FROM template
319,cre_Doc_Template_Mgt,"SELECT template_id , version_number , templa...","Show template ids, version numbers, and templa...","[SELECT, template_id, ,, version_number, ,, te...","[select, template_id, ,, version_number, ,, te...","[Show, template, ids, ,, version, numbers, ,, ...","""Write a query that answers the following ques...","<strong>SELECT template_id, version_number, t..."
320,cre_Doc_Template_Mgt,"SELECT template_id , version_number , templa...","What are the ids, version numbers, and type co...","[SELECT, template_id, ,, version_number, ,, te...","[select, template_id, ,, version_number, ,, te...","[What, are, the, ids, ,, version, numbers, ,, ...","""Write a query that answers the following ques...","\n\nSELECT t.id , t.version_number , t.typ..."
321,cre_Doc_Template_Mgt,SELECT DISTINCT template_type_code FROM Templates,Show all distinct template type codes for all ...,"[SELECT, DISTINCT, template_type_code, FROM, T...","[select, distinct, template_type_code, from, t...","[Show, all, distinct, template, type, codes, f...","""Write a query that answers the following ques...",\n\nSELECT DISTINCT template_type_code FROM t...
322,cre_Doc_Template_Mgt,SELECT DISTINCT template_type_code FROM Templates,What are the different template type codes?,"[SELECT, DISTINCT, template_type_code, FROM, T...","[select, distinct, template_type_code, from, t...","[What, are, the, different, template, type, co...","""Write a query that answers the following ques...",\n\nSELECT DISTINCT template_type_code FROM t...
323,cre_Doc_Template_Mgt,SELECT template_id FROM Templates WHERE templa...,What are the ids of templates with template ty...,"[SELECT, template_id, FROM, Templates, WHERE, ...","[select, template_id, from, templates, where, ...","[What, are, the, ids, of, templates, with, tem...","""Write a query that answers the following ques...",\n\nSELECT template_id FROM template WHERE ...
324,cre_Doc_Template_Mgt,SELECT template_id FROM Templates WHERE templa...,Return the ids of templates that have the code...,"[SELECT, template_id, FROM, Templates, WHERE, ...","[select, template_id, from, templates, where, ...","[Return, the, ids, of, templates, that, have, ...","""Write a query that answers the following ques...",SELECT template_id FROM template WHERE code I...
325,cre_Doc_Template_Mgt,SELECT count(*) FROM Templates WHERE template_...,How many templates have template type code CV?,"[SELECT, count, (, *, ), FROM, Templates, WHER...","[select, count, (, *, ), from, templates, wher...","[How, many, templates, have, template, type, c...","""Write a query that answers the following ques...",\n\nSELECT COUNT(*) FROM template WHERE templ...
326,cre_Doc_Template_Mgt,SELECT count(*) FROM Templates WHERE template_...,Count the number of templates of the type CV.,"[SELECT, count, (, *, ), FROM, Templates, WHER...","[select, count, (, *, ), from, templates, wher...","[Count, the, number, of, templates, of, the, t...","""Write a query that answers the following ques...",\n\nSELECT COUNT(*) FROM template WHERE type ...
327,cre_Doc_Template_Mgt,"SELECT version_number , template_type_code FR...",What is the version number and template type c...,"[SELECT, version_number, ,, template_type_code...","[select, version_number, ,, template_type_code...","[What, is, the, version, number, and, template...","""Write a query that answers the following ques...","\n\nSELECT version_number , template_type_c..."
328,cre_Doc_Template_Mgt,"SELECT version_number , template_type_code FR...",Return the version numbers and template type c...,"[SELECT, version_number, ,, template_type_code...","[select, version_number, ,, template_type_code...","[Return, the, version, numbers, and, template,...","""Write a query that answers the following ques...","<strong>SELECT</strong> version_number , te..."
329,cre_Doc_Template_Mgt,"SELECT template_type_code , count(*) FROM Tem...",Show all template type codes and number of tem...,"[SELECT, template_type_code, ,, count, (, *, )...","[select, template_type_code, ,, count, (, *, )...","[Show, all, template, type, codes, and, number...","""Write a query that answers the following ques...","\n\nSELECT t.template_type_code , COUNT(*) ..."
330,cre_Doc_Template_Mgt,"SELECT template_type_code , count(*) FROM Tem...","What are the different template type codes, an...","[SELECT, template_type_code, ,, count, (, *, )...","[select, template_type_code, ,, count, (, *, )...","[What, are, the, different, template, type, co...","""Write a query that answers the following ques...",\n\nSELECT DISTINCT template_type_code FROM t...
331,cre_Doc_Template_Mgt,SELECT template_type_code FROM Templates GROUP...,Which template type code has most number of te...,"[SELECT, template_type_code, FROM, Templates, ...","[select, template_type_code, from, templates, ...","[Which, template, type, code, has, most, numbe...","""Write a query that answers the following ques...","\n\nSELECT template_type_code , count(*) FR..."
332,cre_Doc_Template_Mgt,SELECT template_type_code FROM Templates GROUP...,Return the type code of the template type that...,"[SELECT, template_type_code, FROM, Templates, ...","[select, template_type_code, from, templates, ...","[Return, the, type, code, of, the, template, t...","""Write a query that answers the following ques...",\n\nSELECT t.type_code FROM template_type A...
333,cre_Doc_Template_Mgt,SELECT template_type_code FROM Templates GROUP...,Show all template type codes with less than th...,"[SELECT, template_type_code, FROM, Templates, ...","[select, template_type_code, from, templates, ...","[Show, all, template, type, codes, with, less,...","""Write a query that answers the following ques...",\n\nSELECT t.template_type_code FROM templat...
334,cre_Doc_Template_Mgt,SELECT template_type_code FROM Templates GROUP...,What are the codes of template types that have...,"[SELECT, template_type_code, FROM, Templates, ...","[select, template_type_code, from, templates, ...","[What, are, the, codes, of, template, types, t...","""Write a query that answers the following ques...",\n\nSELECT template_type_code FROM template...
335,cre_Doc_Template_Mgt,"SELECT min(Version_Number) , template_type_co...",What the smallest version number and its templ...,"[SELECT, min, (, Version_Number, ), ,, templat...","[select, min, (, version_number, ), ,, templat...","[What, the, smallest, version, number, and, it...","""Write a query that answers the following ques...","\n\nSELECT MIN(version_number) , template_t..."
336,cre_Doc_Template_Mgt,"SELECT min(Version_Number) , template_type_co...","Return the lowest version number, along with i...","[SELECT, min, (, Version_Number, ), ,, templat...","[select, min, (, version_number, ), ,, templat...","[Return, the, lowest, version, number, ,, alon...","""Write a query that answers the following ques...","<strong>SELECT MIN(version) , template_type ..."
337,cre_Doc_Template_Mgt,SELECT T1.template_type_code FROM Templates AS...,What is the template type code of the template...,"[SELECT, T1.template_type_code, FROM, Template...","[select, t1, ., template_type_code, from, temp...","[What, is, the, template, type, code, of, the,...","""Write a query that answers the following ques...",\n\nSELECT t.template_type_code FROM templa...
338,cre_Doc_Template_Mgt,SELECT T1.template_type_code FROM Templates AS...,Return the template type code of the template ...,"[SELECT, T1.template_type_code, FROM, Template...","[select, t1, ., template_type_code, from, temp...","[Return, the, template, type, code, of, the, t...","""Write a query that answers the following ques...",<strong>SELECT template_type_code FROM templa...
339,cre_Doc_Template_Mgt,SELECT T2.document_name FROM Templates AS T1 J...,Show all document names using templates with t...,"[SELECT, T2.document_name, FROM, Templates, AS...","[select, t2, ., document_name, from, templates...","[Show, all, document, names, using, templates,...","""Write a query that answers the following ques...",\n\nSELECT document_name FROM document_temp...
340,cre_Doc_Template_Mgt,SELECT T2.document_name FROM Templates AS T1 J...,What are the names of documents that use templ...,"[SELECT, T2.document_name, FROM, Templates, AS...","[select, t2, ., document_name, from, templates...","[What, are, the, names, of, documents, that, u...","""Write a query that answers the following ques...",\n\nSELECT document_name FROM document_temp...
341,cre_Doc_Template_Mgt,"SELECT T1.template_type_code , count(*) FROM ...",Show all template type codes and the number of...,"[SELECT, T1.template_type_code, ,, count, (, *...","[select, t1, ., template_type_code, ,, count, ...","[Show, all, template, type, codes, and, the, n...","""Write a query that answers the following ques...","\n\nSELECT t.template_type_code , COUNT(*) ..."
342,cre_Doc_Template_Mgt,"SELECT T1.template_type_code , count(*) FROM ...","What are the different template type codes, an...","[SELECT, T1.template_type_code, ,, count, (, *...","[select, t1, ., template_type_code, ,, count, ...","[What, are, the, different, template, type, co...","""Write a query that answers the following ques...",\n\nSELECT DISTINCT template_type_code FROM d...
343,cre_Doc_Template_Mgt,SELECT T1.template_type_code FROM Templates AS...,Which template type code is used by most numbe...,"[SELECT, T1.template_type_code, FROM, Template...","[select, t1, ., template_type_code, from, temp...","[Which, template, type, code, is, used, by, mo...","""Write a query that answers the following ques...",\n\nSELECT template_type_code FROM documen...
344,cre_Doc_Template_Mgt,SELECT T1.template_type_code FROM Templates AS...,Return the code of the template type that is m...,"[SELECT, T1.template_type_code, FROM, Template...","[select, t1, ., template_type_code, from, temp...","[Return, the, code, of, the, template, type, t...","""Write a query that answers the following ques...",\n\nSELECT template_type_code FROM template...
345,cre_Doc_Template_Mgt,SELECT template_type_code FROM Templates EXCEP...,Show all template type codes that are not used...,"[SELECT, template_type_code, FROM, Templates, ...","[select, template_type_code, from, templates, ...","[Show, all, template, type, codes, that, are, ...","""Write a query that answers the following ques...",<strong>SELECT DISTINCT template_type_code FR...
346,cre_Doc_Template_Mgt,SELECT template_type_code FROM Templates EXCEP...,What are the codes of template types that are ...,"[SELECT, template_type_code, FROM, Templates, ...","[select, template_type_code, from, templates, ...","[What, are, the, codes, of, template, types, t...","""Write a query that answers the following ques...",\n\nSELECT DISTINCT template_type_code FROM ...
347,cre_Doc_Template_Mgt,"SELECT template_type_code , template_type_des...",Show all template type codes and descriptions.,"[SELECT, template_type_code, ,, template_type_...","[select, template_type_code, ,, template_type_...","[Show, all, template, type, codes, and, descri...","""Write a query that answers the following ques...","\n\nSELECT t.template_type_code , t.template..."
348,cre_Doc_Template_Mgt,"SELECT template_type_code , template_type_des...",What are the type codes and descriptions for a...,"[SELECT, template_type_code, ,, template_type_...","[select, template_type_code, ,, template_type_...","[What, are, the, type, codes, and, description...","""Write a query that answers the following ques...","\n\nSELECT t.type_code , t.type_desc FROM t..."
349,cre_Doc_Template_Mgt,SELECT template_type_description FROM Ref_temp...,What is the template type descriptions for tem...,"[SELECT, template_type_description, FROM, Ref_...","[select, template_type_description, from, ref_...","[What, is, the, template, type, descriptions, ...","""Write a query that answers the following ques...",\n\nSELECT t.template_type_description FROM ...
350,cre_Doc_Template_Mgt,SELECT template_type_description FROM Ref_temp...,Return the template type description of the te...,"[SELECT, template_type_description, FROM, Ref_...","[select, template_type_description, from, ref_...","[Return, the, template, type, description, of,...","""Write a query that answers the following ques...",\n\nSELECT t.template_type_description FROM ...
351,cre_Doc_Template_Mgt,SELECT template_type_code FROM Ref_template_ty...,What is the template type code for template ty...,"[SELECT, template_type_code, FROM, Ref_templat...","[select, template_type_code, from, ref_templat...","[What, is, the, template, type, code, for, tem...","""Write a query that answers the following ques...",\n\nSELECT t.template_type_code FROM templa...
352,cre_Doc_Template_Mgt,SELECT template_type_code FROM Ref_template_ty...,Return the type code of the template type with...,"[SELECT, template_type_code, FROM, Ref_templat...","[select, template_type_code, from, ref_templat...","[Return, the, type, code, of, the, template, t...","""Write a query that answers the following ques...",<strong>SELECT type_code FROM template WHERE ...
353,cre_Doc_Template_Mgt,SELECT DISTINCT T1.template_type_description F...,What are the distinct template type descriptio...,"[SELECT, DISTINCT, T1.template_type_descriptio...","[select, distinct, t1, ., template_type_descri...","[What, are, the, distinct, template, type, des...","""Write a query that answers the following ques...",\n\nSELECT DISTINCT TEMPLATE_TYPE_DESCRIPTION...
354,cre_Doc_Template_Mgt,SELECT DISTINCT T1.template_type_description F...,Return the different descriptions for template...,"[SELECT, DISTINCT, T1.template_type_descriptio...","[select, distinct, t1, ., template_type_descri...","[Return, the, different, descriptions, for, te...","""Write a query that answers the following ques...",\n\nSELECT DISTINCT description FROM template...
355,cre_Doc_Template_Mgt,SELECT T2.template_id FROM Ref_template_types ...,What are the template ids with template type d...,"[SELECT, T2.template_id, FROM, Ref_template_ty...","[select, t2, ., template_id, from, ref_templat...","[What, are, the, template, ids, with, template...","""Write a query that answers the following ques...",\n\nSELECT DISTINCT template_id FROM template...
356,cre_Doc_Template_Mgt,SELECT T2.template_id FROM Ref_template_types ...,Return the ids corresponding to templates with...,"[SELECT, T2.template_id, FROM, Ref_template_ty...","[select, t2, ., template_id, from, ref_templat...","[Return, the, ids, corresponding, to, template...","""Write a query that answers the following ques...",\n\nSELECT template_id FROM template WHERE ...
357,cre_Doc_Template_Mgt,SELECT count(*) FROM Paragraphs,How many paragraphs in total?,"[SELECT, count, (, *, ), FROM, Paragraphs]","[select, count, (, *, ), from, paragraphs]","[How, many, paragraphs, in, total, ?]","""Write a query that answers the following ques...",\n\nSELECT COUNT(*) FROM paragraph
358,cre_Doc_Template_Mgt,SELECT count(*) FROM Paragraphs,Count the number of paragraphs.,"[SELECT, count, (, *, ), FROM, Paragraphs]","[select, count, (, *, ), from, paragraphs]","[Count, the, number, of, paragraphs, .]","""Write a query that answers the following ques...",SELECT COUNT(*) FROM paragraph
359,cre_Doc_Template_Mgt,SELECT count(*) FROM Paragraphs AS T1 JOIN Doc...,How many paragraphs for the document with name...,"[SELECT, count, (, *, ), FROM, Paragraphs, AS,...","[select, count, (, *, ), from, paragraphs, as,...","[How, many, paragraphs, for, the, document, wi...","""Write a query that answers the following ques...",\n\nSELECT count(*) FROM Document WHERE name ...
360,cre_Doc_Template_Mgt,SELECT count(*) FROM Paragraphs AS T1 JOIN Doc...,Count the number of paragraphs in the document...,"[SELECT, count, (, *, ), FROM, Paragraphs, AS,...","[select, count, (, *, ), from, paragraphs, as,...","[Count, the, number, of, paragraphs, in, the, ...","""Write a query that answers the following ques...",\n\nSELECT COUNT(*) FROM document WHERE do...
361,cre_Doc_Template_Mgt,select other_details from paragraphs where par...,Show paragraph details for paragraph with text...,"[select, other_details, from, paragraphs, wher...","[select, other_details, from, paragraphs, wher...","[Show, paragraph, details, for, paragraph, wit...","""Write a query that answers the following ques...",<strong>SELECT * FROM paragraph WHERE text LI...
362,cre_Doc_Template_Mgt,select other_details from paragraphs where par...,What are the details for the paragraph that in...,"[select, other_details, from, paragraphs, wher...","[select, other_details, from, paragraphs, wher...","[What, are, the, details, for, the, paragraph,...","""Write a query that answers the following ques...",<strong>SELECT * FROM paragraph WHERE text LI...
363,cre_Doc_Template_Mgt,"SELECT T1.paragraph_id , T1.paragraph_text F...",Show all paragraph ids and texts for the docum...,"[SELECT, T1.paragraph_id, ,, T1.paragraph_text...","[select, t1, ., paragraph_id, ,, t1, ., paragr...","[Show, all, paragraph, ids, and, texts, for, t...","""Write a query that answers the following ques...","\n\nSELECT paragraph_id , text FROM docume..."

====================================================================================================
(52, 7)
Input:  ['"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the ids and texts of paragraphs in the document titled \'Welcome to NY\'? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Show all paragraph texts for the document "Customer reviews". <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the paragraph texts for the document with the name \'Customer reviews\'? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Show all document ids and the number of paragraphs in each document. Order by document id. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Return the different document ids along with the number of paragraphs corresponding to each, ordered by id. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Show all document ids, names and the number of paragraphs in each document. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the ids and names of each document, as well as the number of paragraphs in each? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> List all document ids with at least two paragraphs. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the ids of documents that have 2 or more paragraphs? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the document id and name with greatest number of paragraphs? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Return the id and name of the document with the most paragraphs. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the document id with least number of paragraphs? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Return the id of the document with the fewest paragraphs. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the document id with 1 to 2 paragraphs? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Give the ids of documents that have between one and two paragraphs. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Show the document id with paragraph text \'Brazil\' and \'Ireland\'. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the ids of documents that contain the paragraph text \'Brazil\' and \'Ireland\'? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> How many teachers are there? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the total count of teachers? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> List the names of teachers in ascending order of age. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the names of the teachers ordered by ascending age? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the age and hometown of teachers? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the age and hometown of every teacher? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> List the name of teachers whose hometown is not `` Little Lever Urban District \'\' . <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the names of the teachers whose hometown is not `` Little Lever Urban District \'\' ? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Show the name of teachers aged either 32 or 33? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the names of the teachers who are aged either 32 or 33? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the hometown of the youngest teacher? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Where is the youngest teacher from? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Show different hometown of teachers and the number of teachers from each hometown. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> For each hometown, how many teachers are there? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> List the most common hometown of teachers. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the most commmon hometowns for teachers? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Show the hometowns shared by at least two teachers. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the towns from which at least two teachers come from? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Show names of teachers and the courses they are arranged to teach. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the name of each teacher and what course they teach? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Show names of teachers and the courses they are arranged to teach in ascending alphabetical order of the teacher\'s name. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the names of the teachers and the courses they teach in ascending alphabetical order by the name of the teacher? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Show the name of the teacher for the math course. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the names of the people who teach math courses? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Show names of teachers and the number of courses they teach. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the names of the teachers and how many courses do they teach? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Show names of teachers that teach at least two courses. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the names of the teachers who teach at least two courses? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> List the names of teachers who have not been arranged to teach courses. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the names of the teachers whose courses have not been arranged? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> How many visitors below age 30 are there? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Find the names of the visitors whose membership level is higher than 4, and order the results by the level from high to low. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the average age of the visitors whose membership level is not higher than 4? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Find the name and membership level of the visitors whose membership level is higher than 4, and sort by their age from old to young. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Find the id and name of the museum that has the most staff members? <query> ']
Original query:
SELECT T1.paragraph_id ,   T1.paragraph_text FROM Paragraphs AS T1 JOIN Documents AS T2 ON T1.document_id  =  T2.document_id WHERE T2.Document_Name  =  'Welcome to NY'
Generated query:


SELECT  document_id ,  document_text FROM  document WHERE  document_title  =  'Welcome to NY'<eos>
____________________________________________________________________________________________________
Original query:
SELECT T1.paragraph_text FROM Paragraphs AS T1 JOIN Documents AS T2 ON T1.document_id  =  T2.document_id WHERE T2.document_name  =  "Customer reviews"
Generated query:


SELECT  * FROM  document  WHERE  document_id  =  "Customer reviews"<eos>
____________________________________________________________________________________________________
Original query:
SELECT T1.paragraph_text FROM Paragraphs AS T1 JOIN Documents AS T2 ON T1.document_id  =  T2.document_id WHERE T2.document_name  =  "Customer reviews"
Generated query:


SELECT  * FROM  document WHERE  document_name  =  'Customer reviews'<eos>
____________________________________________________________________________________________________
Original query:
SELECT document_id ,  count(*) FROM Paragraphs GROUP BY document_id ORDER BY document_id
Generated query:


SELECT  document_id ,  count(*) AS  count_of_paragraph FROM  document GROUP BY  document_id ORDER BY  document_id<eos>
____________________________________________________________________________________________________
Original query:
SELECT document_id ,  count(*) FROM Paragraphs GROUP BY document_id ORDER BY document_id
Generated query:


SELECT DISTINCT document_id , count(*) FROM paragraph GROUP BY document_id ORDER BY document_id<eos>
____________________________________________________________________________________________________
Original query:
SELECT T1.document_id ,  T2.document_name ,  count(*) FROM Paragraphs AS T1 JOIN Documents AS T2 ON T1.document_id  =  T2.document_id GROUP BY T1.document_id
Generated query:


SELECT  document_id ,  document_name ,  count(*) AS  "number of paragraphs" FROM  document GROUP BY  document_id<eos>
____________________________________________________________________________________________________
Original query:
SELECT T1.document_id ,  T2.document_name ,  count(*) FROM Paragraphs AS T1 JOIN Documents AS T2 ON T1.document_id  =  T2.document_id GROUP BY T1.document_id
Generated query:


SELECT  document_id ,  document_name ,  count(*) AS paragraph_count FROM  document GROUP BY  document_id<eos>
____________________________________________________________________________________________________
Original query:
SELECT document_id FROM Paragraphs GROUP BY document_id HAVING count(*)  >=  2
Generated query:


SELECT DISTINCT document_id FROM document WHERE length(paragraph) > 1<eos>
____________________________________________________________________________________________________
Original query:
SELECT document_id FROM Paragraphs GROUP BY document_id HAVING count(*)  >=  2
Generated query:


SELECT DISTINCT document_id FROM document_paragraph WHERE paragraph_count >= 2<eos>
____________________________________________________________________________________________________
Original query:
SELECT T1.document_id ,  T2.document_name FROM Paragraphs AS T1 JOIN Documents AS T2 ON T1.document_id  =  T2.document_id GROUP BY T1.document_id ORDER BY count(*) DESC LIMIT 1
Generated query:


SELECT  document_id ,  document_name ,  count(*) AS  count_of_paragraph  FROM  document  GROUP BY  document_id  ORDER BY  count_of_paragraph DESC LIMIT 1<eos>
____________________________________________________________________________________________________
Original query:
SELECT T1.document_id ,  T2.document_name FROM Paragraphs AS T1 JOIN Documents AS T2 ON T1.document_id  =  T2.document_id GROUP BY T1.document_id ORDER BY count(*) DESC LIMIT 1
Generated query:


SELECT  document_id ,  document_name FROM  document  ORDER BY  paragraph_count DESC LIMIT 1<eos>
____________________________________________________________________________________________________
Original query:
SELECT document_id FROM Paragraphs GROUP BY document_id ORDER BY count(*) ASC LIMIT 1
Generated query:


SELECT MIN(document_id) FROM document<eos>
____________________________________________________________________________________________________
Original query:
SELECT document_id FROM Paragraphs GROUP BY document_id ORDER BY count(*) ASC LIMIT 1
Generated query:


SELECT  document_id FROM  document  WHERE  count(paragraph_id)  =  (SELECT  min(count(paragraph_id)) FROM  document)<eos>
____________________________________________________________________________________________________
Original query:
SELECT document_id FROM Paragraphs GROUP BY document_id HAVING count(*) BETWEEN 1 AND 2
Generated query:


SELECT  document_id FROM  document WHERE  paragraph_count  BETWEEN  1 AND  2<eos>
____________________________________________________________________________________________________
Original query:
SELECT document_id FROM Paragraphs GROUP BY document_id HAVING count(*) BETWEEN 1 AND 2
Generated query:


SELECT DISTINCT document_id FROM documents WHERE  count(paragraph_id) BETWEEN 1 AND 2<eos>
____________________________________________________________________________________________________
Original query:
SELECT document_id FROM Paragraphs WHERE paragraph_text  =  'Brazil' INTERSECT SELECT document_id FROM Paragraphs WHERE paragraph_text  =  'Ireland'
Generated query:
 <strong>SELECT document_id FROM documents WHERE paragraph_text LIKE '%Brazil%' AND paragraph_text LIKE '%Ireland%'</strong><eos>
____________________________________________________________________________________________________
Original query:
SELECT document_id FROM Paragraphs WHERE paragraph_text  =  'Brazil' INTERSECT SELECT document_id FROM Paragraphs WHERE paragraph_text  =  'Ireland'
Generated query:


SELECT DISTINCT document_id FROM documents WHERE paragraph_text LIKE '%Brazil%' AND paragraph_text LIKE '%Ireland%'<eos>
____________________________________________________________________________________________________
Original query:
SELECT count(*) FROM teacher
Generated query:


SELECT COUNT(*) FROM teacher<eos>
____________________________________________________________________________________________________
Original query:
SELECT count(*) FROM teacher
Generated query:


SELECT COUNT(*) FROM teacher<eos>
____________________________________________________________________________________________________
Original query:
SELECT Name FROM teacher ORDER BY Age ASC
Generated query:
 <strong>SELECT teacher_name FROM teacher ORDER BY age ASC</strong><eos>
____________________________________________________________________________________________________
Original query:
SELECT Name FROM teacher ORDER BY Age ASC
Generated query:


SELECT  t.name FROM teachers AS t ORDER BY t.age<eos>
____________________________________________________________________________________________________
Original query:
SELECT Age ,  Hometown FROM teacher
Generated query:


SELECT  t.age , t.hometown  FROM teachers AS t JOIN teachers_hometowns AS th ON t.teacher_id  = th.teacher_id<eos>
____________________________________________________________________________________________________
Original query:
SELECT Age ,  Hometown FROM teacher
Generated query:


SELECT  t.age , t.hometown FROM teacher AS t<eos>
____________________________________________________________________________________________________
Original query:
select name from teacher where hometown != "little lever urban district"
Generated query:
 <strong>SELECT name FROM teacher WHERE hometown <> 'Little Lever Urban District'</strong><eos>
____________________________________________________________________________________________________
Original query:
select name from teacher where hometown != "little lever urban district"
Generated query:


SELECT  t.name FROM teachers AS t JOIN teachers_hometowns AS t_hometowns ON t.id = t_hometowns.teacher_id WHERE t_hometowns.town_name <> 'Little Lever Urban District'<eos>
____________________________________________________________________________________________________
Original query:
SELECT Name FROM teacher WHERE Age  =  32 OR Age  =  33
Generated query:


SELECT  t.name FROM teachers AS t WHERE  t.age  =  32 OR  t.age  =  33<eos>
____________________________________________________________________________________________________
Original query:
SELECT Name FROM teacher WHERE Age  =  32 OR Age  =  33
Generated query:


SELECT  t.name FROM teachers AS t JOIN teachers_age AS ta ON t.id = ta.teacher_id WHERE ta.age = 32 OR ta.age = 33<eos>
____________________________________________________________________________________________________
Original query:
SELECT Hometown FROM teacher ORDER BY Age ASC LIMIT 1
Generated query:


SELECT  t1.hometown FROM teacher AS t1 JOIN teacher AS t2 ON t1.id  =  t2.id WHERE  t2.age  =  (SELECT  MIN(t3.age) FROM teacher AS t3)<eos>
____________________________________________________________________________________________________
Original query:
SELECT Hometown FROM teacher ORDER BY Age ASC LIMIT 1
Generated query:


SELECT  t1.name FROM teachers AS t1 JOIN teachers AS t2 ON t1.id  =  t2.id WHERE t2.age  =  1<eos>
____________________________________________________________________________________________________
Original query:

,db_id,query,question,query_toks,query_toks_no_value,question_toks,modified question,generated_query
364,cre_Doc_Template_Mgt,"SELECT T1.paragraph_id , T1.paragraph_text F...",What are the ids and texts of paragraphs in th...,"[SELECT, T1.paragraph_id, ,, T1.paragraph_text...","[select, t1, ., paragraph_id, ,, t1, ., paragr...","[What, are, the, ids, and, texts, of, paragrap...","""Write a query that answers the following ques...","\n\nSELECT document_id , document_text FROM..."
365,cre_Doc_Template_Mgt,SELECT T1.paragraph_text FROM Paragraphs AS T1...,"Show all paragraph texts for the document ""Cus...","[SELECT, T1.paragraph_text, FROM, Paragraphs, ...","[select, t1, ., paragraph_text, from, paragrap...","[Show, all, paragraph, texts, for, the, docume...","""Write a query that answers the following ques...",\n\nSELECT * FROM document WHERE document...
366,cre_Doc_Template_Mgt,SELECT T1.paragraph_text FROM Paragraphs AS T1...,What are the paragraph texts for the document ...,"[SELECT, T1.paragraph_text, FROM, Paragraphs, ...","[select, t1, ., paragraph_text, from, paragrap...","[What, are, the, paragraph, texts, for, the, d...","""Write a query that answers the following ques...",\n\nSELECT * FROM document WHERE document_...
367,cre_Doc_Template_Mgt,"SELECT document_id , count(*) FROM Paragraphs...",Show all document ids and the number of paragr...,"[SELECT, document_id, ,, count, (, *, ), FROM,...","[select, document_id, ,, count, (, *, ), from,...","[Show, all, document, ids, and, the, number, o...","""Write a query that answers the following ques...","\n\nSELECT document_id , count(*) AS count..."
368,cre_Doc_Template_Mgt,"SELECT document_id , count(*) FROM Paragraphs...",Return the different document ids along with t...,"[SELECT, document_id, ,, count, (, *, ), FROM,...","[select, document_id, ,, count, (, *, ), from,...","[Return, the, different, document, ids, along,...","""Write a query that answers the following ques...","\n\nSELECT DISTINCT document_id , count(*) FR..."
369,cre_Doc_Template_Mgt,"SELECT T1.document_id , T2.document_name , c...","Show all document ids, names and the number of...","[SELECT, T1.document_id, ,, T2.document_name, ...","[select, t1, ., document_id, ,, t2, ., documen...","[Show, all, document, ids, ,, names, and, the,...","""Write a query that answers the following ques...","\n\nSELECT document_id , document_name , c..."
370,cre_Doc_Template_Mgt,"SELECT T1.document_id , T2.document_name , c...","What are the ids and names of each document, a...","[SELECT, T1.document_id, ,, T2.document_name, ...","[select, t1, ., document_id, ,, t2, ., documen...","[What, are, the, ids, and, names, of, each, do...","""Write a query that answers the following ques...","\n\nSELECT document_id , document_name , c..."
371,cre_Doc_Template_Mgt,SELECT document_id FROM Paragraphs GROUP BY do...,List all document ids with at least two paragr...,"[SELECT, document_id, FROM, Paragraphs, GROUP,...","[select, document_id, from, paragraphs, group,...","[List, all, document, ids, with, at, least, tw...","""Write a query that answers the following ques...",\n\nSELECT DISTINCT document_id FROM document...
372,cre_Doc_Template_Mgt,SELECT document_id FROM Paragraphs GROUP BY do...,What are the ids of documents that have 2 or m...,"[SELECT, document_id, FROM, Paragraphs, GROUP,...","[select, document_id, from, paragraphs, group,...","[What, are, the, ids, of, documents, that, hav...","""Write a query that answers the following ques...",\n\nSELECT DISTINCT document_id FROM document...
373,cre_Doc_Template_Mgt,"SELECT T1.document_id , T2.document_name FROM...",What is the document id and name with greatest...,"[SELECT, T1.document_id, ,, T2.document_name, ...","[select, t1, ., document_id, ,, t2, ., documen...","[What, is, the, document, id, and, name, with,...","""Write a query that answers the following ques...","\n\nSELECT document_id , document_name , c..."
374,cre_Doc_Template_Mgt,"SELECT T1.document_id , T2.document_name FROM...",Return the id and name of the document with th...,"[SELECT, T1.document_id, ,, T2.document_name, ...","[select, t1, ., document_id, ,, t2, ., documen...","[Return, the, id, and, name, of, the, document...","""Write a query that answers the following ques...","\n\nSELECT document_id , document_name FROM..."
375,cre_Doc_Template_Mgt,SELECT document_id FROM Paragraphs GROUP BY do...,What is the document id with least number of p...,"[SELECT, document_id, FROM, Paragraphs, GROUP,...","[select, document_id, from, paragraphs, group,...","[What, is, the, document, id, with, least, num...","""Write a query that answers the following ques...",\n\nSELECT MIN(document_id) FROM document
376,cre_Doc_Template_Mgt,SELECT document_id FROM Paragraphs GROUP BY do...,Return the id of the document with the fewest ...,"[SELECT, document_id, FROM, Paragraphs, GROUP,...","[select, document_id, from, paragraphs, group,...","[Return, the, id, of, the, document, with, the...","""Write a query that answers the following ques...",\n\nSELECT document_id FROM document WHERE...
377,cre_Doc_Template_Mgt,SELECT document_id FROM Paragraphs GROUP BY do...,What is the document id with 1 to 2 paragraphs?,"[SELECT, document_id, FROM, Paragraphs, GROUP,...","[select, document_id, from, paragraphs, group,...","[What, is, the, document, id, with, 1, to, 2, ...","""Write a query that answers the following ques...",\n\nSELECT document_id FROM document WHERE ...
378,cre_Doc_Template_Mgt,SELECT document_id FROM Paragraphs GROUP BY do...,Give the ids of documents that have between on...,"[SELECT, document_id, FROM, Paragraphs, GROUP,...","[select, document_id, from, paragraphs, group,...","[Give, the, ids, of, documents, that, have, be...","""Write a query that answers the following ques...",\n\nSELECT DISTINCT document_id FROM document...
379,cre_Doc_Template_Mgt,SELECT document_id FROM Paragraphs WHERE parag...,Show the document id with paragraph text 'Braz...,"[SELECT, document_id, FROM, Paragraphs, WHERE,...","[select, document_id, from, paragraphs, where,...","[Show, the, document, id, with, paragraph, tex...","""Write a query that answers the following ques...",<strong>SELECT document_id FROM documents WHE...
380,cre_Doc_Template_Mgt,SELECT document_id FROM Paragraphs WHERE parag...,What are the ids of documents that contain the...,"[SELECT, document_id, FROM, Paragraphs, WHERE,...","[select, document_id, from, paragraphs, where,...","[What, are, the, ids, of, documents, that, con...","""Write a query that answers the following ques...",\n\nSELECT DISTINCT document_id FROM document...
381,course_teach,SELECT count(*) FROM teacher,How many teachers are there?,"[SELECT, count, (, *, ), FROM, teacher]","[select, count, (, *, ), from, teacher]","[How, many, teachers, are, there, ?]","""Write a query that answers the following ques...",\n\nSELECT COUNT(*) FROM teacher
382,course_teach,SELECT count(*) FROM teacher,What is the total count of teachers?,"[SELECT, count, (, *, ), FROM, teacher]","[select, count, (, *, ), from, teacher]","[What, is, the, total, count, of, teachers, ?]","""Write a query that answers the following ques...",\n\nSELECT COUNT(*) FROM teacher
383,course_teach,SELECT Name FROM teacher ORDER BY Age ASC,List the names of teachers in ascending order ...,"[SELECT, Name, FROM, teacher, ORDER, BY, Age, ...","[select, name, from, teacher, order, by, age, ...","[List, the, names, of, teachers, in, ascending...","""Write a query that answers the following ques...",<strong>SELECT teacher_name FROM teacher ORDE...
384,course_teach,SELECT Name FROM teacher ORDER BY Age ASC,What are the names of the teachers ordered by ...,"[SELECT, Name, FROM, teacher, ORDER, BY, Age, ...","[select, name, from, teacher, order, by, age, ...","[What, are, the, names, of, the, teachers, ord...","""Write a query that answers the following ques...",\n\nSELECT t.name FROM teachers AS t ORDER B...
385,course_teach,"SELECT Age , Hometown FROM teacher",What are the age and hometown of teachers?,"[SELECT, Age, ,, Hometown, FROM, teacher]","[select, age, ,, hometown, from, teacher]","[What, are, the, age, and, hometown, of, teach...","""Write a query that answers the following ques...","\n\nSELECT t.age , t.hometown FROM teachers..."
386,course_teach,"SELECT Age , Hometown FROM teacher",What is the age and hometown of every teacher?,"[SELECT, Age, ,, Hometown, FROM, teacher]","[select, age, ,, hometown, from, teacher]","[What, is, the, age, and, hometown, of, every,...","""Write a query that answers the following ques...","\n\nSELECT t.age , t.hometown FROM teacher AS t"
387,course_teach,"select name from teacher where hometown != ""li...",List the name of teachers whose hometown is no...,"[select, name, from, teacher, where, hometown,...","[select, name, from, teacher, where, hometown,...","[List, the, name, of, teachers, whose, hometow...","""Write a query that answers the following ques...",<strong>SELECT name FROM teacher WHERE hometo...
388,course_teach,"select name from teacher where hometown != ""li...",What are the names of the teachers whose homet...,"[select, name, from, teacher, where, hometown,...","[select, name, from, teacher, where, hometown,...","[What, are, the, names, of, the, teachers, who...","""Write a query that answers the following ques...",\n\nSELECT t.name FROM teachers AS t JOIN te...
389,course_teach,SELECT Name FROM teacher WHERE Age = 32 OR A...,Show the name of teachers aged either 32 or 33?,"[SELECT, Name, FROM, teacher, WHERE, Age, =, 3...","[select, name, from, teacher, where, age, =, v...","[Show, the, name, of, teachers, aged, either, ...","""Write a query that answers the following ques...",\n\nSELECT t.name FROM teachers AS t WHERE ...
390,course_teach,SELECT Name FROM teacher WHERE Age = 32 OR A...,What are the names of the teachers who are age...,"[SELECT, Name, FROM, teacher, WHERE, Age, =, 3...","[select, name, from, teacher, where, age, =, v...","[What, are, the, names, of, the, teachers, who...","""Write a query that answers the following ques...",\n\nSELECT t.name FROM teachers AS t JOIN te...
391,course_teach,SELECT Hometown FROM teacher ORDER BY Age ASC ...,What is the hometown of the youngest teacher?,"[SELECT, Hometown, FROM, teacher, ORDER, BY, A...","[select, hometown, from, teacher, order, by, a...","[What, is, the, hometown, of, the, youngest, t...","""Write a query that answers the following ques...",\n\nSELECT t1.hometown FROM teacher AS t1 JO...
392,course_teach,SELECT Hometown FROM teacher ORDER BY Age ASC ...,Where is the youngest teacher from?,"[SELECT, Hometown, FROM, teacher, ORDER, BY, A...","[select, hometown, from, teacher, order, by, a...","[Where, is, the, youngest, teacher, from, ?]","""Write a query that answers the following ques...",\n\nSELECT t1.name FROM teachers AS t1 JOIN ...
393,course_teach,"SELECT Hometown , COUNT(*) FROM teacher GROUP...",Show different hometown of teachers and the nu...,"[SELECT, Hometown, ,, COUNT, (, *, ), FROM, te...","[select, hometown, ,, count, (, *, ), from, te...","[Show, different, hometown, of, teachers, and,...","""Write a query that answers the following ques...","<strong>SELECT</strong> <em>hometown , count..."
394,course_teach,"SELECT Hometown , COUNT(*) FROM teacher GROUP...","For each hometown, how many teachers are there?","[SELECT, Hometown, ,, COUNT, (, *, ), FROM, te...","[select, hometown, ,, count, (, *, ), from, te...","[For, each, hometown, ,, how, many, teachers, ...","""Write a query that answers the following ques...",\n\nSELECT COUNT(*) FROM teacher
395,course_teach,SELECT Hometown FROM teacher GROUP BY Hometown...,List the most common hometown of teachers.,"[SELECT, Hometown, FROM, teacher, GROUP, BY, H...","[select, hometown, from, teacher, group, by, h...","[List, the, most, common, hometown, of, teache...","""Write a query that answers the following ques...",\n\nSELECT DISTINCT hometown FROM teachers O...
396,course_teach,SELECT Hometown FROM teacher GROUP BY Hometown...,What is the most commmon hometowns for teachers?,"[SELECT, Hometown, FROM, teacher, GROUP, BY, H...","[select, hometown, from, teacher, group, by, h...","[What, is, the, most, commmon, hometowns, for,...","""Write a query that answers the following ques...",\n\nSELECT DISTINCT hometown FROM teachers
397,course_teach,SELECT Hometown FROM teacher GROUP BY Hometown...,Show the hometowns shared by at least two teac...,"[SELECT, Hometown, FROM, teacher, GROUP, BY, H...","[select, hometown, from, teacher, group, by, h...","[Show, the, hometowns, shared, by, at, least, ...","""Write a query that answers the following ques...",<strong>SELECT</strong> t1.hometown <strong...
398,course_teach,SELECT Hometown FROM teacher GROUP BY Hometown...,What are the towns from which at least two tea...,"[SELECT, Hometown, FROM, teacher, GROUP, BY, H...","[select, hometown, from, teacher, group, by, h...","[What, are, the, towns, from, which, at, least...","""Write a query that answers the following ques...",\n\nSELECT t1.town FROM teachers AS t1 JOIN ...
399,course_teach,"SELECT T3.Name , T2.Course FROM course_arrang...",Show names of teachers and the courses they ar...,"[SELECT, T3.Name, ,, T2.Course, FROM, course_a...","[select, t3, ., name, ,, t2, ., course, from, ...","[Show, names, of, teachers, and, the, courses,...","""Write a query that answers the following ques...","<strong>SELECT</strong> t.name , c.name <s..."
400,course_teach,"SELECT T3.Name , T2.Course FROM course_arrang...",What is the name of each teacher and what cour...,"[SELECT, T3.Name, ,, T2.Course, FROM, course_a...","[select, t3, ., name, ,, t2, ., course, from, ...","[What, is, the, name, of, each, teacher, and, ...","""Write a query that answers the following ques...","\n\nSELECT t.name , c.name FROM teacher AS..."
401,course_teach,"SELECT T3.Name , T2.Course FROM course_arrang...",Show names of teachers and the courses they ar...,"[SELECT, T3.Name, ,, T2.Course, FROM, course_a...","[select, t3, ., name, ,, t2, ., course, from, ...","[Show, names, of, teachers, and, the, courses,...","""Write a query that answers the following ques...","<strong>SELECT teacher_name , course_name FRO..."
402,course_teach,"SELECT T3.Name , T2.Course FROM course_arrang...",What are the names of the teachers and the cou...,"[SELECT, T3.Name, ,, T2.Course, FROM, course_a...","[select, t3, ., name, ,, t2, ., course, from, ...","[What, are, the, names, of, the, teachers, and...","""Write a query that answers the following ques...","\n\nSELECT t.name AS teacher_name , c.name ..."
403,course_teach,SELECT T3.Name FROM course_arrange AS T1 JOIN ...,Show the name of the teacher for the math course.,"[SELECT, T3.Name, FROM, course_arrange, AS, T1...","[select, t3, ., name, from, course_arrange, as...","[Show, the, name, of, the, teacher, for, the, ...","""Write a query that answers the following ques...",<strong>SELECT teacher FROM course WHERE cour...
404,course_teach,SELECT T3.Name FROM course_arrange AS T1 JOIN ...,What are the names of the people who teach mat...,"[SELECT, T3.Name, FROM, course_arrange, AS, T1...","[select, t3, ., name, from, course_arrange, as...","[What, are, the, names, of, the, people, who, ...","""Write a query that answers the following ques...",\n\nSELECT t1.name FROM teachers AS t1 JOIN ...
405,course_teach,"SELECT T2.Name , COUNT(*) FROM course_arrange...",Show names of teachers and the number of cours...,"[SELECT, T2.Name, ,, COUNT, (, *, ), FROM, cou...","[select, t2, ., name, ,, count, (, *, ), from,...","[Show, names, of, teachers, and, the, number, ...","""Write a query that answers the following ques...","<strong>SELECT</strong> teacher_name , coun..."
406,course_teach,"SELECT T2.Name , COUNT(*) FROM course_arrange...",What are the names of the teachers and how man...,"[SELECT, T2.Name, ,, COUNT, (, *, ), FROM, cou...","[select, t2, ., name, ,, count, (, *, ), from,...","[What, are, the, names, of, the, teachers, and...","""Write a query that answers the following ques...","\n\nSELECT t.name , COUNT(*) AS course_cou..."
407,course_teach,SELECT T2.Name FROM course_arrange AS T1 JOIN ...,Show names of teachers that teach at least two...,"[SELECT, T2.Name, FROM, course_arrange, AS, T1...","[select, t2, ., name, from, course_arrange, as...","[Show, names, of, teachers, that, teach, at, l...","""Write a query that answers the following ques...",<strong>SELECT teacher_name FROM teacher WHER...
408,course_teach,SELECT T2.Name FROM course_arrange AS T1 JOIN ...,What are the names of the teachers who teach a...,"[SELECT, T2.Name, FROM, course_arrange, AS, T1...","[select, t2, ., name, from, course_arrange, as...","[What, are, the, names, of, the, teachers, who...","""Write a query that answers the following ques...",\n\nSELECT t.name FROM teachers AS t JOIN co...
409,course_teach,SELECT Name FROM teacher WHERE Teacher_id NOT ...,List the names of teachers who have not been a...,"[SELECT, Name, FROM, teacher, WHERE, Teacher_i...","[select, name, from, teacher, where, teacher_i...","[List, the, names, of, teachers, who, have, no...","""Write a query that answers the following ques...",\n\nSELECT t.name FROM teachers AS t JOIN co...
410,course_teach,SELECT Name FROM teacher WHERE Teacher_id NOT ...,What are the names of the teachers whose cours...,"[SELECT, Name, FROM, teacher, WHERE, Teacher_i...","[select, name, from, teacher, where, teacher_i...","[What, are, the, names, of, the, teachers, who...","""Write a query that answers the following ques...",\n\nSELECT t.name FROM teachers AS t JOIN co...
411,museum_visit,SELECT count(*) FROM visitor WHERE age < 30,How many visitors below age 30 are there?,"[SELECT, count, (, *, ), FROM, visitor, WHERE,...","[select, count, (, *, ), from, visitor, where,...","[How, many, visitors, below, age, 30, are, the...","""Write a query that answers the following ques...",\n\nSELECT COUNT(*) FROM visitors WHERE age < 30
412,museum_visit,SELECT name FROM visitor WHERE Level_of_member...,Find the names of the visitors whose membershi...,"[SELECT, name, FROM, visitor, WHERE, Level_of_...","[select, name, from, visitor, where, level_of_...","[Find, the, names, of, the, visitors, whose, m...","""Write a query that answers the following ques...",<strong>SELECT</strong> name <strong>FROM</...
413,museum_visit,SELECT avg(age) FROM visitor WHERE Level_of_me...,What is the average age of the visitors whose ...,"[SELECT, avg, (, age, ), FROM, visitor, WHERE,...","[select, avg, (, age, ), from, visitor, where,...","[What, is, the, average, age, of, the, visitor...","""Write a query that answers the following ques...",\n\nSELECT AVG(age) FROM visitor WHERE mem...
414,museum_visit,"SELECT name , Level_of_membership FROM visito...",Find the name and membership level of the visi...,"[SELECT, name, ,, Level_of_membership, FROM, v...","[select, name, ,, level_of_membership, from, v...","[Find, the, name, and, membership, level, of, ...","""Write a query that answers the following ques...","<strong>SELECT</strong> visitor_name , visi..."
415,museum_visit,"SELECT museum_id , name FROM museum ORDER BY ...",Find the id and name of the museum that has th...,"[SELECT, museum_id, ,, name, FROM, museum, ORD...","[select, museum_id, ,, name, from, museum, ord...","[Find, the, id, and, name, of, the, museum, th...","""Write a query that answers the following ques...","\n\nSELECT museum_id , museum_name FROM mu..."

====================================================================================================
(52, 7)
Input:  ['"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Find the average number of staff working for the museums that were open before 2009. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the opening year and staff number of the museum named Plaza Museum? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> find the names of museums which have more staff than the minimum staff number of all museums opened after 2010. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> find the id, name and age for visitors who visited some museums more than once. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the id, name and membership level of visitors who have spent the largest amount of money in total in all museum tickets? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the id and name of the museum visited most times? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the name of the museum that had no visitor yet? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Find the name and age of the visitor who bought the most tickets at once. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the average and maximum number of tickets bought in all visits? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the total ticket expense of the visitors whose membership level is 1? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the name of the visitor who visited both a museum opened before 2009 and a museum opened after 2011? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Find the number of visitors who did not visit any museum opened after 2010. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> How many museums were opened after 2013 or before 2008? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Find the total number of players. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> How many players are there? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Find the total number of matches. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Count the number of matches. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> List the first name and birth date of all players from the country with code USA. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the first names and birth dates of players from the USA? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Find the average age of losers and winners of all matches. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the average ages of losers and winners across matches? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Find the average rank of winners in all matches. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the average rank for winners in all matches? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Find the highest rank of losers in all matches. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the best rank of losers across all matches? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> find the number of distinct country codes of all players. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> How many distinct countries do players come from? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Find the number of distinct name of losers. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> How many different loser names are there? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Find the name of tourney that has more than 10 matches. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the names of tournaments that have more than 10 matches? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> List the names of all winners who played in both 2013 and 2016. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the names of players who won in both 2013 and 2016? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> List the number of all matches who played in years of 2013 or 2016. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> How many matches were played in 2013 or 2016? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the country code and first name of the players who won in both tourney WTA Championships and Australian Open? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the first names and country codes for players who won both the WTA Championships and the Australian Open? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Find the first name and country code of the oldest player. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the first name and country code of the oldest player? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> List the first and last name of all players in the order of birth date. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the full names of all players, sorted by birth date? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> List the first and last name of all players who are left / L hand in the order of birth date. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the full names of all left handed players, in order of birth date? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Find the first name and country code of the player who did the most number of tours. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the first name and country code of the player with the most tours? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Find the year that has the most number of matches. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Which year had the most matches? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Find the name and rank points of the winner who won the most times. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the name of the winner who has won the most matches, and how many rank points does this player have? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Find the name of the winner who has the highest rank points and participated in the Australian Open tourney. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the name of the winner with the most rank points who participated in the Australian Open tournament? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> find the names of loser and winner who played in the match with greatest number of minutes. <query> ']
Original query:
SELECT avg(num_of_staff) FROM museum WHERE open_year  <  2009
Generated query:


SELECT  AVG(staff_count) FROM museum WHERE open_before_year = 2009<eos>
____________________________________________________________________________________________________
Original query:
SELECT Num_of_Staff ,  Open_Year FROM museum WHERE name  =  'Plaza Museum'
Generated query:


SELECT  opening_year , staff_number FROM museum WHERE museum_name  =  'Plaza Museum'<eos>
____________________________________________________________________________________________________
Original query:
SELECT name FROM museum WHERE num_of_staff  >  (SELECT min(num_of_staff) FROM museum WHERE open_year  >  2010)
Generated query:


SELECT  museum_name FROM museum WHERE staff_count > SELECT  MAX(staff_count) FROM museum WHERE opened_after_2010<eos>
____________________________________________________________________________________________________
Original query:
SELECT t1.id ,  t1.name ,  t1.age FROM visitor AS t1 JOIN visit AS t2 ON t1.id  =  t2.visitor_id GROUP BY t1.id HAVING count(*)  >  1
Generated query:
 <strong>SELECT</strong>  visitor_id ,  visitor_name ,  visitor_age  <strong>FROM</strong>  visitor  <strong>WHERE</strong>  visitor_visit_count >  1<eos>
____________________________________________________________________________________________________
Original query:
SELECT t2.visitor_id ,  t1.name ,  t1.Level_of_membership FROM visitor AS t1 JOIN visit AS t2 ON t1.id  =  t2.visitor_id GROUP BY t2.visitor_id ORDER BY sum(t2.Total_spent) DESC LIMIT 1
Generated query:


SELECT  t.id ,  t.name ,  t.membership_level FROM  ticket AS t JOIN visitor AS v ON t.visitor_id  =  v.id GROUP BY  t.id ,  t.name ,  t.membership_level ORDER BY  sum(t.total_price) DESC LIMIT 1<eos>
____________________________________________________________________________________________________
Original query:
SELECT t2.Museum_ID ,  t1.name FROM museum AS t1 JOIN visit AS t2 ON t1.Museum_ID  =  t2.Museum_ID GROUP BY t2.Museum_ID ORDER BY count(*) DESC LIMIT 1
Generated query:


SELECT  museum_id ,  museum_name FROM  museum  GROUP BY  museum_id  ORDER BY  count(*) DESC LIMIT 1<eos>
____________________________________________________________________________________________________
Original query:
SELECT name FROM museum WHERE Museum_ID NOT IN (SELECT museum_id FROM visit)
Generated query:


SELECT  museum_name FROM museum WHERE visitor_count = 0<eos>
____________________________________________________________________________________________________
Original query:
SELECT t1.name ,  t1.age FROM visitor AS t1 JOIN visit AS t2 ON t1.id  =  t2.visitor_id ORDER BY t2.num_of_ticket DESC LIMIT 1
Generated query:


SELECT  visitor_name ,  visitor_age  FROM  visitor  GROUP BY  visitor_name  ORDER BY  visitor_age  DESC LIMIT  1<eos>
____________________________________________________________________________________________________
Original query:
SELECT avg(num_of_ticket) ,  max(num_of_ticket) FROM visit
Generated query:


SELECT  AVG(tickets_bought) , MAX(tickets_bought) FROM visits<eos>
____________________________________________________________________________________________________
Original query:
SELECT sum(t2.Total_spent) FROM visitor AS t1 JOIN visit AS t2 ON t1.id  =  t2.visitor_id WHERE t1.Level_of_membership  =  1
Generated query:


SELECT SUM(ticket_expense) FROM ticket WHERE membership_level = 1<eos>
____________________________________________________________________________________________________
Original query:
SELECT t1.name FROM visitor AS t1 JOIN visit AS t2 ON t1.id  =  t2.visitor_id JOIN museum AS t3 ON t3.Museum_ID  =  t2.Museum_ID WHERE t3.open_year  <  2009 INTERSECT SELECT t1.name FROM visitor AS t1 JOIN visit AS t2 ON t1.id  =  t2.visitor_id JOIN museum AS t3 ON t3.Museum_ID  =  t2.Museum_ID WHERE t3.open_year  >  2011
Generated query:


SELECT  visitor_name FROM  visitor WHERE  visit_date  BETWEEN  "2009-01-01" AND  "2011-12-31"<eos>
____________________________________________________________________________________________________
Original query:
SELECT count(*) FROM visitor WHERE id NOT IN (SELECT t2.visitor_id FROM museum AS t1 JOIN visit AS t2 ON t1.Museum_ID  =  t2.Museum_ID WHERE t1.open_year  >  2010)
Generated query:


SELECT COUNT(*) FROM Visitor WHERE NOT EXISTS ( SELECT * FROM Museum WHERE Museum.museum_id = Visitor.museum_id AND Museum.museum_open_date > 2010 )<eos>
____________________________________________________________________________________________________
Original query:
SELECT count(*) FROM museum WHERE open_year  >  2013 OR open_year  <  2008
Generated query:


SELECT count(*) FROM museum WHERE year > 2008 OR year < 2013<eos>
____________________________________________________________________________________________________
Original query:
SELECT count(*) FROM players
Generated query:


SELECT SUM(player_count) FROM player<eos>
____________________________________________________________________________________________________
Original query:
SELECT count(*) FROM players
Generated query:


SELECT COUNT(*) FROM player<eos>
____________________________________________________________________________________________________
Original query:
SELECT count(*) FROM matches
Generated query:


SELECT COUNT(*) FROM Match<eos>
____________________________________________________________________________________________________
Original query:
SELECT count(*) FROM matches
Generated query:


SELECT COUNT(*) FROM  match<eos>
____________________________________________________________________________________________________
Original query:
SELECT first_name ,  birth_date FROM players WHERE country_code  =  'USA'
Generated query:


SELECT  firstname , birth_date FROM players WHERE country_code = 'USA'<eos>
____________________________________________________________________________________________________
Original query:
SELECT first_name ,  birth_date FROM players WHERE country_code  =  'USA'
Generated query:


SELECT  firstname , birth_date FROM players WHERE country_code = 'USA'<eos>
____________________________________________________________________________________________________
Original query:
SELECT avg(loser_age) ,  avg(winner_age) FROM matches
Generated query:


SELECT AVG(age) FROM match WHERE winner = 'loser'<eos>
____________________________________________________________________________________________________
Original query:
SELECT avg(loser_age) ,  avg(winner_age) FROM matches
Generated query:


SELECT avg(winner_age) , avg(loser_age) FROM matches<eos>
____________________________________________________________________________________________________
Original query:
SELECT avg(winner_rank) FROM matches
Generated query:


SELECT  AVG(rank) FROM  match<eos>
____________________________________________________________________________________________________
Original query:
SELECT avg(winner_rank) FROM matches
Generated query:


SELECT  AVG(rank) FROM matches<eos>
____________________________________________________________________________________________________
Original query:
SELECT min(loser_rank) FROM matches
Generated query:


SELECT MAX(rank) FROM matches<eos>
____________________________________________________________________________________________________
Original query:
SELECT min(loser_rank) FROM matches
Generated query:


SELECT  RANK() OVER (ORDER BY  total_points DESC) AS rank FROM  matches<eos>
____________________________________________________________________________________________________
Original query:
SELECT count(DISTINCT country_code) FROM players
Generated query:


SELECT DISTINCT country_code FROM player<eos>
____________________________________________________________________________________________________
Original query:
SELECT count(DISTINCT country_code) FROM players
Generated query:


SELECT DISTINCT country FROM players<eos>
____________________________________________________________________________________________________
Original query:
SELECT count(DISTINCT loser_name) FROM matches
Generated query:


SELECT COUNT(DISTINCT name) FROM  winner<eos>
____________________________________________________________________________________________________
Original query:
SELECT count(DISTINCT loser_name) FROM matches
Generated query:


SELECT DISTINCT loser_name FROM matches<eos>
____________________________________________________________________________________________________
Original query:
SELECT tourney_name FROM matches GROUP BY tourney_name HAVING count(*)  >  10
Generated query:
 <strong>SELECT Tourney_Name FROM Tourney WHERE Match_Count > 10</strong><eos>
____________________________________________________________________________________________________
Original query:
SELECT tourney_name FROM matches GROUP BY tourney_name HAVING count(*)  >  10
Generated query:


SELECT  tournament_name FROM tournaments WHERE  MATCH_COUNT > 10<eos>
____________________________________________________________________________________________________
Original query:
SELECT winner_name FROM matches WHERE YEAR  =  2013 INTERSECT SELECT winner_name FROM matches WHERE YEAR  =  2016
Generated query:
 <strong>SELECT</strong>  winner_name  <strong>FROM</strong>  winner  <strong>WHERE</strong>  winner_year  =  2013  AND  winner_year  =  2016<eos>

,db_id,query,question,query_toks,query_toks_no_value,question_toks,modified question,generated_query
416,museum_visit,SELECT avg(num_of_staff) FROM museum WHERE ope...,Find the average number of staff working for t...,"[SELECT, avg, (, num_of_staff, ), FROM, museum...","[select, avg, (, num_of_staff, ), from, museum...","[Find, the, average, number, of, staff, workin...","""Write a query that answers the following ques...",\n\nSELECT AVG(staff_count) FROM museum WHER...
417,museum_visit,"SELECT Num_of_Staff , Open_Year FROM museum W...",What are the opening year and staff number of ...,"[SELECT, Num_of_Staff, ,, Open_Year, FROM, mus...","[select, num_of_staff, ,, open_year, from, mus...","[What, are, the, opening, year, and, staff, nu...","""Write a query that answers the following ques...","\n\nSELECT opening_year , staff_number FROM ..."
418,museum_visit,SELECT name FROM museum WHERE num_of_staff > ...,find the names of museums which have more staf...,"[SELECT, name, FROM, museum, WHERE, num_of_sta...","[select, name, from, museum, where, num_of_sta...","[find, the, names, of, museums, which, have, m...","""Write a query that answers the following ques...",\n\nSELECT museum_name FROM museum WHERE sta...
419,museum_visit,"SELECT t1.id , t1.name , t1.age FROM visitor...","find the id, name and age for visitors who vis...","[SELECT, t1.id, ,, t1.name, ,, t1.age, FROM, v...","[select, t1, ., id, ,, t1, ., name, ,, t1, ., ...","[find, the, id, ,, name, and, age, for, visito...","""Write a query that answers the following ques...","<strong>SELECT</strong> visitor_id , visito..."
420,museum_visit,"SELECT t2.visitor_id , t1.name , t1.Level_of...","What are the id, name and membership level of ...","[SELECT, t2.visitor_id, ,, t1.name, ,, t1.Leve...","[select, t2, ., visitor_id, ,, t1, ., name, ,,...","[What, are, the, id, ,, name, and, membership,...","""Write a query that answers the following ques...","\n\nSELECT t.id , t.name , t.membership_le..."
421,museum_visit,"SELECT t2.Museum_ID , t1.name FROM museum AS ...",What are the id and name of the museum visited...,"[SELECT, t2.Museum_ID, ,, t1.name, FROM, museu...","[select, t2, ., museum_id, ,, t1, ., name, fro...","[What, are, the, id, and, name, of, the, museu...","""Write a query that answers the following ques...","\n\nSELECT museum_id , museum_name FROM mu..."
422,museum_visit,SELECT name FROM museum WHERE Museum_ID NOT IN...,What is the name of the museum that had no vis...,"[SELECT, name, FROM, museum, WHERE, Museum_ID,...","[select, name, from, museum, where, museum_id,...","[What, is, the, name, of, the, museum, that, h...","""Write a query that answers the following ques...",\n\nSELECT museum_name FROM museum WHERE vis...
423,museum_visit,"SELECT t1.name , t1.age FROM visitor AS t1 JO...",Find the name and age of the visitor who bough...,"[SELECT, t1.name, ,, t1.age, FROM, visitor, AS...","[select, t1, ., name, ,, t1, ., age, from, vis...","[Find, the, name, and, age, of, the, visitor, ...","""Write a query that answers the following ques...","\n\nSELECT visitor_name , visitor_age FROM..."
424,museum_visit,"SELECT avg(num_of_ticket) , max(num_of_ticket...",What are the average and maximum number of tic...,"[SELECT, avg, (, num_of_ticket, ), ,, max, (, ...","[select, avg, (, num_of_ticket, ), ,, max, (, ...","[What, are, the, average, and, maximum, number...","""Write a query that answers the following ques...","\n\nSELECT AVG(tickets_bought) , MAX(tickets..."
425,museum_visit,SELECT sum(t2.Total_spent) FROM visitor AS t1 ...,What is the total ticket expense of the visito...,"[SELECT, sum, (, t2.Total_spent, ), FROM, visi...","[select, sum, (, t2, ., total_spent, ), from, ...","[What, is, the, total, ticket, expense, of, th...","""Write a query that answers the following ques...",\n\nSELECT SUM(ticket_expense) FROM ticket WH...
426,museum_visit,SELECT t1.name FROM visitor AS t1 JOIN visit A...,What is the name of the visitor who visited bo...,"[SELECT, t1.name, FROM, visitor, AS, t1, JOIN,...","[select, t1, ., name, from, visitor, as, t1, j...","[What, is, the, name, of, the, visitor, who, v...","""Write a query that answers the following ques...",\n\nSELECT visitor_name FROM visitor WHERE ...
427,museum_visit,SELECT count(*) FROM visitor WHERE id NOT IN (...,Find the number of visitors who did not visit ...,"[SELECT, count, (, *, ), FROM, visitor, WHERE,...","[select, count, (, *, ), from, visitor, where,...","[Find, the, number, of, visitors, who, did, no...","""Write a query that answers the following ques...",\n\nSELECT COUNT(*) FROM Visitor WHERE NOT EX...
428,museum_visit,SELECT count(*) FROM museum WHERE open_year >...,How many museums were opened after 2013 or bef...,"[SELECT, count, (, *, ), FROM, museum, WHERE, ...","[select, count, (, *, ), from, museum, where, ...","[How, many, museums, were, opened, after, 2013...","""Write a query that answers the following ques...",\n\nSELECT count(*) FROM museum WHERE year > ...
429,wta_1,SELECT count(*) FROM players,Find the total number of players.,"[SELECT, count, (, *, ), FROM, players]","[select, count, (, *, ), from, players]","[Find, the, total, number, of, players, .]","""Write a query that answers the following ques...",\n\nSELECT SUM(player_count) FROM player
430,wta_1,SELECT count(*) FROM players,How many players are there?,"[SELECT, count, (, *, ), FROM, players]","[select, count, (, *, ), from, players]","[How, many, players, are, there, ?]","""Write a query that answers the following ques...",\n\nSELECT COUNT(*) FROM player
431,wta_1,SELECT count(*) FROM matches,Find the total number of matches.,"[SELECT, count, (, *, ), FROM, matches]","[select, count, (, *, ), from, matches]","[Find, the, total, number, of, matches, .]","""Write a query that answers the following ques...",\n\nSELECT COUNT(*) FROM Match
432,wta_1,SELECT count(*) FROM matches,Count the number of matches.,"[SELECT, count, (, *, ), FROM, matches]","[select, count, (, *, ), from, matches]","[Count, the, number, of, matches, .]","""Write a query that answers the following ques...",\n\nSELECT COUNT(*) FROM match
433,wta_1,"SELECT first_name , birth_date FROM players W...",List the first name and birth date of all play...,"[SELECT, first_name, ,, birth_date, FROM, play...","[select, first_name, ,, birth_date, from, play...","[List, the, first, name, and, birth, date, of,...","""Write a query that answers the following ques...","\n\nSELECT firstname , birth_date FROM playe..."
434,wta_1,"SELECT first_name , birth_date FROM players W...",What are the first names and birth dates of pl...,"[SELECT, first_name, ,, birth_date, FROM, play...","[select, first_name, ,, birth_date, from, play...","[What, are, the, first, names, and, birth, dat...","""Write a query that answers the following ques...","\n\nSELECT firstname , birth_date FROM playe..."
435,wta_1,"SELECT avg(loser_age) , avg(winner_age) FROM ...",Find the average age of losers and winners of ...,"[SELECT, avg, (, loser_age, ), ,, avg, (, winn...","[select, avg, (, loser_age, ), ,, avg, (, winn...","[Find, the, average, age, of, losers, and, win...","""Write a query that answers the following ques...",\n\nSELECT AVG(age) FROM match WHERE winner =...
436,wta_1,"SELECT avg(loser_age) , avg(winner_age) FROM ...",What are the average ages of losers and winner...,"[SELECT, avg, (, loser_age, ), ,, avg, (, winn...","[select, avg, (, loser_age, ), ,, avg, (, winn...","[What, are, the, average, ages, of, losers, an...","""Write a query that answers the following ques...","\n\nSELECT avg(winner_age) , avg(loser_age) F..."
437,wta_1,SELECT avg(winner_rank) FROM matches,Find the average rank of winners in all matches.,"[SELECT, avg, (, winner_rank, ), FROM, matches]","[select, avg, (, winner_rank, ), from, matches]","[Find, the, average, rank, of, winners, in, al...","""Write a query that answers the following ques...",\n\nSELECT AVG(rank) FROM match
438,wta_1,SELECT avg(winner_rank) FROM matches,What is the average rank for winners in all ma...,"[SELECT, avg, (, winner_rank, ), FROM, matches]","[select, avg, (, winner_rank, ), from, matches]","[What, is, the, average, rank, for, winners, i...","""Write a query that answers the following ques...",\n\nSELECT AVG(rank) FROM matches
439,wta_1,SELECT min(loser_rank) FROM matches,Find the highest rank of losers in all matches.,"[SELECT, min, (, loser_rank, ), FROM, matches]","[select, min, (, loser_rank, ), from, matches]","[Find, the, highest, rank, of, losers, in, all...","""Write a query that answers the following ques...",\n\nSELECT MAX(rank) FROM matches
440,wta_1,SELECT min(loser_rank) FROM matches,What is the best rank of losers across all mat...,"[SELECT, min, (, loser_rank, ), FROM, matches]","[select, min, (, loser_rank, ), from, matches]","[What, is, the, best, rank, of, losers, across...","""Write a query that answers the following ques...",\n\nSELECT RANK() OVER (ORDER BY total_poin...
441,wta_1,SELECT count(DISTINCT country_code) FROM players,find the number of distinct country codes of a...,"[SELECT, count, (, DISTINCT, country_code, ), ...","[select, count, (, distinct, country_code, ), ...","[find, the, number, of, distinct, country, cod...","""Write a query that answers the following ques...",\n\nSELECT DISTINCT country_code FROM player
442,wta_1,SELECT count(DISTINCT country_code) FROM players,How many distinct countries do players come from?,"[SELECT, count, (, DISTINCT, country_code, ), ...","[select, count, (, distinct, country_code, ), ...","[How, many, distinct, countries, do, players, ...","""Write a query that answers the following ques...",\n\nSELECT DISTINCT country FROM players
443,wta_1,SELECT count(DISTINCT loser_name) FROM matches,Find the number of distinct name of losers.,"[SELECT, count, (, DISTINCT, loser_name, ), FR...","[select, count, (, distinct, loser_name, ), fr...","[Find, the, number, of, distinct, name, of, lo...","""Write a query that answers the following ques...",\n\nSELECT COUNT(DISTINCT name) FROM winner
444,wta_1,SELECT count(DISTINCT loser_name) FROM matches,How many different loser names are there?,"[SELECT, count, (, DISTINCT, loser_name, ), FR...","[select, count, (, distinct, loser_name, ), fr...","[How, many, different, loser, names, are, ther...","""Write a query that answers the following ques...",\n\nSELECT DISTINCT loser_name FROM matches
445,wta_1,SELECT tourney_name FROM matches GROUP BY tour...,Find the name of tourney that has more than 10...,"[SELECT, tourney_name, FROM, matches, GROUP, B...","[select, tourney_name, from, matches, group, b...","[Find, the, name, of, tourney, that, has, more...","""Write a query that answers the following ques...",<strong>SELECT Tourney_Name FROM Tourney WHER...
446,wta_1,SELECT tourney_name FROM matches GROUP BY tour...,What are the names of tournaments that have mo...,"[SELECT, tourney_name, FROM, matches, GROUP, B...","[select, tourney_name, from, matches, group, b...","[What, are, the, names, of, tournaments, that,...","""Write a query that answers the following ques...",\n\nSELECT tournament_name FROM tournaments ...
447,wta_1,SELECT winner_name FROM matches WHERE YEAR = ...,List the names of all winners who played in bo...,"[SELECT, winner_name, FROM, matches, WHERE, YE...","[select, winner_name, from, matches, where, ye...","[List, the, names, of, all, winners, who, play...","""Write a query that answers the following ques...",<strong>SELECT</strong> winner_name <strong...
448,wta_1,SELECT winner_name FROM matches WHERE YEAR = ...,What are the names of players who won in both ...,"[SELECT, winner_name, FROM, matches, WHERE, YE...","[select, winner_name, from, matches, where, ye...","[What, are, the, names, of, players, who, won,...","""Write a query that answers the following ques...",\n\nSELECT player_name FROM player WHERE yea...
449,wta_1,SELECT count(*) FROM matches WHERE YEAR = 20...,List the number of all matches who played in y...,"[SELECT, count, (, *, ), FROM, matches, WHERE,...","[select, count, (, *, ), from, matches, where,...","[List, the, number, of, all, matches, who, pla...","""Write a query that answers the following ques...",\n\nSELECT COUNT(*) FROM matches WHERE year =...
450,wta_1,SELECT count(*) FROM matches WHERE YEAR = 20...,How many matches were played in 2013 or 2016?,"[SELECT, count, (, *, ), FROM, matches, WHERE,...","[select, count, (, *, ), from, matches, where,...","[How, many, matches, were, played, in, 2013, o...","""Write a query that answers the following ques...",\n\nSELECT COUNT(*) FROM matches WHERE year =...
451,wta_1,"SELECT T1.country_code , T1.first_name FROM p...",What are the country code and first name of th...,"[SELECT, T1.country_code, ,, T1.first_name, FR...","[select, t1, ., country_code, ,, t1, ., first_...","[What, are, the, country, code, and, first, na...","""Write a query that answers the following ques...","\n\nSELECT country_code , first_name FROM ..."
452,wta_1,"SELECT T1.country_code , T1.first_name FROM p...",What are the first names and country codes for...,"[SELECT, T1.country_code, ,, T1.first_name, FR...","[select, t1, ., country_code, ,, t1, ., first_...","[What, are, the, first, names, and, country, c...","""Write a query that answers the following ques...","\n\nSELECT firstname , country_code FROM ..."
453,wta_1,"SELECT first_name , country_code FROM players...",Find the first name and country code of the ol...,"[SELECT, first_name, ,, country_code, FROM, pl...","[select, first_name, ,, country_code, from, pl...","[Find, the, first, name, and, country, code, o...","""Write a query that answers the following ques...","<strong>SELECT first_name , country_code FROM..."
454,wta_1,"SELECT first_name , country_code FROM players...",What is the first name and country code of the...,"[SELECT, first_name, ,, country_code, FROM, pl...","[select, first_name, ,, country_code, from, pl...","[What, is, the, first, name, and, country, cod...","""Write a query that answers the following ques...","\n\nSELECT firstname , country_code FROM ..."
455,wta_1,"SELECT first_name , last_name FROM players OR...",List the first and last name of all players in...,"[SELECT, first_name, ,, last_name, FROM, playe...","[select, first_name, ,, last_name, from, playe...","[List, the, first, and, last, name, of, all, p...","""Write a query that answers the following ques...","<strong>SELECT first_name , last_name FROM pl..."
456,wta_1,"SELECT first_name , last_name FROM players OR...","What are the full names of all players, sorted...","[SELECT, first_name, ,, last_name, FROM, playe...","[select, first_name, ,, last_name, from, playe...","[What, are, the, full, names, of, all, players...","""Write a query that answers the following ques...",\n\nSELECT player_name FROM players ORDER BY...
457,wta_1,"SELECT first_name , last_name FROM players WH...",List the first and last name of all players wh...,"[SELECT, first_name, ,, last_name, FROM, playe...","[select, first_name, ,, last_name, from, playe...","[List, the, first, and, last, name, of, all, p...","""Write a query that answers the following ques...","\n\nSELECT firstname , lastname FROM players..."
458,wta_1,"SELECT first_name , last_name FROM players WH...",What are the full names of all left handed pla...,"[SELECT, first_name, ,, last_name, FROM, playe...","[select, first_name, ,, last_name, from, playe...","[What, are, the, full, names, of, all, left, h...","""Write a query that answers the following ques...",\n\nSELECT LEFT_HANDED_PLAYER_FULL_NAME FROM...
459,wta_1,"SELECT T1.country_code , T1.first_name FROM p...",Find the first name and country code of the pl...,"[SELECT, T1.country_code, ,, T1.first_name, FR...","[select, t1, ., country_code, ,, t1, ., first_...","[Find, the, first, name, and, country, code, o...","""Write a query that answers the following ques...","\n\nSELECT firstname , country_code FROM ..."
460,wta_1,"SELECT T1.country_code , T1.first_name FROM p...",What is the first name and country code of the...,"[SELECT, T1.country_code, ,, T1.first_name, FR...","[select, t1, ., country_code, ,, t1, ., first_...","[What, is, the, first, name, and, country, cod...","""Write a query that answers the following ques...","\n\nSELECT firstname , country_code FROM ..."
461,wta_1,SELECT YEAR FROM matches GROUP BY YEAR ORDER B...,Find the year that has the most number of matc...,"[SELECT, YEAR, FROM, matches, GROUP, BY, YEAR,...","[select, year, from, matches, group, by, year,...","[Find, the, year, that, has, the, most, number...","""Write a query that answers the following ques...",\n\nSELECT year FROM matches GROUP BY year ...
462,wta_1,SELECT YEAR FROM matches GROUP BY YEAR ORDER B...,Which year had the most matches?,"[SELECT, YEAR, FROM, matches, GROUP, BY, YEAR,...","[select, year, from, matches, group, by, year,...","[Which, year, had, the, most, matches, ?]","""Write a query that answers the following ques...",\n\nSELECT year FROM matches GROUP BY year O...
463,wta_1,"SELECT winner_name , winner_rank_points FROM ...",Find the name and rank points of the winner wh...,"[SELECT, winner_name, ,, winner_rank_points, F...","[select, winner_name, ,, winner_rank_points, f...","[Find, the, name, and, rank, points, of, the, ...","""Write a query that answers the following ques...","\n\nSELECT winner_name , winner_rank_points..."
464,wta_1,"SELECT winner_name , winner_rank_points FROM ...",What is the name of the winner who has won the...,"[SELECT, winner_name, ,, winner_rank_points, F...","[select, winner_name, ,, winner_rank_points, f...","[What, is, the, name, of, the, winner, who, ha...","""Write a query that answers the following ques...","\n\nSELECT winner_name , rank_points FROM ..."
465,wta_1,SELECT winner_name FROM matches WHERE tourney_...,Find the name of the winner who has the highes...,"[SELECT, winner_name, FROM, matches, WHERE, to...","[select, winner_name, from, matches, where, to...","[Find, the, name, of, the, winner, who, has, t...","""Write a query that answers the following ques...",<strong>SELECT winner_name FROM tournament ...
466,wta_1,SELECT winner_name FROM matches WHERE tourney_...,What is the name of the winner with the most r...,"[SELECT, winner_name, FROM, matches, WHERE, to...","[select, winner_name, from, matches, where, to...","[What, is, the, name, of, the, winner, with, t...","""Write a query that answers the following ques...",\n\nSELECT winner_name FROM tournament WHER...
467,wta_1,"SELECT winner_name , loser_name FROM matches ...",find the names of loser and winner who played ...,"[SELECT, winner_name, ,, loser_name, FROM, mat...","[select, winner_name, ,, loser_name, from, mat...","[find, the, names, of, loser, and, winner, who...","""Write a query that answers the following ques...","\n\nSELECT winner , loser FROM match WHERE ..."

====================================================================================================
(52, 7)
Input:  ['"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the names of the winner and loser who played in the longest match? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Find the average ranking for each player and their first name. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the first names of all players, and their average rankings? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Find the total ranking points for each player and their first name. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the first names of all players, and their total ranking points? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> find the number of players for each country. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> How many players are from each country? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> find the code of the country where has the greatest number of players. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the code of the country with the most players? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Find the codes of countries that have more than 50 players. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the codes of countries with more than 50 players? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Find the total number of tours for each ranking date. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> How many total tours were there for each ranking date? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Find the number of matches happened in each year. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> How many matches were played in each year? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Find the name and rank of the 3 youngest winners across all matches. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the names and ranks of the three youngest winners across all matches? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> How many different winners both participated in the WTA Championships and were left handed? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Find the number of left handed winners who participated in the WTA Championships. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Find the first name, country code and birth date of the winner who has the highest rank points in all matches. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the first name, country code, and birth date of the player with the most winner rank points across all matches? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Find the number of players for each hand type. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> How many players are there for each hand type? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> How many ships ended up being \'Captured\'? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> List the name and tonnage ordered by in descending alphaetical order for the names. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> List the name, date and result of each battle. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is maximum and minimum death toll caused each time? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the average number of injuries caused each time? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the death and injury situations caused by the ship with tonnage \'t\'? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the name and results of the battles when the bulgarian commander is not \'Boril\' <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the different ids and names of the battles that lost any \'Brig\' type shipes? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the ids and names of the battles that led to more than 10 people killed in total. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the ship id and name that caused most total injuries? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the distinct battle names which are between bulgarian commander \'Kaloyan\' and latin commander \'Baldwin I\'? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> How many different results are there for the battles? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> How many battles did not lose any ship with tonnage \'225\'? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> List the name and date the battle that has lost the ship named \'Lettice\' and the ship named \'HMS Atalanta\' <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Show names, results and bulgarian commanders of the battles with no ships lost in the \'English Channel\'. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the notes of the death events which has substring \'East\'? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> what are all the addresses including line 1 and line 2? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the first and second line for all addresses? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> How many courses in total are listed? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> How many courses are there? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> How is the math course described? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the descriptions for all the math courses? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the zip code of the address in the city Port Chelsea? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the zip code for Port Chelsea? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Which department offers the most number of degrees? List department name and id. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the name and id of the department with the most number of degrees ? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> How many departments offer any degree? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> How many different departments offer degrees? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> How many different degree names are offered? <query> ']
Original query:
SELECT winner_name ,  loser_name FROM matches ORDER BY minutes DESC LIMIT 1
Generated query:


SELECT  winner , loser FROM matches ORDER BY match_length DESC LIMIT 1<eos>
____________________________________________________________________________________________________
Original query:
SELECT avg(ranking) ,  T1.first_name FROM players AS T1 JOIN rankings AS T2 ON T1.player_id  =  T2.player_id GROUP BY T1.first_name
Generated query:


SELECT  AVG(ranking) ,  first_name FROM  player GROUP BY  first_name<eos>
____________________________________________________________________________________________________
Original query:
SELECT avg(ranking) ,  T1.first_name FROM players AS T1 JOIN rankings AS T2 ON T1.player_id  =  T2.player_id GROUP BY T1.first_name
Generated query:


SELECT  firstname ,  avg_rank  FROM  player  GROUP BY  firstname<eos>
____________________________________________________________________________________________________
Original query:
SELECT sum(ranking_points) ,  T1.first_name FROM players AS T1 JOIN rankings AS T2 ON T1.player_id  =  T2.player_id GROUP BY T1.first_name
Generated query:


SELECT  player_name ,  SUM(ranking_points) AS total_ranking_points FROM  player GROUP BY player_name<eos>
____________________________________________________________________________________________________
Original query:
SELECT sum(ranking_points) ,  T1.first_name FROM players AS T1 JOIN rankings AS T2 ON T1.player_id  =  T2.player_id GROUP BY T1.first_name
Generated query:


SELECT  firstname ,  ranking_points  FROM  players  GROUP BY  firstname<eos>
____________________________________________________________________________________________________
Original query:
SELECT count(*) ,  country_code FROM players GROUP BY country_code
Generated query:


SELECT COUNT(*) FROM player GROUP BY country<eos>
____________________________________________________________________________________________________
Original query:
SELECT count(*) ,  country_code FROM players GROUP BY country_code
Generated query:


SELECT country FROM players GROUP BY country<eos>
____________________________________________________________________________________________________
Original query:
SELECT country_code FROM players GROUP BY country_code ORDER BY count(*) DESC LIMIT 1
Generated query:


SELECT Country_code FROM Player GROUP BY Country_code ORDER BY COUNT(*) DESC LIMIT 1<eos>
____________________________________________________________________________________________________
Original query:
SELECT country_code FROM players GROUP BY country_code ORDER BY count(*) DESC LIMIT 1
Generated query:


SELECT Country_code FROM Player GROUP BY Country_code ORDER BY COUNT(*) DESC LIMIT 1<eos>
____________________________________________________________________________________________________
Original query:
SELECT country_code FROM players GROUP BY country_code HAVING count(*)  >  50
Generated query:


SELECT  country_code FROM  player_country GROUP BY country_code HAVING COUNT(*) > 50<eos>
____________________________________________________________________________________________________
Original query:
SELECT country_code FROM players GROUP BY country_code HAVING count(*)  >  50
Generated query:


SELECT  country_code FROM  player_country GROUP BY country_code HAVING COUNT(*) > 50<eos>
____________________________________________________________________________________________________
Original query:
SELECT sum(tours) ,  ranking_date FROM rankings GROUP BY ranking_date
Generated query:


SELECT  COUNT(*) AS total_tours FROM  tour_ranking<eos>
____________________________________________________________________________________________________
Original query:
SELECT sum(tours) ,  ranking_date FROM rankings GROUP BY ranking_date
Generated query:


SELECT  count(*) AS total_tours FROM tours GROUP BY ranking_date<eos>
____________________________________________________________________________________________________
Original query:
SELECT count(*) ,  YEAR FROM matches GROUP BY YEAR
Generated query:


SELECT COUNT(*) FROM Match WHERE Match_year = 2018<eos>
____________________________________________________________________________________________________
Original query:
SELECT count(*) ,  YEAR FROM matches GROUP BY YEAR
Generated query:


SELECT COUNT(*) FROM Match<eos>
____________________________________________________________________________________________________
Original query:
SELECT DISTINCT winner_name ,  winner_rank FROM matches ORDER BY winner_age LIMIT 3
Generated query:


SELECT  winner_name ,  winner_rank FROM  winner  WHERE  winner_rank  <  3<eos>
____________________________________________________________________________________________________
Original query:
SELECT DISTINCT winner_name ,  winner_rank FROM matches ORDER BY winner_age LIMIT 3
Generated query:


SELECT  winner_name ,  winner_rank  FROM  winner  WHERE  winner_year  =  (SELECT  MIN(winner_year)  FROM  winner)<eos>
____________________________________________________________________________________________________
Original query:
SELECT count(DISTINCT winner_name) FROM matches WHERE tourney_name  =  'WTA Championships' AND winner_hand  =  'L'
Generated query:


SELECT COUNT(DISTINCT winner_hand) FROM  winner_hand WHERE winner_hand  =  'left' AND  winner_hand  =  'WTA Championships'<eos>
____________________________________________________________________________________________________
Original query:
SELECT count(DISTINCT winner_name) FROM matches WHERE tourney_name  =  'WTA Championships' AND winner_hand  =  'L'
Generated query:


SELECT COUNT(*) FROM  "public"."winner" WHERE  "winner"."hand" = 'L'<eos>
____________________________________________________________________________________________________
Original query:
SELECT T1.first_name ,  T1.country_code ,  T1.birth_date FROM players AS T1 JOIN matches AS T2 ON T1.player_id  =  T2.winner_id ORDER BY T2.winner_rank_points DESC LIMIT 1
Generated query:


SELECT  firstname ,  country_code ,  birth_date FROM  match  WHERE  winner_rank  =  (SELECT  MAX(winner_rank) FROM  match)<eos>
____________________________________________________________________________________________________
Original query:
SELECT T1.first_name ,  T1.country_code ,  T1.birth_date FROM players AS T1 JOIN matches AS T2 ON T1.player_id  =  T2.winner_id ORDER BY T2.winner_rank_points DESC LIMIT 1
Generated query:


SELECT  firstname ,  country_code ,  birth_date  FROM  player  WHERE  winner_rank_points  =  ( SELECT  MAX  (  winner_rank_points  )  FROM  player  )<eos>
____________________________________________________________________________________________________
Original query:
SELECT count(*) ,  hand FROM players GROUP BY hand
Generated query:


SELECT COUNT(*) FROM hand_type<eos>
____________________________________________________________________________________________________
Original query:
SELECT count(*) ,  hand FROM players GROUP BY hand
Generated query:


SELECT COUNT(*) FROM hand_type<eos>
____________________________________________________________________________________________________
Original query:
SELECT count(*) FROM ship WHERE disposition_of_ship  =  'Captured'
Generated query:


SELECT count(*) FROM ships WHERE ship_status = 'Captured'<eos>
____________________________________________________________________________________________________
Original query:
SELECT name ,  tonnage FROM ship ORDER BY name DESC
Generated query:


SELECT name , tonnage FROM orders ORDER BY name DESC<eos>
____________________________________________________________________________________________________
Original query:
SELECT name ,  date FROM battle
Generated query:


SELECT  battle.name , battle.date , battle.result FROM battle<eos>
____________________________________________________________________________________________________
Original query:
SELECT max(killed) ,  min(killed) FROM death
Generated query:


SELECT MAX(death_toll) , MIN(death_toll) FROM covid_deaths<eos>
____________________________________________________________________________________________________
Original query:
SELECT avg(injured) FROM death
Generated query:


SELECT AVG(injury_count) FROM injury<eos>
____________________________________________________________________________________________________
Original query:
SELECT T1.killed ,  T1.injured FROM death AS T1 JOIN ship AS t2 ON T1.caused_by_ship_id  =  T2.id WHERE T2.tonnage  =  't'
Generated query:


SELECT  * FROM  "Ship" WHERE  "Tonnage"  =  't'<eos>
____________________________________________________________________________________________________
Original query:
SELECT name ,  RESULT FROM battle WHERE bulgarian_commander != 'Boril'
Generated query:


SELECT  b.name ,  b.result  FROM battles AS b JOIN commanders AS c ON b.commander_id  =  c.id WHERE  c.name  =  'Boril'<eos>
____________________________________________________________________________________________________
Original query:
SELECT DISTINCT T1.id ,  T1.name FROM battle AS T1 JOIN ship AS T2 ON T1.id  =  T2.lost_in_battle WHERE T2.ship_type  =  'Brig'
Generated query:


SELECT DISTINCT battle_id , battle_name FROM battles WHERE type_id IN (SELECT type_id FROM ships WHERE type_name = 'Brig')<eos>
____________________________________________________________________________________________________
Original query:
SELECT T1.id ,  T1.name FROM battle AS T1 JOIN ship AS T2 ON T1.id  =  T2.lost_in_battle JOIN death AS T3 ON T2.id  =  T3.caused_by_ship_id GROUP BY T1.id HAVING sum(T3.killed)  >  10
Generated query:



,db_id,query,question,query_toks,query_toks_no_value,question_toks,modified question,generated_query
468,wta_1,"SELECT winner_name , loser_name FROM matches ...",What are the names of the winner and loser who...,"[SELECT, winner_name, ,, loser_name, FROM, mat...","[select, winner_name, ,, loser_name, from, mat...","[What, are, the, names, of, the, winner, and, ...","""Write a query that answers the following ques...","\n\nSELECT winner , loser FROM matches ORDER..."
469,wta_1,"SELECT avg(ranking) , T1.first_name FROM play...",Find the average ranking for each player and t...,"[SELECT, avg, (, ranking, ), ,, T1.first_name,...","[select, avg, (, ranking, ), ,, t1, ., first_n...","[Find, the, average, ranking, for, each, playe...","""Write a query that answers the following ques...","\n\nSELECT AVG(ranking) , first_name FROM ..."
470,wta_1,"SELECT avg(ranking) , T1.first_name FROM play...","What are the first names of all players, and t...","[SELECT, avg, (, ranking, ), ,, T1.first_name,...","[select, avg, (, ranking, ), ,, t1, ., first_n...","[What, are, the, first, names, of, all, player...","""Write a query that answers the following ques...","\n\nSELECT firstname , avg_rank FROM play..."
471,wta_1,"SELECT sum(ranking_points) , T1.first_name FR...",Find the total ranking points for each player ...,"[SELECT, sum, (, ranking_points, ), ,, T1.firs...","[select, sum, (, ranking_points, ), ,, t1, ., ...","[Find, the, total, ranking, points, for, each,...","""Write a query that answers the following ques...","\n\nSELECT player_name , SUM(ranking_points..."
472,wta_1,"SELECT sum(ranking_points) , T1.first_name FR...","What are the first names of all players, and t...","[SELECT, sum, (, ranking_points, ), ,, T1.firs...","[select, sum, (, ranking_points, ), ,, t1, ., ...","[What, are, the, first, names, of, all, player...","""Write a query that answers the following ques...","\n\nSELECT firstname , ranking_points FROM..."
473,wta_1,"SELECT count(*) , country_code FROM players G...",find the number of players for each country.,"[SELECT, count, (, *, ), ,, country_code, FROM...","[select, count, (, *, ), ,, country_code, from...","[find, the, number, of, players, for, each, co...","""Write a query that answers the following ques...",\n\nSELECT COUNT(*) FROM player GROUP BY country
474,wta_1,"SELECT count(*) , country_code FROM players G...",How many players are from each country?,"[SELECT, count, (, *, ), ,, country_code, FROM...","[select, count, (, *, ), ,, country_code, from...","[How, many, players, are, from, each, country, ?]","""Write a query that answers the following ques...",\n\nSELECT country FROM players GROUP BY country
475,wta_1,SELECT country_code FROM players GROUP BY coun...,find the code of the country where has the gre...,"[SELECT, country_code, FROM, players, GROUP, B...","[select, country_code, from, players, group, b...","[find, the, code, of, the, country, where, has...","""Write a query that answers the following ques...",\n\nSELECT Country_code FROM Player GROUP BY ...
476,wta_1,SELECT country_code FROM players GROUP BY coun...,What is the code of the country with the most ...,"[SELECT, country_code, FROM, players, GROUP, B...","[select, country_code, from, players, group, b...","[What, is, the, code, of, the, country, with, ...","""Write a query that answers the following ques...",\n\nSELECT Country_code FROM Player GROUP BY ...
477,wta_1,SELECT country_code FROM players GROUP BY coun...,Find the codes of countries that have more tha...,"[SELECT, country_code, FROM, players, GROUP, B...","[select, country_code, from, players, group, b...","[Find, the, codes, of, countries, that, have, ...","""Write a query that answers the following ques...",\n\nSELECT country_code FROM player_country...
478,wta_1,SELECT country_code FROM players GROUP BY coun...,What are the codes of countries with more than...,"[SELECT, country_code, FROM, players, GROUP, B...","[select, country_code, from, players, group, b...","[What, are, the, codes, of, countries, with, m...","""Write a query that answers the following ques...",\n\nSELECT country_code FROM player_country...
479,wta_1,"SELECT sum(tours) , ranking_date FROM ranking...",Find the total number of tours for each rankin...,"[SELECT, sum, (, tours, ), ,, ranking_date, FR...","[select, sum, (, tours, ), ,, ranking_date, fr...","[Find, the, total, number, of, tours, for, eac...","""Write a query that answers the following ques...",\n\nSELECT COUNT(*) AS total_tours FROM tou...
480,wta_1,"SELECT sum(tours) , ranking_date FROM ranking...",How many total tours were there for each ranki...,"[SELECT, sum, (, tours, ), ,, ranking_date, FR...","[select, sum, (, tours, ), ,, ranking_date, fr...","[How, many, total, tours, were, there, for, ea...","""Write a query that answers the following ques...",\n\nSELECT count(*) AS total_tours FROM tour...
481,wta_1,"SELECT count(*) , YEAR FROM matches GROUP BY ...",Find the number of matches happened in each year.,"[SELECT, count, (, *, ), ,, YEAR, FROM, matche...","[select, count, (, *, ), ,, year, from, matche...","[Find, the, number, of, matches, happened, in,...","""Write a query that answers the following ques...",\n\nSELECT COUNT(*) FROM Match WHERE Match_ye...
482,wta_1,"SELECT count(*) , YEAR FROM matches GROUP BY ...",How many matches were played in each year?,"[SELECT, count, (, *, ), ,, YEAR, FROM, matche...","[select, count, (, *, ), ,, year, from, matche...","[How, many, matches, were, played, in, each, y...","""Write a query that answers the following ques...",\n\nSELECT COUNT(*) FROM Match
483,wta_1,"SELECT DISTINCT winner_name , winner_rank FRO...",Find the name and rank of the 3 youngest winne...,"[SELECT, DISTINCT, winner_name, ,, winner_rank...","[select, distinct, winner_name, ,, winner_rank...","[Find, the, name, and, rank, of, the, 3, young...","""Write a query that answers the following ques...","\n\nSELECT winner_name , winner_rank FROM ..."
484,wta_1,"SELECT DISTINCT winner_name , winner_rank FRO...",What are the names and ranks of the three youn...,"[SELECT, DISTINCT, winner_name, ,, winner_rank...","[select, distinct, winner_name, ,, winner_rank...","[What, are, the, names, and, ranks, of, the, t...","""Write a query that answers the following ques...","\n\nSELECT winner_name , winner_rank FROM ..."
485,wta_1,SELECT count(DISTINCT winner_name) FROM matche...,How many different winners both participated i...,"[SELECT, count, (, DISTINCT, winner_name, ), F...","[select, count, (, distinct, winner_name, ), f...","[How, many, different, winners, both, particip...","""Write a query that answers the following ques...",\n\nSELECT COUNT(DISTINCT winner_hand) FROM ...
486,wta_1,SELECT count(DISTINCT winner_name) FROM matche...,Find the number of left handed winners who par...,"[SELECT, count, (, DISTINCT, winner_name, ), F...","[select, count, (, distinct, winner_name, ), f...","[Find, the, number, of, left, handed, winners,...","""Write a query that answers the following ques...","\n\nSELECT COUNT(*) FROM ""public"".""winner"" W..."
487,wta_1,"SELECT T1.first_name , T1.country_code , T1....","Find the first name, country code and birth da...","[SELECT, T1.first_name, ,, T1.country_code, ,,...","[select, t1, ., first_name, ,, t1, ., country_...","[Find, the, first, name, ,, country, code, and...","""Write a query that answers the following ques...","\n\nSELECT firstname , country_code , birt..."
488,wta_1,"SELECT T1.first_name , T1.country_code , T1....","What is the first name, country code, and birt...","[SELECT, T1.first_name, ,, T1.country_code, ,,...","[select, t1, ., first_name, ,, t1, ., country_...","[What, is, the, first, name, ,, country, code,...","""Write a query that answers the following ques...","\n\nSELECT firstname , country_code , birt..."
489,wta_1,"SELECT count(*) , hand FROM players GROUP BY ...",Find the number of players for each hand type.,"[SELECT, count, (, *, ), ,, hand, FROM, player...","[select, count, (, *, ), ,, hand, from, player...","[Find, the, number, of, players, for, each, ha...","""Write a query that answers the following ques...",\n\nSELECT COUNT(*) FROM hand_type
490,wta_1,"SELECT count(*) , hand FROM players GROUP BY ...",How many players are there for each hand type?,"[SELECT, count, (, *, ), ,, hand, FROM, player...","[select, count, (, *, ), ,, hand, from, player...","[How, many, players, are, there, for, each, ha...","""Write a query that answers the following ques...",\n\nSELECT COUNT(*) FROM hand_type
491,battle_death,SELECT count(*) FROM ship WHERE disposition_of...,How many ships ended up being 'Captured'?,"[SELECT, count, (, *, ), FROM, ship, WHERE, di...","[select, count, (, *, ), from, ship, where, di...","[How, many, ships, ended, up, being, 'Captured...","""Write a query that answers the following ques...",\n\nSELECT count(*) FROM ships WHERE ship_sta...
492,battle_death,"SELECT name , tonnage FROM ship ORDER BY name...",List the name and tonnage ordered by in descen...,"[SELECT, name, ,, tonnage, FROM, ship, ORDER, ...","[select, name, ,, tonnage, from, ship, order, ...","[List, the, name, and, tonnage, ordered, by, i...","""Write a query that answers the following ques...","\n\nSELECT name , tonnage FROM orders ORDER B..."
493,battle_death,"SELECT name , date FROM battle","List the name, date and result of each battle.","[SELECT, name, ,, date, FROM, battle]","[select, name, ,, date, from, battle]","[List, the, name, ,, date, and, result, of, ea...","""Write a query that answers the following ques...","\n\nSELECT battle.name , battle.date , battl..."
494,battle_death,"SELECT max(killed) , min(killed) FROM death",What is maximum and minimum death toll caused ...,"[SELECT, max, (, killed, ), ,, min, (, killed,...","[select, max, (, killed, ), ,, min, (, killed,...","[What, is, maximum, and, minimum, death, toll,...","""Write a query that answers the following ques...","\n\nSELECT MAX(death_toll) , MIN(death_toll) ..."
495,battle_death,SELECT avg(injured) FROM death,What is the average number of injuries caused ...,"[SELECT, avg, (, injured, ), FROM, death]","[select, avg, (, injured, ), from, death]","[What, is, the, average, number, of, injuries,...","""Write a query that answers the following ques...",\n\nSELECT AVG(injury_count) FROM injury
496,battle_death,"SELECT T1.killed , T1.injured FROM death AS T...",What are the death and injury situations cause...,"[SELECT, T1.killed, ,, T1.injured, FROM, death...","[select, t1, ., killed, ,, t1, ., injured, fro...","[What, are, the, death, and, injury, situation...","""Write a query that answers the following ques...","\n\nSELECT * FROM ""Ship"" WHERE ""Tonnage"" ..."
497,battle_death,"SELECT name , RESULT FROM battle WHERE bulgar...",What are the name and results of the battles w...,"[SELECT, name, ,, RESULT, FROM, battle, WHERE,...","[select, name, ,, result, from, battle, where,...","[What, are, the, name, and, results, of, the, ...","""Write a query that answers the following ques...","\n\nSELECT b.name , b.result FROM battles ..."
498,battle_death,"SELECT DISTINCT T1.id , T1.name FROM battle A...",What are the different ids and names of the ba...,"[SELECT, DISTINCT, T1.id, ,, T1.name, FROM, ba...","[select, distinct, t1, ., id, ,, t1, ., name, ...","[What, are, the, different, ids, and, names, o...","""Write a query that answers the following ques...","\n\nSELECT DISTINCT battle_id , battle_name F..."
499,battle_death,"SELECT T1.id , T1.name FROM battle AS T1 JOIN...",What are the ids and names of the battles that...,"[SELECT, T1.id, ,, T1.name, FROM, battle, AS, ...","[select, t1, ., id, ,, t1, ., name, from, batt...","[What, are, the, ids, and, names, of, the, bat...","""Write a query that answers the following ques...","\n\nSELECT battle_id , battle_name FROM bat..."
500,battle_death,"SELECT T2.id , T2.name FROM death AS T1 JOIN ...",What is the ship id and name that caused most ...,"[SELECT, T2.id, ,, T2.name, FROM, death, AS, T...","[select, t2, ., id, ,, t2, ., name, from, deat...","[What, is, the, ship, id, and, name, that, cau...","""Write a query that answers the following ques...","\n\nSELECT ship_id , ship_name , sum(total..."
501,battle_death,SELECT name FROM battle WHERE bulgarian_comman...,What are the distinct battle names which are b...,"[SELECT, name, FROM, battle, WHERE, bulgarian_...","[select, name, from, battle, where, bulgarian_...","[What, are, the, distinct, battle, names, whic...","""Write a query that answers the following ques...",\n\nSELECT DISTINCT battle_name FROM battles ...
502,battle_death,SELECT count(DISTINCT RESULT) FROM battle,How many different results are there for the b...,"[SELECT, count, (, DISTINCT, RESULT, ), FROM, ...","[select, count, (, distinct, result, ), from, ...","[How, many, different, results, are, there, fo...","""Write a query that answers the following ques...",\n\nSELECT DISTINCT COUNT(*) FROM battles
503,battle_death,SELECT count(*) FROM battle WHERE id NOT IN ( ...,How many battles did not lose any ship with to...,"[SELECT, count, (, *, ), FROM, battle, WHERE, ...","[select, count, (, *, ), from, battle, where, ...","[How, many, battles, did, not, lose, any, ship...","""Write a query that answers the following ques...",\n\nSELECT count(*) FROM battles WHERE tonnag...
504,battle_death,"SELECT T1.name , T1.date FROM battle AS T1 JO...",List the name and date the battle that has los...,"[SELECT, T1.name, ,, T1.date, FROM, battle, AS...","[select, t1, ., name, ,, t1, ., date, from, ba...","[List, the, name, and, date, the, battle, that...","""Write a query that answers the following ques...","\n\nSELECT battle_name , battle_date FROM ba..."
505,battle_death,"SELECT name , RESULT , bulgarian_commander F...","Show names, results and bulgarian commanders o...","[SELECT, name, ,, RESULT, ,, bulgarian_command...","[select, name, ,, result, ,, bulgarian_command...","[Show, names, ,, results, and, bulgarian, comm...","""Write a query that answers the following ques...","\n\nSELECT b.name , b.result , b.bulgarian..."
506,battle_death,SELECT note FROM death WHERE note LIKE '%East%',What are the notes of the death events which h...,"[SELECT, note, FROM, death, WHERE, note, LIKE,...","[select, note, from, death, where, note, like,...","[What, are, the, notes, of, the, death, events...","""Write a query that answers the following ques...",\n\nSELECT notes FROM death WHERE notes LI...
507,student_transcripts_tracking,"SELECT line_1 , line_2 FROM addresses",what are all the addresses including line 1 an...,"[SELECT, line_1, ,, line_2, FROM, addresses]","[select, line_1, ,, line_2, from, addresses]","[what, are, all, the, addresses, including, li...","""Write a query that answers the following ques...",\n\nSELECT address FROM address
508,student_transcripts_tracking,"SELECT line_1 , line_2 FROM addresses",What is the first and second line for all addr...,"[SELECT, line_1, ,, line_2, FROM, addresses]","[select, line_1, ,, line_2, from, addresses]","[What, is, the, first, and, second, line, for,...","""Write a query that answers the following ques...","\n\nSELECT address_line1 , address_line2 FR..."
509,student_transcripts_tracking,SELECT count(*) FROM Courses,How many courses in total are listed?,"[SELECT, count, (, *, ), FROM, Courses]","[select, count, (, *, ), from, courses]","[How, many, courses, in, total, are, listed, ?]","""Write a query that answers the following ques...",\n\nSELECT COUNT(*) FROM course
510,student_transcripts_tracking,SELECT count(*) FROM Courses,How many courses are there?,"[SELECT, count, (, *, ), FROM, Courses]","[select, count, (, *, ), from, courses]","[How, many, courses, are, there, ?]","""Write a query that answers the following ques...",<strong>SELECT COUNT(*) FROM course</strong>
511,student_transcripts_tracking,SELECT course_description FROM Courses WHERE c...,How is the math course described?,"[SELECT, course_description, FROM, Courses, WH...","[select, course_description, from, courses, wh...","[How, is, the, math, course, described, ?]","""Write a query that answers the following ques...",\n\nSELECT * FROM course WHERE course_name...
512,student_transcripts_tracking,SELECT course_description FROM Courses WHERE c...,What are the descriptions for all the math cou...,"[SELECT, course_description, FROM, Courses, WH...","[select, course_description, from, courses, wh...","[What, are, the, descriptions, for, all, the, ...","""Write a query that answers the following ques...",\n\nSELECT * FROM course WHERE subject_cod...
513,student_transcripts_tracking,SELECT zip_postcode FROM Addresses WHERE city ...,What is the zip code of the address in the cit...,"[SELECT, zip_postcode, FROM, Addresses, WHERE,...","[select, zip_postcode, from, addresses, where,...","[What, is, the, zip, code, of, the, address, i...","""Write a query that answers the following ques...",\n\nSELECT address_zip FROM address WHERE ci...
514,student_transcripts_tracking,SELECT zip_postcode FROM Addresses WHERE city ...,What is the zip code for Port Chelsea?,"[SELECT, zip_postcode, FROM, Addresses, WHERE,...","[select, zip_postcode, from, addresses, where,...","[What, is, the, zip, code, for, Port, Chelsea, ?]","""Write a query that answers the following ques...",\n\nSELECT zip_code FROM address WHERE cit...
515,student_transcripts_tracking,"SELECT T2.department_name , T1.department_id ...",Which department offers the most number of deg...,"[SELECT, T2.department_name, ,, T1.department_...","[select, t2, ., department_name, ,, t1, ., dep...","[Which, department, offers, the, most, number,...","""Write a query that answers the following ques...","\n\nSELECT department_name , department_id ..."
516,student_transcripts_tracking,"select t2.department_name , t1.department_id ...",What is the name and id of the department with...,"[select, t2.department_name, ,, t1.department_...","[select, t2, ., department_name, ,, t1, ., dep...","[What, is, the, name, and, id, of, the, depart...","""Write a query that answers the following ques...","\n\nSELECT department_name , department_id ..."
517,student_transcripts_tracking,SELECT count(DISTINCT department_id) FROM Degr...,How many departments offer any degree?,"[SELECT, count, (, DISTINCT, department_id, ),...","[select, count, (, distinct, department_id, ),...","[How, many, departments, offer, any, degree, ?]","""Write a query that answers the following ques...",\n\nSELECT COUNT(*) FROM departments
518,student_transcripts_tracking,SELECT count(DISTINCT department_id) FROM Degr...,How many different departments offer degrees?,"[SELECT, count, (, DISTINCT, department_id, ),...","[select, count, (, distinct, department_id, ),...","[How, many, different, departments, offer, deg...","""Write a query that answers the following ques...",\n\nSELECT DISTINCT department FROM departments
519,student_transcripts_tracking,SELECT count(DISTINCT degree_summary_name) FRO...,How many different degree names are offered?,"[SELECT, count, (, DISTINCT, degree_summary_na...","[select, count, (, distinct, degree_summary_na...","[How, many, different, degree, names, are, off...","""Write a query that answers the following ques...",\n\nSELECT DISTINCT degree_name FROM degree

====================================================================================================
(52, 7)
Input:  ['"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> How many different degrees are offered? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> How many degrees does the engineering department offer? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> How many degrees does the engineering department have? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the names and descriptions of all the sections? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the names and descriptions for all the sections? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the names and id of courses having at most 2 sections? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the names and ids of every course with less than 2 sections? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> List the section_name in reversed lexicographical order. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the names of the sections in reverse alphabetical order? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the semester which most student registered in? Show both the name and the id. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> For each semester, what is the name and id of the one with the most students registered? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the description of the department whose name has the substring the computer? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the department description for the one whose name has the word computer? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Who are enrolled in 2 degree programs in one semester? List the first name, middle name and last name and the id. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the first, middle, and last names, along with the ids, of all students who enrolled in 2 degree programs in one semester? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Who is enrolled in a Bachelor degree program? List the first name, middle name, last name. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the first, middle, and last names for everybody enrolled in a Bachelors program? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Find the kind of program which most number of students are enrolled in? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the degree summary name that has the most number of students enrolled? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Find the program which most number of students are enrolled in. List both the id and the summary. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the program id and the summary of the degree that has the most students enrolled? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Which student has enrolled for the most times in any program? List the id, first name, middle name, last name, the number of enrollments and student id. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the first, middle, and last name, along with the id and number of enrollments, for the student who enrolled the most in any program? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Which semesters do not have any student enrolled? List the semester name. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the name of the semester with no students enrolled? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are all the course names of the courses which ever have students enrolled in? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the names of all courses that have some students enrolled? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What\'s the name of the course with most number of enrollments? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the name of the course with the most students enrolled? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Find the last name of the students who currently live in the state of North Carolina but have not registered in any degree program. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the last name of the students who live in North Carolina but have not registered in any degree programs? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Show the date and id of the transcript with at least 2 course results. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the date and id of the transcript with at least 2 courses listed? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the phone number of the man with the first name Timmothy and the last name Ward? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the mobile phone number of the student named Timmothy Ward ? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Who is the first student to register? List the first name, middle name and last name. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the first, middle, and last name of the first student to register? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Who is the earliest graduate of the school? List the first name, middle name and last name. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the first, middle, and last name of the earliest school graduate? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Whose permanent address is different from his or her current address? List his or her first name. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the first name of the student whose permanent address is different from his or her current one? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Which address holds the most number of students currently? List the address id and all lines. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the id, line 1, and line 2 of the address with the most students? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> On average, when were the transcripts printed? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the average transcript date? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> When is the first transcript released? List the date and details. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the earliest date of a transcript release, and what details can you tell me? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> How many transcripts are released? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> How many transcripts are listed? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the last transcript release date? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> When was the last transcript released? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> How many times at most can a course enrollment result show in different transcripts? Also show the course enrollment id. <query> ']
Original query:
SELECT count(DISTINCT degree_summary_name) FROM Degree_Programs
Generated query:


SELECT DISTINCT degree FROM degree_program<eos>
____________________________________________________________________________________________________
Original query:
SELECT count(*) FROM Departments AS T1 JOIN Degree_Programs AS T2 ON T1.department_id  =  T2.department_id WHERE T1.department_name  =  'engineer'
Generated query:


SELECT COUNT(*) FROM department WHERE department_name = 'Engineering'<eos>
____________________________________________________________________________________________________
Original query:
SELECT count(*) FROM Departments AS T1 JOIN Degree_Programs AS T2 ON T1.department_id  =  T2.department_id WHERE T1.department_name  =  'engineer'
Generated query:


SELECT COUNT(*) FROM department WHERE department_name = 'Engineering'<eos>
____________________________________________________________________________________________________
Original query:
SELECT section_name ,  section_description FROM Sections
Generated query:


SELECT  section_name ,  section_description FROM  section<eos>
____________________________________________________________________________________________________
Original query:
SELECT section_name ,  section_description FROM Sections
Generated query:


SELECT  section_name ,  section_description FROM  section<eos>
____________________________________________________________________________________________________
Original query:
SELECT T1.course_name ,  T1.course_id FROM Courses AS T1 JOIN Sections AS T2 ON T1.course_id  =  T2.course_id GROUP BY T1.course_id HAVING count(*)  <=  2
Generated query:


SELECT  course_name ,  course_id FROM courses WHERE  count(section_id) <= 2<eos>
____________________________________________________________________________________________________
Original query:
SELECT T1.course_name ,  T1.course_id FROM Courses AS T1 JOIN Sections AS T2 ON T1.course_id  =  T2.course_id GROUP BY T1.course_id HAVING count(*)  <=  2
Generated query:


SELECT  course_name ,  course_id FROM course WHERE  section_count < 2<eos>
____________________________________________________________________________________________________
Original query:
SELECT section_name FROM Sections ORDER BY section_name DESC
Generated query:
 SELECT section_name FROM section ORDER BY section_name DESC<eos>
____________________________________________________________________________________________________
Original query:
SELECT section_name FROM Sections ORDER BY section_name DESC
Generated query:


SELECT  section_name FROM  section ORDER BY section_name DESC<eos>
____________________________________________________________________________________________________
Original query:
SELECT T1.semester_name ,  T1.semester_id FROM Semesters AS T1 JOIN Student_Enrolment AS T2 ON T1.semester_id  =  T2.semester_id GROUP BY T1.semester_id ORDER BY count(*) DESC LIMIT 1
Generated query:


SELECT  semester_name ,  student_id  FROM  student_semester  GROUP BY  semester_name  ORDER BY  semester_name  DESC<eos>
____________________________________________________________________________________________________
Original query:
SELECT T1.semester_name ,  T1.semester_id FROM Semesters AS T1 JOIN Student_Enrolment AS T2 ON T1.semester_id  =  T2.semester_id GROUP BY T1.semester_id ORDER BY count(*) DESC LIMIT 1
Generated query:


SELECT  semester_name ,  semester_id  FROM  semester  GROUP BY  semester_id  ORDER BY  COUNT(*) DESC<eos>
____________________________________________________________________________________________________
Original query:
SELECT department_description FROM Departments WHERE department_name LIKE '%computer%'
Generated query:


SELECT  description FROM department WHERE name LIKE '%computer%'<eos>
____________________________________________________________________________________________________
Original query:
SELECT department_description FROM Departments WHERE department_name LIKE '%computer%'
Generated query:
 <strong>SELECT department_description FROM department WHERE name LIKE '%computer%'</strong><eos>
____________________________________________________________________________________________________
Original query:
SELECT T1.first_name ,  T1.middle_name ,  T1.last_name ,  T1.student_id FROM Students AS T1 JOIN Student_Enrolment AS T2 ON T1.student_id  =  T2.student_id GROUP BY T1.student_id HAVING count(*)  =  2
Generated query:


SELECT  first_name ,  middle_name ,  last_name ,  id  FROM  student  WHERE  degree_id  =  2  AND  semester_id  =  1<eos>
____________________________________________________________________________________________________
Original query:
SELECT T1.first_name ,  T1.middle_name ,  T1.last_name ,  T1.student_id FROM Students AS T1 JOIN Student_Enrolment AS T2 ON T1.student_id  =  T2.student_id GROUP BY T1.student_id HAVING count(*)  =  2
Generated query:


SELECT  first_name ,  middle_name ,  last_name ,  student_id  FROM  student  WHERE  degree_id  =  ( SELECT  degree_id  FROM  degree  WHERE  semester  =  "Fall 2019" )<eos>
____________________________________________________________________________________________________
Original query:
SELECT DISTINCT T1.first_name ,  T1.middle_name ,  T1.last_name FROM Students AS T1 JOIN Student_Enrolment AS T2 ON T1.student_id  =  T2.student_id JOIN Degree_Programs AS T3 ON T2.degree_program_id  =  T3.degree_program_id WHERE T3.degree_summary_name  =  'Bachelor'
Generated query:


SELECT  first_name ,  middle_name ,  last_name FROM  student WHERE  program_id  =  1<eos>
____________________________________________________________________________________________________
Original query:
SELECT DISTINCT T1.first_name ,  T1.middle_name ,  T1.last_name FROM Students AS T1 JOIN Student_Enrolment AS T2 ON T1.student_id  =  T2.student_id JOIN Degree_Programs AS T3 ON T2.degree_program_id  =  T3.degree_program_id WHERE T3.degree_summary_name  =  'Bachelor'
Generated query:


SELECT  firstname ,  middlename ,  lastname FROM  student WHERE  program_id  =  1<eos>
____________________________________________________________________________________________________
Original query:
SELECT T1.degree_summary_name FROM Degree_Programs AS T1 JOIN Student_Enrolment AS T2 ON T1.degree_program_id  =  T2.degree_program_id GROUP BY T1.degree_summary_name ORDER BY count(*) DESC LIMIT 1
Generated query:


SELECT  program_name ,  count(*) AS total_enrolled_students  FROM  program  GROUP BY  program_name  ORDER BY  total_enrolled_students DESC LIMIT 1<eos>
____________________________________________________________________________________________________
Original query:
SELECT T1.degree_summary_name FROM Degree_Programs AS T1 JOIN Student_Enrolment AS T2 ON T1.degree_program_id  =  T2.degree_program_id GROUP BY T1.degree_summary_name ORDER BY count(*) DESC LIMIT 1
Generated query:


SELECT  degree_summary_name ,  count(*) FROM  degree_summary GROUP BY  degree_summary_name ORDER BY  count(*) DESC LIMIT 1<eos>
____________________________________________________________________________________________________
Original query:
SELECT T1.degree_program_id ,  T1.degree_summary_name FROM Degree_Programs AS T1 JOIN Student_Enrolment AS T2 ON T1.degree_program_id  =  T2.degree_program_id GROUP BY T1.degree_program_id ORDER BY count(*) DESC LIMIT 1
Generated query:


SELECT  program_id ,  summary FROM  program_enrolled<eos>
____________________________________________________________________________________________________
Original query:
SELECT T1.degree_program_id ,  T1.degree_summary_name FROM Degree_Programs AS T1 JOIN Student_Enrolment AS T2 ON T1.degree_program_id  =  T2.degree_program_id GROUP BY T1.degree_program_id ORDER BY count(*) DESC LIMIT 1
Generated query:


SELECT  program_id ,  summary FROM  degree  ORDER BY  student_count DESC LIMIT 1<eos>
____________________________________________________________________________________________________
Original query:
SELECT T1.student_id ,  T1.first_name ,  T1.middle_name ,  T1.last_name ,  count(*) ,  T1.student_id FROM Students AS T1 JOIN Student_Enrolment AS T2 ON T1.student_id  =  T2.student_id GROUP BY T1.student_id ORDER BY count(*) DESC LIMIT 1
Generated query:


SELECT  student_id ,  first_name ,  middle_name ,  last_name ,  count(*) AS enrollments FROM student GROUP BY student_id ORDER BY enrollments DESC LIMIT 1<eos>
____________________________________________________________________________________________________
Original query:
SELECT T1.student_id ,  T1.first_name ,  T1.middle_name ,  T1.last_name ,  count(*) ,  T1.student_id FROM Students AS T1 JOIN Student_Enrolment AS T2 ON T1.student_id  =  T2.student_id GROUP BY T1.student_id ORDER BY count(*) DESC LIMIT 1
Generated query:


SELECT  first_name ,  middle_name ,  last_name ,  id ,  number  FROM  enroll  WHERE  program_id  =  ( SELECT  MAX(program_id)  FROM  enroll )<eos>

,db_id,query,question,query_toks,query_toks_no_value,question_toks,modified question,generated_query
520,student_transcripts_tracking,SELECT count(DISTINCT degree_summary_name) FRO...,How many different degrees are offered?,"[SELECT, count, (, DISTINCT, degree_summary_na...","[select, count, (, distinct, degree_summary_na...","[How, many, different, degrees, are, offered, ?]","""Write a query that answers the following ques...",\n\nSELECT DISTINCT degree FROM degree_program
521,student_transcripts_tracking,SELECT count(*) FROM Departments AS T1 JOIN De...,How many degrees does the engineering departme...,"[SELECT, count, (, *, ), FROM, Departments, AS...","[select, count, (, *, ), from, departments, as...","[How, many, degrees, does, the, engineering, d...","""Write a query that answers the following ques...",\n\nSELECT COUNT(*) FROM department WHERE dep...
522,student_transcripts_tracking,SELECT count(*) FROM Departments AS T1 JOIN De...,How many degrees does the engineering departme...,"[SELECT, count, (, *, ), FROM, Departments, AS...","[select, count, (, *, ), from, departments, as...","[How, many, degrees, does, the, engineering, d...","""Write a query that answers the following ques...",\n\nSELECT COUNT(*) FROM department WHERE dep...
523,student_transcripts_tracking,"SELECT section_name , section_description FRO...",What are the names and descriptions of all the...,"[SELECT, section_name, ,, section_description,...","[select, section_name, ,, section_description,...","[What, are, the, names, and, descriptions, of,...","""Write a query that answers the following ques...","\n\nSELECT section_name , section_descripti..."
524,student_transcripts_tracking,"SELECT section_name , section_description FRO...",What are the names and descriptions for all th...,"[SELECT, section_name, ,, section_description,...","[select, section_name, ,, section_description,...","[What, are, the, names, and, descriptions, for...","""Write a query that answers the following ques...","\n\nSELECT section_name , section_descripti..."
525,student_transcripts_tracking,"SELECT T1.course_name , T1.course_id FROM Cou...",What are the names and id of courses having at...,"[SELECT, T1.course_name, ,, T1.course_id, FROM...","[select, t1, ., course_name, ,, t1, ., course_...","[What, are, the, names, and, id, of, courses, ...","""Write a query that answers the following ques...","\n\nSELECT course_name , course_id FROM cou..."
526,student_transcripts_tracking,"SELECT T1.course_name , T1.course_id FROM Cou...",What are the names and ids of every course wit...,"[SELECT, T1.course_name, ,, T1.course_id, FROM...","[select, t1, ., course_name, ,, t1, ., course_...","[What, are, the, names, and, ids, of, every, c...","""Write a query that answers the following ques...","\n\nSELECT course_name , course_id FROM cou..."
527,student_transcripts_tracking,SELECT section_name FROM Sections ORDER BY sec...,List the section_name in reversed lexicographi...,"[SELECT, section_name, FROM, Sections, ORDER, ...","[select, section_name, from, sections, order, ...","[List, the, section_name, in, reversed, lexico...","""Write a query that answers the following ques...",SELECT section_name FROM section ORDER BY sec...
528,student_transcripts_tracking,SELECT section_name FROM Sections ORDER BY sec...,What are the names of the sections in reverse ...,"[SELECT, section_name, FROM, Sections, ORDER, ...","[select, section_name, from, sections, order, ...","[What, are, the, names, of, the, sections, in,...","""Write a query that answers the following ques...",\n\nSELECT section_name FROM section ORDER ...
529,student_transcripts_tracking,"SELECT T1.semester_name , T1.semester_id FROM...",What is the semester which most student regist...,"[SELECT, T1.semester_name, ,, T1.semester_id, ...","[select, t1, ., semester_name, ,, t1, ., semes...","[What, is, the, semester, which, most, student...","""Write a query that answers the following ques...","\n\nSELECT semester_name , student_id FROM..."
530,student_transcripts_tracking,"SELECT T1.semester_name , T1.semester_id FROM...","For each semester, what is the name and id of ...","[SELECT, T1.semester_name, ,, T1.semester_id, ...","[select, t1, ., semester_name, ,, t1, ., semes...","[For, each, semester, ,, what, is, the, name, ...","""Write a query that answers the following ques...","\n\nSELECT semester_name , semester_id FRO..."
531,student_transcripts_tracking,SELECT department_description FROM Departments...,What is the description of the department whos...,"[SELECT, department_description, FROM, Departm...","[select, department_description, from, departm...","[What, is, the, description, of, the, departme...","""Write a query that answers the following ques...",\n\nSELECT description FROM department WHERE...
532,student_transcripts_tracking,SELECT department_description FROM Departments...,What is the department description for the one...,"[SELECT, department_description, FROM, Departm...","[select, department_description, from, departm...","[What, is, the, department, description, for, ...","""Write a query that answers the following ques...",<strong>SELECT department_description FROM de...
533,student_transcripts_tracking,"SELECT T1.first_name , T1.middle_name , T1.l...",Who are enrolled in 2 degree programs in one s...,"[SELECT, T1.first_name, ,, T1.middle_name, ,, ...","[select, t1, ., first_name, ,, t1, ., middle_n...","[Who, are, enrolled, in, 2, degree, programs, ...","""Write a query that answers the following ques...","\n\nSELECT first_name , middle_name , last..."
534,student_transcripts_tracking,"SELECT T1.first_name , T1.middle_name , T1.l...","What are the first, middle, and last names, al...","[SELECT, T1.first_name, ,, T1.middle_name, ,, ...","[select, t1, ., first_name, ,, t1, ., middle_n...","[What, are, the, first, ,, middle, ,, and, las...","""Write a query that answers the following ques...","\n\nSELECT first_name , middle_name , last..."
535,student_transcripts_tracking,"SELECT DISTINCT T1.first_name , T1.middle_nam...",Who is enrolled in a Bachelor degree program? ...,"[SELECT, DISTINCT, T1.first_name, ,, T1.middle...","[select, distinct, t1, ., first_name, ,, t1, ....","[Who, is, enrolled, in, a, Bachelor, degree, p...","""Write a query that answers the following ques...","\n\nSELECT first_name , middle_name , last..."
536,student_transcripts_tracking,"SELECT DISTINCT T1.first_name , T1.middle_nam...","What are the first, middle, and last names for...","[SELECT, DISTINCT, T1.first_name, ,, T1.middle...","[select, distinct, t1, ., first_name, ,, t1, ....","[What, are, the, first, ,, middle, ,, and, las...","""Write a query that answers the following ques...","\n\nSELECT firstname , middlename , lastna..."
537,student_transcripts_tracking,SELECT T1.degree_summary_name FROM Degree_Prog...,Find the kind of program which most number of ...,"[SELECT, T1.degree_summary_name, FROM, Degree_...","[select, t1, ., degree_summary_name, from, deg...","[Find, the, kind, of, program, which, most, nu...","""Write a query that answers the following ques...","\n\nSELECT program_name , count(*) AS total..."
538,student_transcripts_tracking,SELECT T1.degree_summary_name FROM Degree_Prog...,What is the degree summary name that has the m...,"[SELECT, T1.degree_summary_name, FROM, Degree_...","[select, t1, ., degree_summary_name, from, deg...","[What, is, the, degree, summary, name, that, h...","""Write a query that answers the following ques...","\n\nSELECT degree_summary_name , count(*) F..."
539,student_transcripts_tracking,"SELECT T1.degree_program_id , T1.degree_summa...",Find the program which most number of students...,"[SELECT, T1.degree_program_id, ,, T1.degree_su...","[select, t1, ., degree_program_id, ,, t1, ., d...","[Find, the, program, which, most, number, of, ...","""Write a query that answers the following ques...","\n\nSELECT program_id , summary FROM progr..."
540,student_transcripts_tracking,"SELECT T1.degree_program_id , T1.degree_summa...",What is the program id and the summary of the ...,"[SELECT, T1.degree_program_id, ,, T1.degree_su...","[select, t1, ., degree_program_id, ,, t1, ., d...","[What, is, the, program, id, and, the, summary...","""Write a query that answers the following ques...","\n\nSELECT program_id , summary FROM degre..."
541,student_transcripts_tracking,"SELECT T1.student_id , T1.first_name , T1.mi...",Which student has enrolled for the most times ...,"[SELECT, T1.student_id, ,, T1.first_name, ,, T...","[select, t1, ., student_id, ,, t1, ., first_na...","[Which, student, has, enrolled, for, the, most...","""Write a query that answers the following ques...","\n\nSELECT student_id , first_name , middl..."
542,student_transcripts_tracking,"SELECT T1.student_id , T1.first_name , T1.mi...","What is the first, middle, and last name, alon...","[SELECT, T1.student_id, ,, T1.first_name, ,, T...","[select, t1, ., student_id, ,, t1, ., first_na...","[What, is, the, first, ,, middle, ,, and, last...","""Write a query that answers the following ques...","\n\nSELECT first_name , middle_name , last..."
543,student_transcripts_tracking,SELECT semester_name FROM Semesters WHERE seme...,Which semesters do not have any student enroll...,"[SELECT, semester_name, FROM, Semesters, WHERE...","[select, semester_name, from, semesters, where...","[Which, semesters, do, not, have, any, student...","""Write a query that answers the following ques...",\n\nSELECT semester_name FROM semester WHERE ...
544,student_transcripts_tracking,SELECT semester_name FROM Semesters WHERE seme...,What is the name of the semester with no stude...,"[SELECT, semester_name, FROM, Semesters, WHERE...","[select, semester_name, from, semesters, where...","[What, is, the, name, of, the, semester, with,...","""Write a query that answers the following ques...",\n\nSELECT semester_name FROM semester WHER...
545,student_transcripts_tracking,SELECT DISTINCT T1.course_name FROM Courses AS...,What are all the course names of the courses w...,"[SELECT, DISTINCT, T1.course_name, FROM, Cours...","[select, distinct, t1, ., course_name, from, c...","[What, are, all, the, course, names, of, the, ...","""Write a query that answers the following ques...",\n\nSELECT DISTINCT course_name FROM course_e...
546,student_transcripts_tracking,SELECT DISTINCT T1.course_name FROM Courses AS...,What are the names of all courses that have so...,"[SELECT, DISTINCT, T1.course_name, FROM, Cours...","[select, distinct, t1, ., course_name, from, c...","[What, are, the, names, of, all, courses, that...","""Write a query that answers the following ques...",<strong>SELECT course_name FROM course JOIN s...
547,student_transcripts_tracking,SELECT T1.course_name FROM Courses AS T1 JOIN...,What's the name of the course with most number...,"[SELECT, T1.course_name, FROM, Courses, AS, T1...","[select, t1, ., course_name, from, courses, as...","[What, 's, the, name, of, the, course, with, m...","""Write a query that answers the following ques...",\n\nSELECT course_name FROM course ORDER BY ...
548,student_transcripts_tracking,SELECT T1.course_name FROM Courses AS T1 JOIN...,What is the name of the course with the most s...,"[SELECT, T1.course_name, FROM, Courses, AS, T1...","[select, t1, ., course_name, from, courses, as...","[What, is, the, name, of, the, course, with, t...","""Write a query that answers the following ques...",\n\nSELECT course_name FROM course ORDER BY...
549,student_transcripts_tracking,SELECT T1.last_name FROM Students AS T1 JOIN A...,Find the last name of the students who current...,"[SELECT, T1.last_name, FROM, Students, AS, T1,...","[select, t1, ., last_name, from, students, as,...","[Find, the, last, name, of, the, students, who...","""Write a query that answers the following ques...",\n\nSELECT last_name FROM students WHERE sta...
550,student_transcripts_tracking,SELECT T1.last_name FROM Students AS T1 JOIN A...,What are the last name of the students who liv...,"[SELECT, T1.last_name, FROM, Students, AS, T1,...","[select, t1, ., last_name, from, students, as,...","[What, are, the, last, name, of, the, students...","""Write a query that answers the following ques...",\n\nSELECT last_name FROM students WHERE sta...
551,student_transcripts_tracking,"SELECT T2.transcript_date , T1.transcript_id ...",Show the date and id of the transcript with at...,"[SELECT, T2.transcript_date, ,, T1.transcript_...","[select, t2, ., transcript_date, ,, t1, ., tra...","[Show, the, date, and, id, of, the, transcript...","""Write a query that answers the following ques...","<strong>SELECT transcript_date , transcript..."
552,student_transcripts_tracking,"SELECT T2.transcript_date , T1.transcript_id ...",What is the date and id of the transcript with...,"[SELECT, T2.transcript_date, ,, T1.transcript_...","[select, t2, ., transcript_date, ,, t1, ., tra...","[What, is, the, date, and, id, of, the, transc...","""Write a query that answers the following ques...","\n\nSELECT t.date , t.id FROM transcript A..."
553,student_transcripts_tracking,SELECT cell_mobile_number FROM Students WHERE ...,What is the phone number of the man with the f...,"[SELECT, cell_mobile_number, FROM, Students, W...","[select, cell_mobile_number, from, students, w...","[What, is, the, phone, number, of, the, man, w...","""Write a query that answers the following ques...",\n\nSELECT phone_number FROM person WHERE fir...
554,student_transcripts_tracking,select cell_mobile_number from students where ...,What is the mobile phone number of the student...,"[select, cell_mobile_number, from, students, w...","[select, cell_mobile_number, from, students, w...","[What, is, the, mobile, phone, number, of, the...","""Write a query that answers the following ques...",\n\nSELECT mobile_phone_number FROM student...
555,student_transcripts_tracking,"SELECT first_name , middle_name , last_name ...",Who is the first student to register? List the...,"[SELECT, first_name, ,, middle_name, ,, last_n...","[select, first_name, ,, middle_name, ,, last_n...","[Who, is, the, first, student, to, register, ?...","""Write a query that answers the following ques...","\n\nSELECT firstname , middlename , lastna..."
556,student_transcripts_tracking,"SELECT first_name , middle_name , last_name ...","What is the first, middle, and last name of th...","[SELECT, first_name, ,, middle_name, ,, last_n...","[select, first_name, ,, middle_name, ,, last_n...","[What, is, the, first, ,, middle, ,, and, last...","""Write a query that answers the following ques...","\n\nSELECT firstname , middlename , lastna..."
557,student_transcripts_tracking,"SELECT first_name , middle_name , last_name ...",Who is the earliest graduate of the school? Li...,"[SELECT, first_name, ,, middle_name, ,, last_n...","[select, first_name, ,, middle_name, ,, last_n...","[Who, is, the, earliest, graduate, of, the, sc...","""Write a query that answers the following ques...","\n\nSELECT first_name , middle_name , last..."
558,student_transcripts_tracking,"SELECT first_name , middle_name , last_name ...","What is the first, middle, and last name of th...","[SELECT, first_name, ,, middle_name, ,, last_n...","[select, first_name, ,, middle_name, ,, last_n...","[What, is, the, first, ,, middle, ,, and, last...","""Write a query that answers the following ques...","\n\nSELECT firstname , middlename , lastna..."
559,student_transcripts_tracking,SELECT first_name FROM Students WHERE current_...,Whose permanent address is different from his ...,"[SELECT, first_name, FROM, Students, WHERE, cu...","[select, first_name, from, students, where, cu...","[Whose, permanent, address, is, different, fro...","""Write a query that answers the following ques...",\n\nSELECT first_name FROM person WHERE pe...
560,student_transcripts_tracking,SELECT first_name FROM Students WHERE current_...,What is the first name of the student whose pe...,"[SELECT, first_name, FROM, Students, WHERE, cu...","[select, first_name, from, students, where, cu...","[What, is, the, first, name, of, the, student,...","""Write a query that answers the following ques...",\n\nSELECT firstname FROM student WHERE addr...
561,student_transcripts_tracking,"SELECT T1.address_id , T1.line_1 , T1.line_2...",Which address holds the most number of student...,"[SELECT, T1.address_id, ,, T1.line_1, ,, T1.li...","[select, t1, ., address_id, ,, t1, ., line_1, ...","[Which, address, holds, the, most, number, of,...","""Write a query that answers the following ques...","\n\nSELECT address_id , count(*) FROM stude..."
562,student_transcripts_tracking,"SELECT T1.address_id , T1.line_1 , T1.line_2...","What is the id, line 1, and line 2 of the addr...","[SELECT, T1.address_id, ,, T1.line_1, ,, T1.li...","[select, t1, ., address_id, ,, t1, ., line_1, ...","[What, is, the, id, ,, line, 1, ,, and, line, ...","""Write a query that answers the following ques...","\n\nSELECT address_id , line_1 , line_2 F..."
563,student_transcripts_tracking,SELECT avg(transcript_date) FROM Transcripts,"On average, when were the transcripts printed?","[SELECT, avg, (, transcript_date, ), FROM, Tra...","[select, avg, (, transcript_date, ), from, tra...","[On, average, ,, when, were, the, transcripts,...","""Write a query that answers the following ques...",\n\nSELECT AVG(print_date) FROM transcript
564,student_transcripts_tracking,SELECT avg(transcript_date) FROM Transcripts,What is the average transcript date?,"[SELECT, avg, (, transcript_date, ), FROM, Tra...","[select, avg, (, transcript_date, ), from, tra...","[What, is, the, average, transcript, date, ?]","""Write a query that answers the following ques...",\n\nSELECT AVG(transcript_date) FROM transcript
565,student_transcripts_tracking,"SELECT transcript_date , other_details FROM T...",When is the first transcript released? List th...,"[SELECT, transcript_date, ,, other_details, FR...","[select, transcript_date, ,, other_details, fr...","[When, is, the, first, transcript, released, ?...","""Write a query that answers the following ques...",\n\nSELECT * FROM transcript WHERE release...
566,student_transcripts_tracking,"SELECT transcript_date , other_details FROM T...",What is the earliest date of a transcript rele...,"[SELECT, transcript_date, ,, other_details, FR...","[select, transcript_date, ,, other_details, fr...","[What, is, the, earliest, date, of, a, transcr...","""Write a query that answers the following ques...",\n\nSELECT MIN(release_date) AS earliest_date...
567,student_transcripts_tracking,SELECT count(*) FROM Transcripts,How many transcripts are released?,"[SELECT, count, (, *, ), FROM, Transcripts]","[select, count, (, *, ), from, transcripts]","[How, many, transcripts, are, released, ?]","""Write a query that answers the following ques...",\n\nSELECT count(*) FROM transcript
568,student_transcripts_tracking,SELECT count(*) FROM Transcripts,How many transcripts are listed?,"[SELECT, count, (, *, ), FROM, Transcripts]","[select, count, (, *, ), from, transcripts]","[How, many, transcripts, are, listed, ?]","""Write a query that answers the following ques...",\n\nSELECT count(*) FROM transcript
569,student_transcripts_tracking,SELECT transcript_date FROM Transcripts ORDER ...,What is the last transcript release date?,"[SELECT, transcript_date, FROM, Transcripts, O...","[select, transcript_date, from, transcripts, o...","[What, is, the, last, transcript, release, dat...","""Write a query that answers the following ques...",\n\nSELECT MAX(release_date) FROM transcript
570,student_transcripts_tracking,SELECT transcript_date FROM Transcripts ORDER ...,When was the last transcript released?,"[SELECT, transcript_date, FROM, Transcripts, O...","[select, transcript_date, from, transcripts, o...","[When, was, the, last, transcript, released, ?]","""Write a query that answers the following ques...",\n\nSELECT MAX(release_date) FROM transcript

====================================================================================================
(52, 7)
Input:  ['"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the maximum number of times that a course shows up in different transcripts and what is that course\'s enrollment id? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Show the date of the transcript which shows the least number of results, also list the id. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the date and id of the transcript with the least number of results? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Find the semester when both Master students and Bachelor students got enrolled in. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the id of the semester that had both Masters and Bachelors students enrolled? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> How many different addresses do the students currently live? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the different addresses that have students living there? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> List all the student details in reversed lexicographical order. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What other details can you tell me about students in reverse alphabetical order? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Describe the section h. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the description for the section named h? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Find the first name of the students who permanently live in the country Haiti or have the cell phone number 09700166582 . <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the first names of the students who live in Haiti permanently or have the cell phone number 09700166582 ? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> List the title of all cartoons in alphabetical order. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the titles of the cartoons sorted alphabetically? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> List all cartoon directed by "Ben Jones". <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the names of all cartoons directed by Ben Jones? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> How many cartoons were written by "Joseph Kuhr"? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the number of cartoones written by Joseph Kuhr? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> list all cartoon titles and their directors ordered by their air date <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the name and directors of all the cartoons that are ordered by air date? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> List the title of all cartoon directed by "Ben Jones" or "Brandon Vietti". <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the titles of all cartoons directed by Ben Jones or Brandon Vietti? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Which country has the most of TV Channels? List the country and number of TV Channels it has. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the country with the most number of TV Channels and how many does it have? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> List the number of different series names and contents in the TV Channel table. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> How many different series and contents are listed in the TV Channel table? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the content of TV Channel with serial name "Sky Radio"? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the content of the series Sky Radio? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the Package Option of TV Channel with serial name "Sky Radio"? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the Package Options of the TV Channels whose series names are Sky Radio? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> How many TV Channel using language English? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> How many TV Channels use the English language? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> List the language used least number of TV Channel. List language and number of TV Channel. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the languages used by the least number of TV Channels and how many channels use it? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> List each language and the number of TV Channels using it. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> For each language, list the number of TV Channels that use it. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the TV Channel that shows the cartoon "The Rise of the Blue Beetle!"? List the TV Channel\'s series name. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the series name of the TV Channel that shows the cartoon "The Rise of the Blue Beetle"? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> List the title of all  Cartoons showed on TV Channel with series name "Sky Radio". <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the title of all the cartools that are on the TV Channel with the series name "Sky Radio"? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> List the Episode of all TV series sorted by rating. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are all of the episodes ordered by ratings? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> List top 3 highest Rating  TV series. List the TV series\'s Episode and Rating. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are 3 most highly rated episodes in the TV series table and what were those ratings? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is minimum and maximum share of TV series? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the maximum and minimum share for the TV series? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the air date of TV series with Episode "A Love of a Lifetime"? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> When did the episode "A Love of a Lifetime" air? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is Weekly Rank of TV series with Episode "A Love of a Lifetime"? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the weekly rank for the episode "A Love of a Lifetime"? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the TV Channel of TV series with Episode "A Love of a Lifetime"? List the TV Channel\'s series name. <query> ']
Original query:
SELECT count(*) ,  student_course_id FROM Transcript_Contents GROUP BY student_course_id ORDER BY count(*) DESC LIMIT 1
Generated query:


SELECT  MAX(count) ,  course_id FROM  (SELECT  count(*) ,  course_id FROM  transcript GROUP BY  course_id)<eos>
____________________________________________________________________________________________________
Original query:
SELECT T2.transcript_date ,  T1.transcript_id FROM Transcript_Contents AS T1 JOIN Transcripts AS T2 ON T1.transcript_id  =  T2.transcript_id GROUP BY T1.transcript_id ORDER BY count(*) ASC LIMIT 1
Generated query:


SELECT  t.date ,  t.id  FROM  transcript AS t  GROUP BY  t.date  ORDER BY  count(*)  DESC  LIMIT  1<eos>
____________________________________________________________________________________________________
Original query:
SELECT T2.transcript_date ,  T1.transcript_id FROM Transcript_Contents AS T1 JOIN Transcripts AS T2 ON T1.transcript_id  =  T2.transcript_id GROUP BY T1.transcript_id ORDER BY count(*) ASC LIMIT 1
Generated query:


SELECT  t.date ,  t.id  FROM  transcript AS t  GROUP BY  t.date ,  t.id  ORDER BY  count(*)  DESC  LIMIT  1<eos>
____________________________________________________________________________________________________
Original query:
SELECT DISTINCT T2.semester_id FROM Degree_Programs AS T1 JOIN Student_Enrolment AS T2 ON T1.degree_program_id  =  T2.degree_program_id WHERE degree_summary_name  =  'Master' INTERSECT SELECT DISTINCT T2.semester_id FROM Degree_Programs AS T1 JOIN Student_Enrolment AS T2 ON T1.degree_program_id  =  T2.degree_program_id WHERE degree_summary_name  =  'Bachelor'
Generated query:


SELECT  semester FROM  (SELECT  * FROM  student WHERE  degree  =  'Master')  JOIN  (SELECT  * FROM  student WHERE  degree  =  'Bachelor')<eos>
____________________________________________________________________________________________________
Original query:
SELECT DISTINCT T2.semester_id FROM Degree_Programs AS T1 JOIN Student_Enrolment AS T2 ON T1.degree_program_id  =  T2.degree_program_id WHERE degree_summary_name  =  'Master' INTERSECT SELECT DISTINCT T2.semester_id FROM Degree_Programs AS T1 JOIN Student_Enrolment AS T2 ON T1.degree_program_id  =  T2.degree_program_id WHERE degree_summary_name  =  'Bachelor'
Generated query:


SELECT  s.id FROM  students AS s JOIN  enrolled AS e ON  s.id  =  e.student_id JOIN  courses AS c ON  e.course_id  =  c.id WHERE  c.name  =  "Masters" AND  c.name  =  "Bachelors"<eos>
____________________________________________________________________________________________________
Original query:
SELECT count(DISTINCT current_address_id) FROM Students
Generated query:


SELECT DISTINCT address FROM student<eos>
____________________________________________________________________________________________________
Original query:
SELECT count(DISTINCT current_address_id) FROM Students
Generated query:


SELECT DISTINCT address FROM student<eos>
____________________________________________________________________________________________________
Original query:
SELECT other_student_details FROM Students ORDER BY other_student_details DESC
Generated query:


SELECT  * FROM student ORDER BY name DESC<eos>
____________________________________________________________________________________________________
Original query:
SELECT other_student_details FROM Students ORDER BY other_student_details DESC
Generated query:


SELECT  * FROM  student ORDER BY  last_name<eos>
____________________________________________________________________________________________________
Original query:
SELECT section_description FROM Sections WHERE section_name  =  'h'
Generated query:


SELECT  * FROM  section WHERE  section_name  =  'h'<eos>
____________________________________________________________________________________________________
Original query:
SELECT section_description FROM Sections WHERE section_name  =  'h'
Generated query:


SELECT  description FROM  section WHERE  section_name  =  'h'<eos>
____________________________________________________________________________________________________
Original query:
select t1.first_name from students as t1 join addresses as t2 on t1.permanent_address_id  =  t2.address_id where t2.country  =  'haiti' or t1.cell_mobile_number  =  '09700166582'
Generated query:


SELECT  firstname FROM student WHERE country  =  'Haiti' OR cell_phone  =  '09700166582'<eos>
____________________________________________________________________________________________________
Original query:
select t1.first_name from students as t1 join addresses as t2 on t1.permanent_address_id  =  t2.address_id where t2.country  =  'haiti' or t1.cell_mobile_number  =  '09700166582'
Generated query:


SELECT  firstname FROM student WHERE country_code = 'HT' OR cell_phone_number = '09700166582'<eos>
____________________________________________________________________________________________________
Original query:
SELECT Title FROM Cartoon ORDER BY title
Generated query:
 <strong>SELECT title FROM cartoon ORDER BY title</strong><eos>
____________________________________________________________________________________________________
Original query:
SELECT Title FROM Cartoon ORDER BY title
Generated query:


SELECT title FROM  cartoon ORDER BY title<eos>
____________________________________________________________________________________________________
Original query:
SELECT Title FROM Cartoon WHERE Directed_by = "Ben Jones";
Generated query:


SELECT * FROM cartoon WHERE director = "Ben Jones"<eos>
____________________________________________________________________________________________________
Original query:
SELECT Title FROM Cartoon WHERE Directed_by = "Ben Jones";
Generated query:


SELECT  c.name FROM cartoons AS c JOIN directors AS d ON c.id = d.cartoon_id WHERE d.name = 'Ben Jones'<eos>
____________________________________________________________________________________________________
Original query:
SELECT count(*) FROM Cartoon WHERE Written_by = "Joseph Kuhr";
Generated query:


SELECT count(*) FROM cartoons WHERE author = "Joseph Kuhr"<eos>
____________________________________________________________________________________________________
Original query:
SELECT count(*) FROM Cartoon WHERE Written_by = "Joseph Kuhr";
Generated query:


SELECT COUNT(*) FROM cartoones WHERE author = 'Joseph Kuhr'<eos>
____________________________________________________________________________________________________
Original query:
SELECT title ,  Directed_by FROM Cartoon ORDER BY Original_air_date
Generated query:


SELECT  title ,  director  FROM  cartoon  ORDER BY air_date<eos>
____________________________________________________________________________________________________
Original query:
SELECT title ,  Directed_by FROM Cartoon ORDER BY Original_air_date
Generated query:


SELECT  c.name ,  c.director FROM  cartoon AS c JOIN order AS o ON  c.id  =  o.cartoon_id ORDER BY  o.air_date<eos>
____________________________________________________________________________________________________
Original query:
SELECT Title FROM Cartoon WHERE Directed_by = "Ben Jones" OR Directed_by = "Brandon Vietti";
Generated query:


SELECT title FROM cartoon WHERE director IN ('Ben Jones', 'Brandon Vietti')<eos>
____________________________________________________________________________________________________
Original query:
SELECT Title FROM Cartoon WHERE Directed_by = "Ben Jones" OR Directed_by = "Brandon Vietti";
Generated query:


SELECT title FROM cartoon WHERE director_name IN ('Ben Jones', 'Brandon Vietti')<eos>
____________________________________________________________________________________________________
Original query:
SELECT Country ,  count(*) FROM TV_Channel GROUP BY Country ORDER BY count(*) DESC LIMIT 1;
Generated query:


SELECT country , count(*) FROM tv_channel GROUP BY country ORDER BY count(*) DESC LIMIT 1<eos>
____________________________________________________________________________________________________
Original query:
SELECT Country ,  count(*) FROM TV_Channel GROUP BY Country ORDER BY count(*) DESC LIMIT 1;
Generated query:


SELECT country , count(*) FROM tv_channel GROUP BY country ORDER BY count(*) DESC LIMIT 1<eos>
____________________________________________________________________________________________________
Original query:
SELECT count(DISTINCT series_name) ,  count(DISTINCT content) FROM TV_Channel;
Generated query:
 <strong>SELECT COUNT(*) FROM TV_CHANNEL</strong><eos>
____________________________________________________________________________________________________
Original query:
SELECT count(DISTINCT series_name) ,  count(DISTINCT content) FROM TV_Channel;
Generated query:


SELECT COUNT(*) FROM TV_CHANNEL<eos>
____________________________________________________________________________________________________
Original query:
SELECT Content FROM TV_Channel WHERE series_name = "Sky Radio";
Generated query:


SELECT  * FROM  TV_Channel WHERE  Serial_Name  =  "Sky Radio"<eos>
____________________________________________________________________________________________________
Original query:
SELECT Content FROM TV_Channel WHERE series_name = "Sky Radio";
Generated query:



,db_id,query,question,query_toks,query_toks_no_value,question_toks,modified question,generated_query
572,student_transcripts_tracking,"SELECT count(*) , student_course_id FROM Tran...",What is the maximum number of times that a cou...,"[SELECT, count, (, *, ), ,, student_course_id,...","[select, count, (, *, ), ,, student_course_id,...","[What, is, the, maximum, number, of, times, th...","""Write a query that answers the following ques...","\n\nSELECT MAX(count) , course_id FROM (SE..."
573,student_transcripts_tracking,"SELECT T2.transcript_date , T1.transcript_id ...",Show the date of the transcript which shows th...,"[SELECT, T2.transcript_date, ,, T1.transcript_...","[select, t2, ., transcript_date, ,, t1, ., tra...","[Show, the, date, of, the, transcript, which, ...","""Write a query that answers the following ques...","\n\nSELECT t.date , t.id FROM transcript ..."
574,student_transcripts_tracking,"SELECT T2.transcript_date , T1.transcript_id ...",What is the date and id of the transcript with...,"[SELECT, T2.transcript_date, ,, T1.transcript_...","[select, t2, ., transcript_date, ,, t1, ., tra...","[What, is, the, date, and, id, of, the, transc...","""Write a query that answers the following ques...","\n\nSELECT t.date , t.id FROM transcript ..."
575,student_transcripts_tracking,SELECT DISTINCT T2.semester_id FROM Degree_Pro...,Find the semester when both Master students an...,"[SELECT, DISTINCT, T2.semester_id, FROM, Degre...","[select, distinct, t2, ., semester_id, from, d...","[Find, the, semester, when, both, Master, stud...","""Write a query that answers the following ques...",\n\nSELECT semester FROM (SELECT * FROM s...
576,student_transcripts_tracking,SELECT DISTINCT T2.semester_id FROM Degree_Pro...,What is the id of the semester that had both M...,"[SELECT, DISTINCT, T2.semester_id, FROM, Degre...","[select, distinct, t2, ., semester_id, from, d...","[What, is, the, id, of, the, semester, that, h...","""Write a query that answers the following ques...",\n\nSELECT s.id FROM students AS s JOIN en...
577,student_transcripts_tracking,SELECT count(DISTINCT current_address_id) FROM...,How many different addresses do the students c...,"[SELECT, count, (, DISTINCT, current_address_i...","[select, count, (, distinct, current_address_i...","[How, many, different, addresses, do, the, stu...","""Write a query that answers the following ques...",\n\nSELECT DISTINCT address FROM student
578,student_transcripts_tracking,SELECT count(DISTINCT current_address_id) FROM...,What are the different addresses that have stu...,"[SELECT, count, (, DISTINCT, current_address_i...","[select, count, (, distinct, current_address_i...","[What, are, the, different, addresses, that, h...","""Write a query that answers the following ques...",\n\nSELECT DISTINCT address FROM student
579,student_transcripts_tracking,SELECT other_student_details FROM Students ORD...,List all the student details in reversed lexic...,"[SELECT, other_student_details, FROM, Students...","[select, other_student_details, from, students...","[List, all, the, student, details, in, reverse...","""Write a query that answers the following ques...",\n\nSELECT * FROM student ORDER BY name DESC
580,student_transcripts_tracking,SELECT other_student_details FROM Students ORD...,What other details can you tell me about stude...,"[SELECT, other_student_details, FROM, Students...","[select, other_student_details, from, students...","[What, other, details, can, you, tell, me, abo...","""Write a query that answers the following ques...",\n\nSELECT * FROM student ORDER BY last_name
581,student_transcripts_tracking,SELECT section_description FROM Sections WHERE...,Describe the section h.,"[SELECT, section_description, FROM, Sections, ...","[select, section_description, from, sections, ...","[Describe, the, section, h, .]","""Write a query that answers the following ques...",\n\nSELECT * FROM section WHERE section_na...
582,student_transcripts_tracking,SELECT section_description FROM Sections WHERE...,What is the description for the section named h?,"[SELECT, section_description, FROM, Sections, ...","[select, section_description, from, sections, ...","[What, is, the, description, for, the, section...","""Write a query that answers the following ques...",\n\nSELECT description FROM section WHERE ...
583,student_transcripts_tracking,select t1.first_name from students as t1 join ...,Find the first name of the students who perman...,"[select, t1.first_name, from, students, as, t1...","[select, t1, ., first_name, from, students, as...","[Find, the, first, name, of, the, students, wh...","""Write a query that answers the following ques...",\n\nSELECT firstname FROM student WHERE coun...
584,student_transcripts_tracking,select t1.first_name from students as t1 join ...,What are the first names of the students who l...,"[select, t1.first_name, from, students, as, t1...","[select, t1, ., first_name, from, students, as...","[What, are, the, first, names, of, the, studen...","""Write a query that answers the following ques...",\n\nSELECT firstname FROM student WHERE coun...
585,tvshow,SELECT Title FROM Cartoon ORDER BY title,List the title of all cartoons in alphabetical...,"[SELECT, Title, FROM, Cartoon, ORDER, BY, title]","[select, title, from, cartoon, order, by, title]","[List, the, title, of, all, cartoons, in, alph...","""Write a query that answers the following ques...",<strong>SELECT title FROM cartoon ORDER BY ti...
586,tvshow,SELECT Title FROM Cartoon ORDER BY title,What are the titles of the cartoons sorted alp...,"[SELECT, Title, FROM, Cartoon, ORDER, BY, title]","[select, title, from, cartoon, order, by, title]","[What, are, the, titles, of, the, cartoons, so...","""Write a query that answers the following ques...",\n\nSELECT title FROM cartoon ORDER BY title
587,tvshow,SELECT Title FROM Cartoon WHERE Directed_by = ...,"List all cartoon directed by ""Ben Jones"".","[SELECT, Title, FROM, Cartoon, WHERE, Directed...","[select, title, from, cartoon, where, directed...","[List, all, cartoon, directed, by, ``, Ben, Jo...","""Write a query that answers the following ques...","\n\nSELECT * FROM cartoon WHERE director = ""B..."
588,tvshow,SELECT Title FROM Cartoon WHERE Directed_by = ...,What are the names of all cartoons directed by...,"[SELECT, Title, FROM, Cartoon, WHERE, Directed...","[select, title, from, cartoon, where, directed...","[What, are, the, names, of, all, cartoons, dir...","""Write a query that answers the following ques...",\n\nSELECT c.name FROM cartoons AS c JOIN di...
589,tvshow,SELECT count(*) FROM Cartoon WHERE Written_by ...,"How many cartoons were written by ""Joseph Kuhr""?","[SELECT, count, (, *, ), FROM, Cartoon, WHERE,...","[select, count, (, *, ), from, cartoon, where,...","[How, many, cartoons, were, written, by, ``, J...","""Write a query that answers the following ques...",\n\nSELECT count(*) FROM cartoons WHERE autho...
590,tvshow,SELECT count(*) FROM Cartoon WHERE Written_by ...,What is the number of cartoones written by Jos...,"[SELECT, count, (, *, ), FROM, Cartoon, WHERE,...","[select, count, (, *, ), from, cartoon, where,...","[What, is, the, number, of, cartoones, written...","""Write a query that answers the following ques...",\n\nSELECT COUNT(*) FROM cartoones WHERE auth...
591,tvshow,"SELECT title , Directed_by FROM Cartoon ORDER...",list all cartoon titles and their directors or...,"[SELECT, title, ,, Directed_by, FROM, Cartoon,...","[select, title, ,, directed_by, from, cartoon,...","[list, all, cartoon, titles, and, their, direc...","""Write a query that answers the following ques...","\n\nSELECT title , director FROM cartoon ..."
592,tvshow,"SELECT title , Directed_by FROM Cartoon ORDER...",What is the name and directors of all the cart...,"[SELECT, title, ,, Directed_by, FROM, Cartoon,...","[select, title, ,, directed_by, from, cartoon,...","[What, is, the, name, and, directors, of, all,...","""Write a query that answers the following ques...","\n\nSELECT c.name , c.director FROM cartoo..."
593,tvshow,SELECT Title FROM Cartoon WHERE Directed_by = ...,"List the title of all cartoon directed by ""Ben...","[SELECT, Title, FROM, Cartoon, WHERE, Directed...","[select, title, from, cartoon, where, directed...","[List, the, title, of, all, cartoon, directed,...","""Write a query that answers the following ques...",\n\nSELECT title FROM cartoon WHERE director ...
594,tvshow,SELECT Title FROM Cartoon WHERE Directed_by = ...,What are the titles of all cartoons directed b...,"[SELECT, Title, FROM, Cartoon, WHERE, Directed...","[select, title, from, cartoon, where, directed...","[What, are, the, titles, of, all, cartoons, di...","""Write a query that answers the following ques...",\n\nSELECT title FROM cartoon WHERE director_...
595,tvshow,"SELECT Country , count(*) FROM TV_Channel GRO...",Which country has the most of TV Channels? Lis...,"[SELECT, Country, ,, count, (, *, ), FROM, TV_...","[select, country, ,, count, (, *, ), from, tv_...","[Which, country, has, the, most, of, TV, Chann...","""Write a query that answers the following ques...","\n\nSELECT country , count(*) FROM tv_channel..."
596,tvshow,"SELECT Country , count(*) FROM TV_Channel GRO...",What is the country with the most number of TV...,"[SELECT, Country, ,, count, (, *, ), FROM, TV_...","[select, country, ,, count, (, *, ), from, tv_...","[What, is, the, country, with, the, most, numb...","""Write a query that answers the following ques...","\n\nSELECT country , count(*) FROM tv_channel..."
597,tvshow,"SELECT count(DISTINCT series_name) , count(DI...",List the number of different series names and ...,"[SELECT, count, (, DISTINCT, series_name, ), ,...","[select, count, (, distinct, series_name, ), ,...","[List, the, number, of, different, series, nam...","""Write a query that answers the following ques...",<strong>SELECT COUNT(*) FROM TV_CHANNEL</strong>
598,tvshow,"SELECT count(DISTINCT series_name) , count(DI...",How many different series and contents are lis...,"[SELECT, count, (, DISTINCT, series_name, ), ,...","[select, count, (, distinct, series_name, ), ,...","[How, many, different, series, and, contents, ...","""Write a query that answers the following ques...",\n\nSELECT COUNT(*) FROM TV_CHANNEL
599,tvshow,SELECT Content FROM TV_Channel WHERE series_na...,What is the content of TV Channel with serial ...,"[SELECT, Content, FROM, TV_Channel, WHERE, ser...","[select, content, from, tv_channel, where, ser...","[What, is, the, content, of, TV, Channel, with...","""Write a query that answers the following ques...",\n\nSELECT * FROM TV_Channel WHERE Serial_...
600,tvshow,SELECT Content FROM TV_Channel WHERE series_na...,What is the content of the series Sky Radio?,"[SELECT, Content, FROM, TV_Channel, WHERE, ser...","[select, content, from, tv_channel, where, ser...","[What, is, the, content, of, the, series, Sky,...","""Write a query that answers the following ques...",\n\nSELECT * FROM series WHERE series_name...
601,tvshow,SELECT Package_Option FROM TV_Channel WHERE se...,What is the Package Option of TV Channel with ...,"[SELECT, Package_Option, FROM, TV_Channel, WHE...","[select, package_option, from, tv_channel, whe...","[What, is, the, Package, Option, of, TV, Chann...","""Write a query that answers the following ques...",\n\nSELECT Package_Option FROM TV_Channel W...
602,tvshow,SELECT Package_Option FROM TV_Channel WHERE se...,What are the Package Options of the TV Channel...,"[SELECT, Package_Option, FROM, TV_Channel, WHE...","[select, package_option, from, tv_channel, whe...","[What, are, the, Package, Options, of, the, TV...","""Write a query that answers the following ques...",\n\nSELECT Package_Option FROM Package WHER...
603,tvshow,SELECT count(*) FROM TV_Channel WHERE LANGUAGE...,How many TV Channel using language English?,"[SELECT, count, (, *, ), FROM, TV_Channel, WHE...","[select, count, (, *, ), from, tv_channel, whe...","[How, many, TV, Channel, using, language, Engl...","""Write a query that answers the following ques...",\n\nSELECT count(*) FROM channel WHERE langua...
604,tvshow,SELECT count(*) FROM TV_Channel WHERE LANGUAGE...,How many TV Channels use the English language?,"[SELECT, count, (, *, ), FROM, TV_Channel, WHE...","[select, count, (, *, ), from, tv_channel, whe...","[How, many, TV, Channels, use, the, English, l...","""Write a query that answers the following ques...",\n\nSELECT count(*) FROM channel WHERE langua...
605,tvshow,"SELECT LANGUAGE , count(*) FROM TV_Channel GR...",List the language used least number of TV Chan...,"[SELECT, LANGUAGE, ,, count, (, *, ), FROM, TV...","[select, language, ,, count, (, *, ), from, tv...","[List, the, language, used, least, number, of,...","""Write a query that answers the following ques...","<strong>SELECT language , count(*) FROM TV_C..."
606,tvshow,"SELECT LANGUAGE , count(*) FROM TV_Channel GR...",What are the languages used by the least numbe...,"[SELECT, LANGUAGE, ,, count, (, *, ), FROM, TV...","[select, language, ,, count, (, *, ), from, tv...","[What, are, the, languages, used, by, the, lea...","""Write a query that answers the following ques...","\n\nSELECT language , count(*) FROM tv_cha..."
607,tvshow,"SELECT LANGUAGE , count(*) FROM TV_Channel GR...",List each language and the number of TV Channe...,"[SELECT, LANGUAGE, ,, count, (, *, ), FROM, TV...","[select, language, ,, count, (, *, ), from, tv...","[List, each, language, and, the, number, of, T...","""Write a query that answers the following ques...","\n\nSELECT language , count(*) FROM tv_cha..."
608,tvshow,"SELECT LANGUAGE , count(*) FROM TV_Channel GR...","For each language, list the number of TV Chann...","[SELECT, LANGUAGE, ,, count, (, *, ), FROM, TV...","[select, language, ,, count, (, *, ), from, tv...","[For, each, language, ,, list, the, number, of...","""Write a query that answers the following ques...","\n\nSELECT language , count(*) FROM tv_cha..."
609,tvshow,SELECT T1.series_name FROM TV_Channel AS T1 JO...,What is the TV Channel that shows the cartoon ...,"[SELECT, T1.series_name, FROM, TV_Channel, AS,...","[select, t1, ., series_name, from, tv_channel,...","[What, is, the, TV, Channel, that, shows, the,...","""Write a query that answers the following ques...",\n\nSELECT series_name FROM TV_Channel WHER...
610,tvshow,SELECT T1.series_name FROM TV_Channel AS T1 JO...,What is the series name of the TV Channel that...,"[SELECT, T1.series_name, FROM, TV_Channel, AS,...","[select, t1, ., series_name, from, tv_channel,...","[What, is, the, series, name, of, the, TV, Cha...","""Write a query that answers the following ques...",\n\nSELECT series_name FROM tv_channel WHERE ...
611,tvshow,SELECT T2.Title FROM TV_Channel AS T1 JOIN Car...,List the title of all Cartoons showed on TV C...,"[SELECT, T2.Title, FROM, TV_Channel, AS, T1, J...","[select, t2, ., title, from, tv_channel, as, t...","[List, the, title, of, all, Cartoons, showed, ...","""Write a query that answers the following ques...",\n\nSELECT title FROM Cartoons WHERE serie...
612,tvshow,SELECT T2.Title FROM TV_Channel AS T1 JOIN Car...,What is the title of all the cartools that are...,"[SELECT, T2.Title, FROM, TV_Channel, AS, T1, J...","[select, t2, ., title, from, tv_channel, as, t...","[What, is, the, title, of, all, the, cartools,...","""Write a query that answers the following ques...",\n\nSELECT title FROM cartools WHERE channel_...
613,tvshow,SELECT Episode FROM TV_series ORDER BY rating,List the Episode of all TV series sorted by ra...,"[SELECT, Episode, FROM, TV_series, ORDER, BY, ...","[select, episode, from, tv_series, order, by, ...","[List, the, Episode, of, all, TV, series, sort...","""Write a query that answers the following ques...",\n\nSELECT * FROM Episode ORDER BY rating
614,tvshow,SELECT Episode FROM TV_series ORDER BY rating,What are all of the episodes ordered by ratings?,"[SELECT, Episode, FROM, TV_series, ORDER, BY, ...","[select, episode, from, tv_series, order, by, ...","[What, are, all, of, the, episodes, ordered, b...","""Write a query that answers the following ques...",\n\nSELECT * FROM episode ORDER BY rating
615,tvshow,"SELECT Episode , Rating FROM TV_series ORDER ...",List top 3 highest Rating TV series. List the...,"[SELECT, Episode, ,, Rating, FROM, TV_series, ...","[select, episode, ,, rating, from, tv_series, ...","[List, top, 3, highest, Rating, TV, series, .,...","""Write a query that answers the following ques...","\n\nSELECT TOP 3 TV_Series.Rating , TV_Seri..."
616,tvshow,"SELECT Episode , Rating FROM TV_series ORDER ...",What are 3 most highly rated episodes in the T...,"[SELECT, Episode, ,, Rating, FROM, TV_series, ...","[select, episode, ,, rating, from, tv_series, ...","[What, are, 3, most, highly, rated, episodes, ...","""Write a query that answers the following ques...","\n\nSELECT TOP 3 Episode_Title , Rating FRO..."
617,tvshow,"SELECT max(SHARE) , min(SHARE) FROM TV_series;",What is minimum and maximum share of TV series?,"[SELECT, max, (, SHARE, ), ,, min, (, SHARE, )...","[select, max, (, share, ), ,, min, (, share, )...","[What, is, minimum, and, maximum, share, of, T...","""Write a query that answers the following ques...","\n\nSELECT MIN(share) , MAX(share) FROM tv_se..."
618,tvshow,"SELECT max(SHARE) , min(SHARE) FROM TV_series;",What is the maximum and minimum share for the ...,"[SELECT, max, (, SHARE, ), ,, min, (, SHARE, )...","[select, max, (, share, ), ,, min, (, share, )...","[What, is, the, maximum, and, minimum, share, ...","""Write a query that answers the following ques...","\n\nSELECT MAX(share) , MIN(share) FROM tv_se..."
619,tvshow,SELECT Air_Date FROM TV_series WHERE Episode =...,What is the air date of TV series with Episode...,"[SELECT, Air_Date, FROM, TV_series, WHERE, Epi...","[select, air_date, from, tv_series, where, epi...","[What, is, the, air, date, of, TV, series, wit...","""Write a query that answers the following ques...",\n\nSELECT a.air_date FROM tv_series AS a JO...
620,tvshow,SELECT Air_Date FROM TV_series WHERE Episode =...,"When did the episode ""A Love of a Lifetime"" air?","[SELECT, Air_Date, FROM, TV_series, WHERE, Epi...","[select, air_date, from, tv_series, where, epi...","[When, did, the, episode, ``, A, Love, of, a, ...","""Write a query that answers the following ques...",\nSELECT episode_air_date_year FROM episodes...
621,tvshow,SELECT Weekly_Rank FROM TV_series WHERE Episod...,What is Weekly Rank of TV series with Episode ...,"[SELECT, Weekly_Rank, FROM, TV_series, WHERE, ...","[select, weekly_rank, from, tv_series, where, ...","[What, is, Weekly, Rank, of, TV, series, with,...","""Write a query that answers the following ques...","\n\nSELECT * FROM ""TV_Series"" WHERE ""Episo..."
622,tvshow,SELECT Weekly_Rank FROM TV_series WHERE Episod...,"What is the weekly rank for the episode ""A Lov...","[SELECT, Weekly_Rank, FROM, TV_series, WHERE, ...","[select, weekly_rank, from, tv_series, where, ...","[What, is, the, weekly, rank, for, the, episod...","""Write a query that answers the following ques...","\n\nSELECT * FROM ""episode"" WHERE ""episode..."
623,tvshow,SELECT T1.series_name FROM TV_Channel AS T1 JO...,What is the TV Channel of TV series with Episo...,"[SELECT, T1.series_name, FROM, TV_Channel, AS,...","[select, t1, ., series_name, from, tv_channel,...","[What, is, the, TV, Channel, of, TV, series, w...","""Write a query that answers the following ques...",\n\nSELECT TV_Channel.Series_Name FROM TV_Ch...

====================================================================================================
(52, 7)
Input:  ['"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the name of the series that has the episode "A Love of a Lifetime"? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> List the Episode of all  TV series showed on TV Channel with series name "Sky Radio". <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the episode for the TV series named "Sky Radio"? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Find the number of cartoons directed by each of the listed directors. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> How many cartoons did each director create? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Find the production code and channel of the most recently aired cartoon . <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the produdction code and channel of the most recent cartoon ? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Find the package choice and series name of the TV channel that has high definition TV. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the package options and the name of the series for the TV Channel that supports high definition TV? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> which countries\' tv channels are playing some cartoon written by Todd Casey? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the countries that have cartoons on TV that were written by Todd Casey? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> which countries\' tv channels are not playing any cartoon written by Todd Casey? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the countries that are not playing cartoons written by Todd Casey? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Find the series name and country of the tv channel that is playing some cartoons directed by Ben Jones and Michael Chang? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the series name and country of all TV channels that are playing cartoons directed by Ben Jones and cartoons directed by Michael Chang? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> find the pixel aspect ratio and nation of the tv channels that do not use English. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the pixel aspect ratio and country of origin for all TV channels that do not use English? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> find id of the tv channels that from the countries where have more than two tv channels. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the ids of all tv channels that have more than 2 TV channels? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> find the id of tv channels that do not play any cartoon directed by Ben Jones. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the ids of the TV channels that do not have any cartoons directed by Ben Jones? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> find the package option of the tv channel that do not have any cartoon directed by Ben Jones. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the package options of all tv channels that are not playing any cartoons directed by Ben Jones? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> How many poker players are there? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Count the number of poker players. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> List the earnings of poker players in descending order. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the earnings of poker players, ordered descending by value? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> List the final tables made and the best finishes of poker players. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the final tables made and best finishes for all poker players? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the average earnings of poker players? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Return the average earnings across all poker players. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the money rank of the poker player with the highest earnings? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Return the money rank of the player with the greatest earnings. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the maximum number of final tables made among poker players with earnings less than 200000? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Return the maximum final tables made across all poker players who have earnings below 200000. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the names of poker players? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Return the names of all the poker players. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the names of poker players whose earnings is higher than 300000? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Give the names of poker players who have earnings above 300000. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> List the names of poker players ordered by the final tables made in ascending order. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the names of poker players, ordered ascending by the number of final tables they have made? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the birth date of the poker player with the lowest earnings? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Return the birth date of the poker player with the lowest earnings. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the money rank of the tallest poker player? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Return the money rank of the poker player with the greatest height. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the average earnings of poker players with height higher than 200? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Give average earnings of poker players who are taller than 200. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the names of poker players in descending order of earnings? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Return the names of poker players sorted by their earnings descending. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are different nationalities of people and the corresponding number of people from each nation? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> How many people are there of each nationality? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the most common nationality of people? <query> ']
Original query:
SELECT T1.series_name FROM TV_Channel AS T1 JOIN TV_series AS T2 ON T1.id = T2.Channel WHERE T2.Episode = "A Love of a Lifetime";
Generated query:


SELECT  series_name FROM series WHERE episode_name = "A Love of a Lifetime"<eos>
____________________________________________________________________________________________________
Original query:
SELECT T2.Episode FROM TV_Channel AS T1 JOIN TV_series AS T2 ON T1.id = T2.Channel WHERE T1.series_name = "Sky Radio";
Generated query:


SELECT  * FROM  TV_Channel  WHERE  series_name  =  "Sky Radio"<eos>
____________________________________________________________________________________________________
Original query:
SELECT T2.Episode FROM TV_Channel AS T1 JOIN TV_series AS T2 ON T1.id = T2.Channel WHERE T1.series_name = "Sky Radio";
Generated query:


SELECT  * FROM  episode WHERE  title  =  "Sky Radio"<eos>
____________________________________________________________________________________________________
Original query:
SELECT count(*) ,  Directed_by FROM cartoon GROUP BY Directed_by
Generated query:
 <strong>SELECT</strong> count(*) FROM cartoon_director WHERE director_name IN ('John Lasseter', 'Hayao Miyazaki', 'Peter Ramsey')<eos>
____________________________________________________________________________________________________
Original query:
SELECT count(*) ,  Directed_by FROM cartoon GROUP BY Directed_by
Generated query:


SELECT count(*) FROM  "Cartoon" GROUP BY  "Director"<eos>
____________________________________________________________________________________________________
Original query:
select production_code ,  channel from cartoon order by original_air_date desc limit 1
Generated query:


SELECT  production_code , channel FROM  cartoon ORDER BY aired_date DESC LIMIT 1<eos>
____________________________________________________________________________________________________
Original query:
select production_code ,  channel from cartoon order by original_air_date desc limit 1
Generated query:


SELECT  production_code , channel FROM  cartoon ORDER BY  production_code DESC LIMIT 1<eos>
____________________________________________________________________________________________________
Original query:
SELECT package_option ,  series_name FROM TV_Channel WHERE hight_definition_TV  =  "yes"
Generated query:
 <strong>SELECT package_choice , series_name FROM channel WHERE channel_type = 'TV' AND channel_series_type = 'HD' ORDER BY channel_series_type</strong><eos>
____________________________________________________________________________________________________
Original query:
SELECT package_option ,  series_name FROM TV_Channel WHERE hight_definition_TV  =  "yes"
Generated query:


SELECT  package_option ,  series_name  FROM  package  WHERE  package_option  =  'HDTV'<eos>
____________________________________________________________________________________________________
Original query:
SELECT T1.country FROM TV_Channel AS T1 JOIN cartoon AS T2 ON T1.id = T2.Channel WHERE T2.written_by  =  'Todd Casey'
Generated query:


SELECT  c.country_name ,  c.channel_name  FROM  channel  AS  c  JOIN  tv_channel  AS  t  ON  c.channel_id  =  t.channel_id  JOIN  tv_show  AS  s  ON  t.tv_show_id  =  s.tv_show_id  JOIN  tv_writer  AS  w  ON  s.tv_show_id  =  w.tv_show_id  WHERE  w.writer_name  =  'Todd Casey'<eos>
____________________________________________________________________________________________________
Original query:
SELECT T1.country FROM TV_Channel AS T1 JOIN cartoon AS T2 ON T1.id = T2.Channel WHERE T2.written_by  =  'Todd Casey'
Generated query:


SELECT  country FROM cartoons WHERE writer = 'Todd Casey'<eos>
____________________________________________________________________________________________________
Original query:
SELECT country FROM TV_Channel EXCEPT SELECT T1.country FROM TV_Channel AS T1 JOIN cartoon AS T2 ON T1.id = T2.Channel WHERE T2.written_by  =  'Todd Casey'
Generated query:


SELECT  country_name FROM  tv_channel WHERE  channel_name  NOT  IN  (SELECT  channel_name FROM  tv_channel WHERE  channel_name  LIKE  'T%'  AND  channel_name  LIKE  'C%'  AND  channel_name  LIKE  'C%')<eos>
____________________________________________________________________________________________________
Original query:
SELECT country FROM TV_Channel EXCEPT SELECT T1.country FROM TV_Channel AS T1 JOIN cartoon AS T2 ON T1.id = T2.Channel WHERE T2.written_by  =  'Todd Casey'
Generated query:


SELECT DISTINCT country FROM cartoons WHERE writer = 'Todd Casey' AND country NOT IN (SELECT country FROM cartoons WHERE writer = 'Todd Casey')<eos>
____________________________________________________________________________________________________
Original query:
SELECT T1.series_name ,  T1.country FROM TV_Channel AS T1 JOIN cartoon AS T2 ON T1.id = T2.Channel WHERE T2.directed_by  =  'Michael Chang' INTERSECT SELECT T1.series_name ,  T1.country FROM TV_Channel AS T1 JOIN cartoon AS T2 ON T1.id = T2.Channel WHERE T2.directed_by  =  'Ben Jones'
Generated query:


SELECT series_name , country FROM tv_channel WHERE channel_name  =  "Ben Jones" AND channel_name  =  "Michael Chang"<eos>
____________________________________________________________________________________________________
Original query:
SELECT T1.series_name ,  T1.country FROM TV_Channel AS T1 JOIN cartoon AS T2 ON T1.id = T2.Channel WHERE T2.directed_by  =  'Michael Chang' INTERSECT SELECT T1.series_name ,  T1.country FROM TV_Channel AS T1 JOIN cartoon AS T2 ON T1.id = T2.Channel WHERE T2.directed_by  =  'Ben Jones'
Generated query:


SELECT  series_name ,  country  FROM  channel  WHERE  channel_id  IN  ( SELECT  channel_id  FROM  channel_series  WHERE  series_id  IN  ( SELECT  series_id  FROM  series  WHERE  series_director  IN  ( SELECT  series_director  FROM  series  WHERE  series_director  =  'Ben Jones'  OR  series_director  =  'Michael Chang'  )  )  )<eos>
____________________________________________________________________________________________________
Original query:
SELECT Pixel_aspect_ratio_PAR ,  country FROM tv_channel WHERE LANGUAGE != 'English'
Generated query:


SELECT  channel_name ,  pixel_aspect_ratio ,  country  FROM  channel  WHERE  language  <>  'English'<eos>
____________________________________________________________________________________________________
Original query:
SELECT Pixel_aspect_ratio_PAR ,  country FROM tv_channel WHERE LANGUAGE != 'English'
Generated query:


SELECT  channel_aspect_ratio ,  country_origin FROM  channel WHERE  channel_language <> 'English'<eos>
____________________________________________________________________________________________________
Original query:
SELECT id FROM tv_channel GROUP BY country HAVING count(*)  >  2
Generated query:


SELECT  t1.channel_id FROM tv_channels AS t1 JOIN tv_channels AS t2 ON t1.country_id = t2.country_id GROUP BY t1.channel_id HAVING COUNT(*) > 2<eos>
____________________________________________________________________________________________________
Original query:
SELECT id FROM tv_channel GROUP BY country HAVING count(*)  >  2
Generated query:


SELECT  channel_id FROM tv_channel WHERE  count(*) > 2<eos>
____________________________________________________________________________________________________
Original query:
SELECT id FROM TV_Channel EXCEPT SELECT channel FROM cartoon WHERE directed_by  =  'Ben Jones'
Generated query:



,db_id,query,question,query_toks,query_toks_no_value,question_toks,modified question,generated_query
624,tvshow,SELECT T1.series_name FROM TV_Channel AS T1 JO...,What is the name of the series that has the ep...,"[SELECT, T1.series_name, FROM, TV_Channel, AS,...","[select, t1, ., series_name, from, tv_channel,...","[What, is, the, name, of, the, series, that, h...","""Write a query that answers the following ques...",\n\nSELECT series_name FROM series WHERE epi...
625,tvshow,SELECT T2.Episode FROM TV_Channel AS T1 JOIN T...,List the Episode of all TV series showed on T...,"[SELECT, T2.Episode, FROM, TV_Channel, AS, T1,...","[select, t2, ., episode, from, tv_channel, as,...","[List, the, Episode, of, all, TV, series, show...","""Write a query that answers the following ques...",\n\nSELECT * FROM TV_Channel WHERE series...
626,tvshow,SELECT T2.Episode FROM TV_Channel AS T1 JOIN T...,"What is the episode for the TV series named ""S...","[SELECT, T2.Episode, FROM, TV_Channel, AS, T1,...","[select, t2, ., episode, from, tv_channel, as,...","[What, is, the, episode, for, the, TV, series,...","""Write a query that answers the following ques...",\n\nSELECT * FROM episode WHERE title = ...
627,tvshow,"SELECT count(*) , Directed_by FROM cartoon GR...",Find the number of cartoons directed by each o...,"[SELECT, count, (, *, ), ,, Directed_by, FROM,...","[select, count, (, *, ), ,, directed_by, from,...","[Find, the, number, of, cartoons, directed, by...","""Write a query that answers the following ques...",<strong>SELECT</strong> count(*) FROM cartoon...
628,tvshow,"SELECT count(*) , Directed_by FROM cartoon GR...",How many cartoons did each director create?,"[SELECT, count, (, *, ), ,, Directed_by, FROM,...","[select, count, (, *, ), ,, directed_by, from,...","[How, many, cartoons, did, each, director, cre...","""Write a query that answers the following ques...","\n\nSELECT count(*) FROM ""Cartoon"" GROUP BY ..."
629,tvshow,"select production_code , channel from cartoon...",Find the production code and channel of the mo...,"[select, production_code, ,, channel, from, ca...","[select, production_code, ,, channel, from, ca...","[Find, the, production, code, and, channel, of...","""Write a query that answers the following ques...","\n\nSELECT production_code , channel FROM c..."
630,tvshow,"select production_code , channel from cartoon...",What is the produdction code and channel of th...,"[select, production_code, ,, channel, from, ca...","[select, production_code, ,, channel, from, ca...","[What, is, the, produdction, code, and, channe...","""Write a query that answers the following ques...","\n\nSELECT production_code , channel FROM c..."
631,tvshow,"SELECT package_option , series_name FROM TV_C...",Find the package choice and series name of the...,"[SELECT, package_option, ,, series_name, FROM,...","[select, package_option, ,, series_name, from,...","[Find, the, package, choice, and, series, name...","""Write a query that answers the following ques...","<strong>SELECT package_choice , series_name F..."
632,tvshow,"SELECT package_option , series_name FROM TV_C...",What are the package options and the name of t...,"[SELECT, package_option, ,, series_name, FROM,...","[select, package_option, ,, series_name, from,...","[What, are, the, package, options, and, the, n...","""Write a query that answers the following ques...","\n\nSELECT package_option , series_name FR..."
633,tvshow,SELECT T1.country FROM TV_Channel AS T1 JOIN c...,which countries' tv channels are playing some ...,"[SELECT, T1.country, FROM, TV_Channel, AS, T1,...","[select, t1, ., country, from, tv_channel, as,...","[which, countries, ', tv, channels, are, playi...","""Write a query that answers the following ques...","\n\nSELECT c.country_name , c.channel_name ..."
634,tvshow,SELECT T1.country FROM TV_Channel AS T1 JOIN c...,What are the countries that have cartoons on T...,"[SELECT, T1.country, FROM, TV_Channel, AS, T1,...","[select, t1, ., country, from, tv_channel, as,...","[What, are, the, countries, that, have, cartoo...","""Write a query that answers the following ques...",\n\nSELECT country FROM cartoons WHERE write...
635,tvshow,SELECT country FROM TV_Channel EXCEPT SELECT T...,which countries' tv channels are not playing a...,"[SELECT, country, FROM, TV_Channel, EXCEPT, SE...","[select, country, from, tv_channel, except, se...","[which, countries, ', tv, channels, are, not, ...","""Write a query that answers the following ques...",\n\nSELECT country_name FROM tv_channel WHE...
636,tvshow,SELECT country FROM TV_Channel EXCEPT SELECT T...,What are the countries that are not playing ca...,"[SELECT, country, FROM, TV_Channel, EXCEPT, SE...","[select, country, from, tv_channel, except, se...","[What, are, the, countries, that, are, not, pl...","""Write a query that answers the following ques...",\n\nSELECT DISTINCT country FROM cartoons WHE...
637,tvshow,"SELECT T1.series_name , T1.country FROM TV_Ch...",Find the series name and country of the tv cha...,"[SELECT, T1.series_name, ,, T1.country, FROM, ...","[select, t1, ., series_name, ,, t1, ., country...","[Find, the, series, name, and, country, of, th...","""Write a query that answers the following ques...","\n\nSELECT series_name , country FROM tv_chan..."
638,tvshow,"SELECT T1.series_name , T1.country FROM TV_Ch...",What is the series name and country of all TV ...,"[SELECT, T1.series_name, ,, T1.country, FROM, ...","[select, t1, ., series_name, ,, t1, ., country...","[What, is, the, series, name, and, country, of...","""Write a query that answers the following ques...","\n\nSELECT series_name , country FROM cha..."
639,tvshow,"SELECT Pixel_aspect_ratio_PAR , country FROM ...",find the pixel aspect ratio and nation of the ...,"[SELECT, Pixel_aspect_ratio_PAR, ,, country, F...","[select, pixel_aspect_ratio_par, ,, country, f...","[find, the, pixel, aspect, ratio, and, nation,...","""Write a query that answers the following ques...","\n\nSELECT channel_name , pixel_aspect_rati..."
640,tvshow,"SELECT Pixel_aspect_ratio_PAR , country FROM ...",What is the pixel aspect ratio and country of ...,"[SELECT, Pixel_aspect_ratio_PAR, ,, country, F...","[select, pixel_aspect_ratio_par, ,, country, f...","[What, is, the, pixel, aspect, ratio, and, cou...","""Write a query that answers the following ques...","\n\nSELECT channel_aspect_ratio , country_o..."
641,tvshow,SELECT id FROM tv_channel GROUP BY country HAV...,find id of the tv channels that from the count...,"[SELECT, id, FROM, tv_channel, GROUP, BY, coun...","[select, id, from, tv_channel, group, by, coun...","[find, id, of, the, tv, channels, that, from, ...","""Write a query that answers the following ques...",\n\nSELECT t1.channel_id FROM tv_channels AS...
642,tvshow,SELECT id FROM tv_channel GROUP BY country HAV...,What are the ids of all tv channels that have ...,"[SELECT, id, FROM, tv_channel, GROUP, BY, coun...","[select, id, from, tv_channel, group, by, coun...","[What, are, the, ids, of, all, tv, channels, t...","""Write a query that answers the following ques...",\n\nSELECT channel_id FROM tv_channel WHERE ...
643,tvshow,SELECT id FROM TV_Channel EXCEPT SELECT channe...,find the id of tv channels that do not play an...,"[SELECT, id, FROM, TV_Channel, EXCEPT, SELECT,...","[select, id, from, tv_channel, except, select,...","[find, the, id, of, tv, channels, that, do, no...","""Write a query that answers the following ques...",\n\nSELECT t.id FROM tv_channel AS t JOIN tv...
644,tvshow,SELECT id FROM TV_Channel EXCEPT SELECT channe...,What are the ids of the TV channels that do no...,"[SELECT, id, FROM, TV_Channel, EXCEPT, SELECT,...","[select, id, from, tv_channel, except, select,...","[What, are, the, ids, of, the, TV, channels, t...","""Write a query that answers the following ques...",\n\nSELECT channel_id FROM channel WHERE c...
645,tvshow,SELECT package_option FROM TV_Channel WHERE id...,find the package option of the tv channel that...,"[SELECT, package_option, FROM, TV_Channel, WHE...","[select, package_option, from, tv_channel, whe...","[find, the, package, option, of, the, tv, chan...","""Write a query that answers the following ques...",\n\nSELECT * FROM package_option WHERE pa...
646,tvshow,SELECT package_option FROM TV_Channel WHERE id...,What are the package options of all tv channel...,"[SELECT, package_option, FROM, TV_Channel, WHE...","[select, package_option, from, tv_channel, whe...","[What, are, the, package, options, of, all, tv...","""Write a query that answers the following ques...",\n\nSELECT * FROM channel_package WHERE ch...
647,poker_player,SELECT count(*) FROM poker_player,How many poker players are there?,"[SELECT, count, (, *, ), FROM, poker_player]","[select, count, (, *, ), from, poker_player]","[How, many, poker, players, are, there, ?]","""Write a query that answers the following ques...",\n\nSELECT count(*) FROM poker_player
648,poker_player,SELECT count(*) FROM poker_player,Count the number of poker players.,"[SELECT, count, (, *, ), FROM, poker_player]","[select, count, (, *, ), from, poker_player]","[Count, the, number, of, poker, players, .]","""Write a query that answers the following ques...",\n\nSELECT COUNT(*) FROM poker_players
649,poker_player,SELECT Earnings FROM poker_player ORDER BY Ear...,List the earnings of poker players in descendi...,"[SELECT, Earnings, FROM, poker_player, ORDER, ...","[select, earnings, from, poker_player, order, ...","[List, the, earnings, of, poker, players, in, ...","""Write a query that answers the following ques...",\n\nSELECT * FROM poker_player ORDER BY ea...
650,poker_player,SELECT Earnings FROM poker_player ORDER BY Ear...,"What are the earnings of poker players, ordere...","[SELECT, Earnings, FROM, poker_player, ORDER, ...","[select, earnings, from, poker_player, order, ...","[What, are, the, earnings, of, poker, players,...","""Write a query that answers the following ques...",\n\nSELECT * FROM poker_player ORDER BY ea...
651,poker_player,"SELECT Final_Table_Made , Best_Finish FROM po...",List the final tables made and the best finish...,"[SELECT, Final_Table_Made, ,, Best_Finish, FRO...","[select, final_table_made, ,, best_finish, fro...","[List, the, final, tables, made, and, the, bes...","""Write a query that answers the following ques...","\n\nSELECT final_table_name , best_finish ..."
652,poker_player,"SELECT Final_Table_Made , Best_Finish FROM po...",What are the final tables made and best finish...,"[SELECT, Final_Table_Made, ,, Best_Finish, FRO...","[select, final_table_made, ,, best_finish, fro...","[What, are, the, final, tables, made, and, bes...","""Write a query that answers the following ques...","\n\nSELECT final_table_name , best_finish ..."
653,poker_player,SELECT avg(Earnings) FROM poker_player,What is the average earnings of poker players?,"[SELECT, avg, (, Earnings, ), FROM, poker_player]","[select, avg, (, earnings, ), from, poker_player]","[What, is, the, average, earnings, of, poker, ...","""Write a query that answers the following ques...",\n\nSELECT AVG(earnings) FROM player WHERE ...
654,poker_player,SELECT avg(Earnings) FROM poker_player,Return the average earnings across all poker p...,"[SELECT, avg, (, Earnings, ), FROM, poker_player]","[select, avg, (, earnings, ), from, poker_player]","[Return, the, average, earnings, across, all, ...","""Write a query that answers the following ques...","\n\nSELECT AVG(earnings) FROM ""public"".""pok..."
655,poker_player,SELECT Money_Rank FROM poker_player ORDER BY E...,What is the money rank of the poker player wit...,"[SELECT, Money_Rank, FROM, poker_player, ORDER...","[select, money_rank, from, poker_player, order...","[What, is, the, money, rank, of, the, poker, p...","""Write a query that answers the following ques...",\n\nSELECT * FROM player_rank WHERE money...
656,poker_player,SELECT Money_Rank FROM poker_player ORDER BY E...,Return the money rank of the player with the g...,"[SELECT, Money_Rank, FROM, poker_player, ORDER...","[select, money_rank, from, poker_player, order...","[Return, the, money, rank, of, the, player, wi...","""Write a query that answers the following ques...",\n\nSELECT RANK() OVER (ORDER BY earnings DE...
657,poker_player,SELECT max(Final_Table_Made) FROM poker_player...,What is the maximum number of final tables mad...,"[SELECT, max, (, Final_Table_Made, ), FROM, po...","[select, max, (, final_table_made, ), from, po...","[What, is, the, maximum, number, of, final, ta...","""Write a query that answers the following ques...",\n\nSELECT MAX(final_tables) FROM players WHE...
658,poker_player,SELECT max(Final_Table_Made) FROM poker_player...,Return the maximum final tables made across al...,"[SELECT, max, (, Final_Table_Made, ), FROM, po...","[select, max, (, final_table_made, ), from, po...","[Return, the, maximum, final, tables, made, ac...","""Write a query that answers the following ques...",\n\nSELECT MAX(final_tables) FROM players WHE...
659,poker_player,SELECT T1.Name FROM people AS T1 JOIN poker_pl...,What are the names of poker players?,"[SELECT, T1.Name, FROM, people, AS, T1, JOIN, ...","[select, t1, ., name, from, people, as, t1, jo...","[What, are, the, names, of, poker, players, ?]","""Write a query that answers the following ques...",\n\nSELECT player_name FROM player
660,poker_player,SELECT T1.Name FROM people AS T1 JOIN poker_pl...,Return the names of all the poker players.,"[SELECT, T1.Name, FROM, people, AS, T1, JOIN, ...","[select, t1, ., name, from, people, as, t1, jo...","[Return, the, names, of, all, the, poker, play...","""Write a query that answers the following ques...",\n\nSELECT player_name FROM poker_players
661,poker_player,SELECT T1.Name FROM people AS T1 JOIN poker_pl...,What are the names of poker players whose earn...,"[SELECT, T1.Name, FROM, people, AS, T1, JOIN, ...","[select, t1, ., name, from, people, as, t1, jo...","[What, are, the, names, of, poker, players, wh...","""Write a query that answers the following ques...",\n\nSELECT name FROM poker_player WHERE earn...
662,poker_player,SELECT T1.Name FROM people AS T1 JOIN poker_pl...,Give the names of poker players who have earni...,"[SELECT, T1.Name, FROM, people, AS, T1, JOIN, ...","[select, t1, ., name, from, people, as, t1, jo...","[Give, the, names, of, poker, players, who, ha...","""Write a query that answers the following ques...",\n\nSELECT player_name FROM player WHERE e...
663,poker_player,SELECT T1.Name FROM people AS T1 JOIN poker_pl...,List the names of poker players ordered by the...,"[SELECT, T1.Name, FROM, people, AS, T1, JOIN, ...","[select, t1, ., name, from, people, as, t1, jo...","[List, the, names, of, poker, players, ordered...","""Write a query that answers the following ques...",\n\nSELECT * FROM poker_players ORDER BY fi...
664,poker_player,SELECT T1.Name FROM people AS T1 JOIN poker_pl...,"What are the names of poker players, ordered a...","[SELECT, T1.Name, FROM, people, AS, T1, JOIN, ...","[select, t1, ., name, from, people, as, t1, jo...","[What, are, the, names, of, poker, players, ,,...","""Write a query that answers the following ques...",\n\nSELECT * FROM player ORDER BY final_ta...
665,poker_player,SELECT T1.Birth_Date FROM people AS T1 JOIN po...,What is the birth date of the poker player wit...,"[SELECT, T1.Birth_Date, FROM, people, AS, T1, ...","[select, t1, ., birth_date, from, people, as, ...","[What, is, the, birth, date, of, the, poker, p...","""Write a query that answers the following ques...",\n\nSELECT MIN(birth_date) FROM poker_player...
666,poker_player,SELECT T1.Birth_Date FROM people AS T1 JOIN po...,Return the birth date of the poker player with...,"[SELECT, T1.Birth_Date, FROM, people, AS, T1, ...","[select, t1, ., birth_date, from, people, as, ...","[Return, the, birth, date, of, the, poker, pla...","""Write a query that answers the following ques...","\n\nSELECT * FROM ""Player"" WHERE ""Earnings..."
667,poker_player,SELECT T2.Money_Rank FROM people AS T1 JOIN po...,What is the money rank of the tallest poker pl...,"[SELECT, T2.Money_Rank, FROM, people, AS, T1, ...","[select, t2, ., money_rank, from, people, as, ...","[What, is, the, money, rank, of, the, tallest,...","""Write a query that answers the following ques...",\n\nSELECT rank FROM poker_player ORDER BY...
668,poker_player,SELECT T2.Money_Rank FROM people AS T1 JOIN po...,Return the money rank of the poker player with...,"[SELECT, T2.Money_Rank, FROM, people, AS, T1, ...","[select, t2, ., money_rank, from, people, as, ...","[Return, the, money, rank, of, the, poker, pla...","""Write a query that answers the following ques...",\n\nSELECT RANK() OVER (ORDER BY height DESC...
669,poker_player,SELECT avg(T2.Earnings) FROM people AS T1 JOIN...,What is the average earnings of poker players ...,"[SELECT, avg, (, T2.Earnings, ), FROM, people,...","[select, avg, (, t2, ., earnings, ), from, peo...","[What, is, the, average, earnings, of, poker, ...","""Write a query that answers the following ques...",\n\nSELECT AVG(earnings) FROM poker_player WH...
670,poker_player,SELECT avg(T2.Earnings) FROM people AS T1 JOIN...,Give average earnings of poker players who are...,"[SELECT, avg, (, T2.Earnings, ), FROM, people,...","[select, avg, (, t2, ., earnings, ), from, peo...","[Give, average, earnings, of, poker, players, ...","""Write a query that answers the following ques...",\n\nSELECT AVG(earnings) FROM poker_player WH...
671,poker_player,SELECT T1.Name FROM people AS T1 JOIN poker_pl...,What are the names of poker players in descend...,"[SELECT, T1.Name, FROM, people, AS, T1, JOIN, ...","[select, t1, ., name, from, people, as, t1, jo...","[What, are, the, names, of, poker, players, in...","""Write a query that answers the following ques...",\n\nSELECT * FROM poker_players ORDER BY ea...
672,poker_player,SELECT T1.Name FROM people AS T1 JOIN poker_pl...,Return the names of poker players sorted by th...,"[SELECT, T1.Name, FROM, people, AS, T1, JOIN, ...","[select, t1, ., name, from, people, as, t1, jo...","[Return, the, names, of, poker, players, sorte...","""Write a query that answers the following ques...",\n\nSELECT * FROM poker_players ORDER BY ea...
673,poker_player,"SELECT Nationality , COUNT(*) FROM people GRO...",What are different nationalities of people and...,"[SELECT, Nationality, ,, COUNT, (, *, ), FROM,...","[select, nationality, ,, count, (, *, ), from,...","[What, are, different, nationalities, of, peop...","""Write a query that answers the following ques...","\n\nSELECT nationality , count(*) FROM people..."
674,poker_player,"SELECT Nationality , COUNT(*) FROM people GRO...",How many people are there of each nationality?,"[SELECT, Nationality, ,, COUNT, (, *, ), FROM,...","[select, nationality, ,, count, (, *, ), from,...","[How, many, people, are, there, of, each, nati...","""Write a query that answers the following ques...",\n\nSELECT nationality FROM people GROUP BY n...
675,poker_player,SELECT Nationality FROM people GROUP BY Nation...,What is the most common nationality of people?,"[SELECT, Nationality, FROM, people, GROUP, BY,...","[select, nationality, from, people, group, by,...","[What, is, the, most, common, nationality, of,...","""Write a query that answers the following ques...",\n\nSELECT nationality FROM people GROUP ...

====================================================================================================
(52, 7)
Input:  ['"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Give the nationality that is most common across all people. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the nationalities that are shared by at least two people? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Return the nationalities for which there are two or more people. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> List the names and birth dates of people in ascending alphabetical order of name. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the names and birth dates of people, ordered by their names in alphabetical order? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Show names of people whose nationality is not "Russia". <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the names of people who are not from Russia? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> List the names of people that are not poker players. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the names of people who do not play poker? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> How many distinct nationalities are there? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Count the number of different nationalities. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> How many states are there? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> List the contestant numbers and names, ordered by contestant name descending. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> List the vote ids, phone numbers and states of all votes. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the maximum and minimum values of area codes? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is last date created of votes from the state \'CA\'? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the names of the contestants whose names are not \'Jessie Alloway\' <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the distinct states and create time of all votes? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the contestant numbers and names of the contestants who had at least two votes? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Of all the contestants who got voted, what is the contestant number and name of the contestant who got least votes? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the number of votes from state \'NY\' or \'CA\'? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> How many contestants did not get voted? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the area code in which the most voters voted? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the create dates, states, and phone numbers of the votes that were for the contestant named \'Tabatha Gehling\'? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> List the area codes in which voters voted both for the contestant \'Tabatha Gehling\' and the contestant \'Kelly Clauss\'. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Return the names of the contestants whose names contain the substring \'Al\' . <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the names of all the countries that became independent after 1950? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Give the names of the nations that were founded after 1950. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> How many countries have a republic as their form of government? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> How many countries have governments that are republics? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the total surface area of the countries in the Caribbean region? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> How much surface area do the countires in the Carribean cover together? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Which continent is Anguilla in? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the continent name which Anguilla belongs to? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Which region is the city Kabul located in? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What region is Kabul in? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Which language is the most popular in Aruba? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What language is predominantly spoken in Aruba? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the population and life expectancies in Brazil? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Give me Brazil’s population and life expectancies. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the region and population of Angola? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What region does Angola belong to and what is its population? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the average expected life expectancy for countries in the region of Central Africa? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> How long is the people’s average life expectancy in Central Africa? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the name of country that has the shortest life expectancy in Asia? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Give the name of the country in Asia with the lowest life expectancy. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the total population and maximum GNP in Asia? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> How many people live in Asia, and what is the largest GNP among them? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the average life expectancy in African countries that are republics? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Give the average life expectancy for countries in Africa which are republics? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the total surface area of the continents Asia and Europe? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Give the total surface area covered by countries in Asia or Europe. <query> ']
Original query:
SELECT Nationality FROM people GROUP BY Nationality ORDER BY COUNT(*) DESC LIMIT 1
Generated query:


SELECT  nationality FROM people GROUP BY  nationality ORDER BY  COUNT(*) DESC LIMIT 1<eos>
____________________________________________________________________________________________________
Original query:
SELECT Nationality FROM people GROUP BY Nationality HAVING COUNT(*)  >=  2
Generated query:


SELECT nationality FROM people GROUP BY nationality HAVING COUNT(*) >= 2<eos>
____________________________________________________________________________________________________
Original query:
SELECT Nationality FROM people GROUP BY Nationality HAVING COUNT(*)  >=  2
Generated query:
 SELECT Nationality FROM People GROUP BY Nationality HAVING COUNT(*) > 1<eos>
____________________________________________________________________________________________________
Original query:
SELECT Name ,  Birth_Date FROM people ORDER BY Name ASC
Generated query:


SELECT name , birth_date FROM people ORDER BY name<eos>
____________________________________________________________________________________________________
Original query:
SELECT Name ,  Birth_Date FROM people ORDER BY Name ASC
Generated query:


SELECT name , birth_date FROM person ORDER BY name<eos>
____________________________________________________________________________________________________
Original query:
SELECT Name FROM people WHERE Nationality != "Russia"
Generated query:
 <strong>SELECT name FROM person WHERE nationality != "Russia"</strong><eos>
____________________________________________________________________________________________________
Original query:
SELECT Name FROM people WHERE Nationality != "Russia"
Generated query:


SELECT  name FROM people WHERE country != 'Russia'<eos>
____________________________________________________________________________________________________
Original query:
SELECT Name FROM people WHERE People_ID NOT IN (SELECT People_ID FROM poker_player)
Generated query:


SELECT  name FROM  person WHERE  NOT EXISTS  (SELECT  * FROM  poker WHERE  person_id  =  poker_person_id )<eos>
____________________________________________________________________________________________________
Original query:
SELECT Name FROM people WHERE People_ID NOT IN (SELECT People_ID FROM poker_player)
Generated query:


SELECT  name FROM  person WHERE  NOT EXISTS  (SELECT  * FROM  poker WHERE  person_id  =  person.id)<eos>
____________________________________________________________________________________________________
Original query:
SELECT count(DISTINCT Nationality) FROM people
Generated query:


SELECT DISTINCT nationality FROM customers<eos>
____________________________________________________________________________________________________
Original query:
SELECT count(DISTINCT Nationality) FROM people
Generated query:


SELECT COUNT(DISTINCT nationality) FROM customers<eos>
____________________________________________________________________________________________________
Original query:
SELECT count(*) FROM area_code_state
Generated query:


SELECT count(*) FROM states<eos>
____________________________________________________________________________________________________
Original query:
SELECT contestant_number ,  contestant_name FROM contestants ORDER BY contestant_name DESC
Generated query:


SELECT  c.contestant_number ,  c.name  FROM  contestants AS c ORDER BY  c.name DESC<eos>
____________________________________________________________________________________________________
Original query:
SELECT vote_id ,  phone_number ,  state FROM votes
Generated query:


SELECT vote_id, phone_number, state FROM votes<eos>
____________________________________________________________________________________________________
Original query:
SELECT max(area_code) ,  min(area_code) FROM area_code_state
Generated query:


SELECT MAX(area_code) , MIN(area_code) FROM area_codes<eos>
____________________________________________________________________________________________________
Original query:
SELECT max(created) FROM votes WHERE state  =  'CA'
Generated query:


SELECT  MAX(date_created) FROM votes WHERE state = 'CA'<eos>
____________________________________________________________________________________________________
Original query:
SELECT contestant_name FROM contestants WHERE contestant_name != 'Jessie Alloway'
Generated query:


SELECT  c.name FROM contestants AS c WHERE NOT EXISTS (SELECT  1 FROM contestants AS c2 WHERE c2.name = 'Jessie Alloway' AND c2.id = c.id)<eos>
____________________________________________________________________________________________________
Original query:
SELECT DISTINCT state ,  created FROM votes
Generated query:


SELECT DISTINCT state FROM votes<eos>
____________________________________________________________________________________________________
Original query:
SELECT T1.contestant_number , T1.contestant_name FROM contestants AS T1 JOIN votes AS T2 ON T1.contestant_number  =  T2.contestant_number GROUP BY T1.contestant_number HAVING count(*)  >=  2
Generated query:


SELECT contestant_number ,  name FROM contestant WHERE  count(*) >= 2<eos>
____________________________________________________________________________________________________
Original query:
SELECT T1.contestant_number , T1.contestant_name FROM contestants AS T1 JOIN votes AS T2 ON T1.contestant_number  =  T2.contestant_number GROUP BY T1.contestant_number ORDER BY count(*) ASC LIMIT 1
Generated query:


SELECT  contestant_number ,  contestant_name FROM  contestants WHERE  votes  =  (SELECT  MAX(votes) FROM  contestants)<eos>
____________________________________________________________________________________________________
Original query:
SELECT count(*) FROM votes WHERE state  =  'NY' OR state  =  'CA'
Generated query:


SELECT COUNT(*) FROM votes WHERE state IN ('NY','CA')<eos>
____________________________________________________________________________________________________
Original query:
SELECT count(*) FROM contestants WHERE contestant_number NOT IN ( SELECT contestant_number FROM votes )
Generated query:


SELECT COUNT(*) FROM Contestant WHERE Vote = 'No'<eos>
____________________________________________________________________________________________________
Original query:
SELECT T1.area_code FROM area_code_state AS T1 JOIN votes AS T2 ON T1.state  =  T2.state GROUP BY T1.area_code ORDER BY count(*) DESC LIMIT 1
Generated query:


SELECT  area_code  FROM  voter_info  GROUP BY  area_code  ORDER BY  count(*) DESC LIMIT 1<eos>
____________________________________________________________________________________________________
Original query:
SELECT T2.created ,  T2.state ,  T2.phone_number FROM contestants AS T1 JOIN votes AS T2 ON T1.contestant_number  =  T2.contestant_number WHERE T1.contestant_name  =  'Tabatha Gehling'
Generated query:


SELECT  create_date ,  state ,  phone_number FROM votes WHERE  name  =  'Tabatha Gehling'<eos>
____________________________________________________________________________________________________
Original query:
SELECT T3.area_code FROM contestants AS T1 JOIN votes AS T2 ON T1.contestant_number  =  T2.contestant_number JOIN area_code_state AS T3 ON T2.state  =  T3.state WHERE T1.contestant_name  =  'Tabatha Gehling' INTERSECT SELECT T3.area_code FROM contestants AS T1 JOIN votes AS T2 ON T1.contestant_number  =  T2.contestant_number JOIN area_code_state AS T3 ON T2.state  =  T3.state WHERE T1.contestant_name  =  'Kelly Clauss'
Generated query:


SELECT  area_code FROM voters WHERE  voted_for_tabatha_gehling  AND  voted_for_kelly_clauss<eos>
____________________________________________________________________________________________________
Original query:
select contestant_name from contestants where contestant_name like "%al%"
Generated query:
 <strong>SELECT name FROM contestants WHERE name LIKE '%Al%'</strong><eos>
____________________________________________________________________________________________________
Original query:
SELECT Name FROM country WHERE IndepYear  >  1950
Generated query:


SELECT DISTINCT country FROM countries WHERE year_of_independence > 1950<eos>
____________________________________________________________________________________________________
Original query:
SELECT Name FROM country WHERE IndepYear  >  1950
Generated query:


SELECT  nation_name FROM nations WHERE  year_founded > 1950<eos>
____________________________________________________________________________________________________
Original query:
SELECT count(*) FROM country WHERE GovernmentForm  =  "Republic"
Generated query:


SELECT count(*) FROM country WHERE form_of_government = 'republic'<eos>
____________________________________________________________________________________________________
Original query:
SELECT count(*) FROM country WHERE GovernmentForm  =  "Republic"
Generated query:

SELECT COUNT(*) FROM country WHERE government = 'republic'<eos>
____________________________________________________________________________________________________
Original query:
SELECT sum(SurfaceArea) FROM country WHERE Region  =  "Caribbean"
Generated query:


SELECT SUM(area) FROM country WHERE region = 'Caribbean'<eos>
____________________________________________________________________________________________________
Original query:
SELECT sum(SurfaceArea) FROM country WHERE Region  =  "Caribbean"
Generated query:


SELECT SUM(area) FROM country WHERE continent = 'Caribbean'<eos>
____________________________________________________________________________________________________
Original query:
SELECT Continent FROM country WHERE Name  =  "Anguilla"

,db_id,query,question,query_toks,query_toks_no_value,question_toks,modified question,generated_query
676,poker_player,SELECT Nationality FROM people GROUP BY Nation...,Give the nationality that is most common acros...,"[SELECT, Nationality, FROM, people, GROUP, BY,...","[select, nationality, from, people, group, by,...","[Give, the, nationality, that, is, most, commo...","""Write a query that answers the following ques...",\n\nSELECT nationality FROM people GROUP BY ...
677,poker_player,SELECT Nationality FROM people GROUP BY Nation...,What are the nationalities that are shared by ...,"[SELECT, Nationality, FROM, people, GROUP, BY,...","[select, nationality, from, people, group, by,...","[What, are, the, nationalities, that, are, sha...","""Write a query that answers the following ques...",\n\nSELECT nationality FROM people GROUP BY n...
678,poker_player,SELECT Nationality FROM people GROUP BY Nation...,Return the nationalities for which there are t...,"[SELECT, Nationality, FROM, people, GROUP, BY,...","[select, nationality, from, people, group, by,...","[Return, the, nationalities, for, which, there...","""Write a query that answers the following ques...",SELECT Nationality FROM People GROUP BY Natio...
679,poker_player,"SELECT Name , Birth_Date FROM people ORDER BY...",List the names and birth dates of people in as...,"[SELECT, Name, ,, Birth_Date, FROM, people, OR...","[select, name, ,, birth_date, from, people, or...","[List, the, names, and, birth, dates, of, peop...","""Write a query that answers the following ques...","\n\nSELECT name , birth_date FROM people ORDE..."
680,poker_player,"SELECT Name , Birth_Date FROM people ORDER BY...","What are the names and birth dates of people, ...","[SELECT, Name, ,, Birth_Date, FROM, people, OR...","[select, name, ,, birth_date, from, people, or...","[What, are, the, names, and, birth, dates, of,...","""Write a query that answers the following ques...","\n\nSELECT name , birth_date FROM person ORDE..."
681,poker_player,"SELECT Name FROM people WHERE Nationality != ""...",Show names of people whose nationality is not ...,"[SELECT, Name, FROM, people, WHERE, Nationalit...","[select, name, from, people, where, nationalit...","[Show, names, of, people, whose, nationality, ...","""Write a query that answers the following ques...",<strong>SELECT name FROM person WHERE nationa...
682,poker_player,"SELECT Name FROM people WHERE Nationality != ""...",What are the names of people who are not from ...,"[SELECT, Name, FROM, people, WHERE, Nationalit...","[select, name, from, people, where, nationalit...","[What, are, the, names, of, people, who, are, ...","""Write a query that answers the following ques...",\n\nSELECT name FROM people WHERE country !=...
683,poker_player,SELECT Name FROM people WHERE People_ID NOT IN...,List the names of people that are not poker pl...,"[SELECT, Name, FROM, people, WHERE, People_ID,...","[select, name, from, people, where, people_id,...","[List, the, names, of, people, that, are, not,...","""Write a query that answers the following ques...",\n\nSELECT name FROM person WHERE NOT EXIS...
684,poker_player,SELECT Name FROM people WHERE People_ID NOT IN...,What are the names of people who do not play p...,"[SELECT, Name, FROM, people, WHERE, People_ID,...","[select, name, from, people, where, people_id,...","[What, are, the, names, of, people, who, do, n...","""Write a query that answers the following ques...",\n\nSELECT name FROM person WHERE NOT EXIS...
685,poker_player,SELECT count(DISTINCT Nationality) FROM people,How many distinct nationalities are there?,"[SELECT, count, (, DISTINCT, Nationality, ), F...","[select, count, (, distinct, nationality, ), f...","[How, many, distinct, nationalities, are, ther...","""Write a query that answers the following ques...",\n\nSELECT DISTINCT nationality FROM customers
686,poker_player,SELECT count(DISTINCT Nationality) FROM people,Count the number of different nationalities.,"[SELECT, count, (, DISTINCT, Nationality, ), F...","[select, count, (, distinct, nationality, ), f...","[Count, the, number, of, different, nationalit...","""Write a query that answers the following ques...",\n\nSELECT COUNT(DISTINCT nationality) FROM c...
687,voter_1,SELECT count(*) FROM area_code_state,How many states are there?,"[SELECT, count, (, *, ), FROM, area_code_state]","[select, count, (, *, ), from, area_code_state]","[How, many, states, are, there, ?]","""Write a query that answers the following ques...",\n\nSELECT count(*) FROM states
688,voter_1,"SELECT contestant_number , contestant_name FR...","List the contestant numbers and names, ordered...","[SELECT, contestant_number, ,, contestant_name...","[select, contestant_number, ,, contestant_name...","[List, the, contestant, numbers, and, names, ,...","""Write a query that answers the following ques...","\n\nSELECT c.contestant_number , c.name FR..."
689,voter_1,"SELECT vote_id , phone_number , state FROM v...","List the vote ids, phone numbers and states of...","[SELECT, vote_id, ,, phone_number, ,, state, F...","[select, vote_id, ,, phone_number, ,, state, f...","[List, the, vote, ids, ,, phone, numbers, and,...","""Write a query that answers the following ques...","\n\nSELECT vote_id, phone_number, state FROM ..."
690,voter_1,"SELECT max(area_code) , min(area_code) FROM a...",What are the maximum and minimum values of are...,"[SELECT, max, (, area_code, ), ,, min, (, area...","[select, max, (, area_code, ), ,, min, (, area...","[What, are, the, maximum, and, minimum, values...","""Write a query that answers the following ques...","\n\nSELECT MAX(area_code) , MIN(area_code) FR..."
691,voter_1,SELECT max(created) FROM votes WHERE state = ...,What is last date created of votes from the st...,"[SELECT, max, (, created, ), FROM, votes, WHER...","[select, max, (, created, ), from, votes, wher...","[What, is, last, date, created, of, votes, fro...","""Write a query that answers the following ques...",\n\nSELECT MAX(date_created) FROM votes WHER...
692,voter_1,SELECT contestant_name FROM contestants WHERE ...,What are the names of the contestants whose na...,"[SELECT, contestant_name, FROM, contestants, W...","[select, contestant_name, from, contestants, w...","[What, are, the, names, of, the, contestants, ...","""Write a query that answers the following ques...",\n\nSELECT c.name FROM contestants AS c WHER...
693,voter_1,"SELECT DISTINCT state , created FROM votes",What are the distinct states and create time o...,"[SELECT, DISTINCT, state, ,, created, FROM, vo...","[select, distinct, state, ,, created, from, vo...","[What, are, the, distinct, states, and, create...","""Write a query that answers the following ques...",\n\nSELECT DISTINCT state FROM votes
694,voter_1,"SELECT T1.contestant_number , T1.contestant_na...",What are the contestant numbers and names of t...,"[SELECT, T1.contestant_number, ,, T1.contestan...","[select, t1, ., contestant_number, ,, t1, ., c...","[What, are, the, contestant, numbers, and, nam...","""Write a query that answers the following ques...","\n\nSELECT contestant_number , name FROM con..."
695,voter_1,"SELECT T1.contestant_number , T1.contestant_na...","Of all the contestants who got voted, what is ...","[SELECT, T1.contestant_number, ,, T1.contestan...","[select, t1, ., contestant_number, ,, t1, ., c...","[Of, all, the, contestants, who, got, voted, ,...","""Write a query that answers the following ques...","\n\nSELECT contestant_number , contestant_n..."
696,voter_1,SELECT count(*) FROM votes WHERE state = 'NY...,What are the number of votes from state 'NY' o...,"[SELECT, count, (, *, ), FROM, votes, WHERE, s...","[select, count, (, *, ), from, votes, where, s...","[What, are, the, number, of, votes, from, stat...","""Write a query that answers the following ques...",\n\nSELECT COUNT(*) FROM votes WHERE state IN...
697,voter_1,SELECT count(*) FROM contestants WHERE contest...,How many contestants did not get voted?,"[SELECT, count, (, *, ), FROM, contestants, WH...","[select, count, (, *, ), from, contestants, wh...","[How, many, contestants, did, not, get, voted, ?]","""Write a query that answers the following ques...",\n\nSELECT COUNT(*) FROM Contestant WHERE Vot...
698,voter_1,SELECT T1.area_code FROM area_code_state AS T1...,What is the area code in which the most voters...,"[SELECT, T1.area_code, FROM, area_code_state, ...","[select, t1, ., area_code, from, area_code_sta...","[What, is, the, area, code, in, which, the, mo...","""Write a query that answers the following ques...",\n\nSELECT area_code FROM voter_info GROU...
699,voter_1,"SELECT T2.created , T2.state , T2.phone_numb...","What are the create dates, states, and phone n...","[SELECT, T2.created, ,, T2.state, ,, T2.phone_...","[select, t2, ., created, ,, t2, ., state, ,, t...","[What, are, the, create, dates, ,, states, ,, ...","""Write a query that answers the following ques...","\n\nSELECT create_date , state , phone_num..."
700,voter_1,SELECT T3.area_code FROM contestants AS T1 JOI...,List the area codes in which voters voted both...,"[SELECT, T3.area_code, FROM, contestants, AS, ...","[select, t3, ., area_code, from, contestants, ...","[List, the, area, codes, in, which, voters, vo...","""Write a query that answers the following ques...",\n\nSELECT area_code FROM voters WHERE vote...
701,voter_1,select contestant_name from contestants where ...,Return the names of the contestants whose name...,"[select, contestant_name, from, contestants, w...","[select, contestant_name, from, contestants, w...","[Return, the, names, of, the, contestants, who...","""Write a query that answers the following ques...",<strong>SELECT name FROM contestants WHERE na...
702,world_1,SELECT Name FROM country WHERE IndepYear > 1950,What are the names of all the countries that b...,"[SELECT, Name, FROM, country, WHERE, IndepYear...","[select, name, from, country, where, indepyear...","[What, are, the, names, of, all, the, countrie...","""Write a query that answers the following ques...",\n\nSELECT DISTINCT country FROM countries WH...
703,world_1,SELECT Name FROM country WHERE IndepYear > 1950,Give the names of the nations that were founde...,"[SELECT, Name, FROM, country, WHERE, IndepYear...","[select, name, from, country, where, indepyear...","[Give, the, names, of, the, nations, that, wer...","""Write a query that answers the following ques...",\n\nSELECT nation_name FROM nations WHERE y...
704,world_1,SELECT count(*) FROM country WHERE GovernmentF...,How many countries have a republic as their fo...,"[SELECT, count, (, *, ), FROM, country, WHERE,...","[select, count, (, *, ), from, country, where,...","[How, many, countries, have, a, republic, as, ...","""Write a query that answers the following ques...",\n\nSELECT count(*) FROM country WHERE form_o...
705,world_1,SELECT count(*) FROM country WHERE GovernmentF...,How many countries have governments that are r...,"[SELECT, count, (, *, ), FROM, country, WHERE,...","[select, count, (, *, ), from, country, where,...","[How, many, countries, have, governments, that...","""Write a query that answers the following ques...",\nSELECT COUNT(*) FROM country WHERE governme...
706,world_1,SELECT sum(SurfaceArea) FROM country WHERE Reg...,What is the total surface area of the countrie...,"[SELECT, sum, (, SurfaceArea, ), FROM, country...","[select, sum, (, surfacearea, ), from, country...","[What, is, the, total, surface, area, of, the,...","""Write a query that answers the following ques...",\n\nSELECT SUM(area) FROM country WHERE regio...
707,world_1,SELECT sum(SurfaceArea) FROM country WHERE Reg...,How much surface area do the countires in the ...,"[SELECT, sum, (, SurfaceArea, ), FROM, country...","[select, sum, (, surfacearea, ), from, country...","[How, much, surface, area, do, the, countires,...","""Write a query that answers the following ques...",\n\nSELECT SUM(area) FROM country WHERE conti...
708,world_1,"SELECT Continent FROM country WHERE Name = ""...",Which continent is Anguilla in?,"[SELECT, Continent, FROM, country, WHERE, Name...","[select, continent, from, country, where, name...","[Which, continent, is, Anguilla, in, ?]","""Write a query that answers the following ques...",\n\nSELECT continent FROM country WHERE count...
709,world_1,"SELECT Continent FROM country WHERE Name = ""...",What is the continent name which Anguilla belo...,"[SELECT, Continent, FROM, country, WHERE, Name...","[select, continent, from, country, where, name...","[What, is, the, continent, name, which, Anguil...","""Write a query that answers the following ques...",\n\nSELECT continent_name FROM continent WHER...
710,world_1,SELECT Region FROM country AS T1 JOIN city AS ...,Which region is the city Kabul located in?,"[SELECT, Region, FROM, country, AS, T1, JOIN, ...","[select, region, from, country, as, t1, join, ...","[Which, region, is, the, city, Kabul, located,...","""Write a query that answers the following ques...",\n\nSELECT region FROM city
711,world_1,SELECT Region FROM country AS T1 JOIN city AS ...,What region is Kabul in?,"[SELECT, Region, FROM, country, AS, T1, JOIN, ...","[select, region, from, country, as, t1, join, ...","[What, region, is, Kabul, in, ?]","""Write a query that answers the following ques...",\nSELECT region FROM country WHERE country_na...
712,world_1,SELECT T2.Language FROM country AS T1 JOIN cou...,Which language is the most popular in Aruba?,"[SELECT, T2.Language, FROM, country, AS, T1, J...","[select, t2, ., language, from, country, as, t...","[Which, language, is, the, most, popular, in, ...","""Write a query that answers the following ques...",\n\nSELECT language FROM language_count
713,world_1,SELECT T2.Language FROM country AS T1 JOIN cou...,What language is predominantly spoken in Aruba?,"[SELECT, T2.Language, FROM, country, AS, T1, J...","[select, t2, ., language, from, country, as, t...","[What, language, is, predominantly, spoken, in...","""Write a query that answers the following ques...",\n\nSELECT language FROM country WHERE c...
714,world_1,"SELECT Population , LifeExpectancy FROM count...",What are the population and life expectancies ...,"[SELECT, Population, ,, LifeExpectancy, FROM, ...","[select, population, ,, lifeexpectancy, from, ...","[What, are, the, population, and, life, expect...","""Write a query that answers the following ques...","\n\nSELECT population , life_expectancy FROM ..."
715,world_1,"SELECT Population , LifeExpectancy FROM count...",Give me Brazil’s population and life expectanc...,"[SELECT, Population, ,, LifeExpectancy, FROM, ...","[select, population, ,, lifeexpectancy, from, ...","[Give, me, Brazil’s, population, and, life, ex...","""Write a query that answers the following ques...","<strong>SELECT</strong> country_name , popu..."
716,world_1,"SELECT Population , Region FROM country WHERE...",What are the region and population of Angola?,"[SELECT, Population, ,, Region, FROM, country,...","[select, population, ,, region, from, country,...","[What, are, the, region, and, population, of, ...","""Write a query that answers the following ques...","\n\nSELECT region , population FROM countries..."
717,world_1,"SELECT Population , Region FROM country WHERE...",What region does Angola belong to and what is ...,"[SELECT, Population, ,, Region, FROM, country,...","[select, population, ,, region, from, country,...","[What, region, does, Angola, belong, to, and, ...","""Write a query that answers the following ques...","\n\nSELECT region , population FROM countrie..."
718,world_1,SELECT avg(LifeExpectancy) FROM country WHERE ...,What is the average expected life expectancy f...,"[SELECT, avg, (, LifeExpectancy, ), FROM, coun...","[select, avg, (, lifeexpectancy, ), from, coun...","[What, is, the, average, expected, life, expec...","""Write a query that answers the following ques...",\n\nSELECT avg(life_expectancy) FROM countri...
719,world_1,SELECT avg(LifeExpectancy) FROM country WHERE ...,How long is the people’s average life expectan...,"[SELECT, avg, (, LifeExpectancy, ), FROM, coun...","[select, avg, (, lifeexpectancy, ), from, coun...","[How, long, is, the, people’s, average, life, ...","""Write a query that answers the following ques...",\n\nSELECT AVG(people_life_expectancy) FROM ...
720,world_1,"SELECT Name FROM country WHERE Continent = ""...",What is the name of country that has the short...,"[SELECT, Name, FROM, country, WHERE, Continent...","[select, name, from, country, where, continent...","[What, is, the, name, of, country, that, has, ...","""Write a query that answers the following ques...",\n\nSELECT country FROM countries WHERE life_...
721,world_1,"SELECT Name FROM country WHERE Continent = ""...",Give the name of the country in Asia with the ...,"[SELECT, Name, FROM, country, WHERE, Continent...","[select, name, from, country, where, continent...","[Give, the, name, of, the, country, in, Asia, ...","""Write a query that answers the following ques...",\n\nSELECT country_name FROM countries WHERE...
722,world_1,"SELECT sum(Population) , max(GNP) FROM countr...",What is the total population and maximum GNP i...,"[SELECT, sum, (, Population, ), ,, max, (, GNP...","[select, sum, (, population, ), ,, max, (, gnp...","[What, is, the, total, population, and, maximu...","""Write a query that answers the following ques...","\n\nSELECT SUM(population) , MAX(GNP) FROM co..."
723,world_1,"SELECT sum(Population) , max(GNP) FROM countr...","How many people live in Asia, and what is the ...","[SELECT, sum, (, Population, ), ,, max, (, GNP...","[select, sum, (, population, ), ,, max, (, gnp...","[How, many, people, live, in, Asia, ,, and, wh...","""Write a query that answers the following ques...","\n\nSELECT count(*) , country FROM world ..."
724,world_1,SELECT avg(LifeExpectancy) FROM country WHERE ...,What is the average life expectancy in African...,"[SELECT, avg, (, LifeExpectancy, ), FROM, coun...","[select, avg, (, lifeexpectancy, ), from, coun...","[What, is, the, average, life, expectancy, in,...","""Write a query that answers the following ques...",\n\nSELECT avg(life_expectancy) FROM country...
725,world_1,SELECT avg(LifeExpectancy) FROM country WHERE ...,Give the average life expectancy for countries...,"[SELECT, avg, (, LifeExpectancy, ), FROM, coun...","[select, avg, (, lifeexpectancy, ), from, coun...","[Give, the, average, life, expectancy, for, co...","""Write a query that answers the following ques...",\n\nSELECT avg(life_expectancy) FROM countri...
726,world_1,SELECT sum(SurfaceArea) FROM country WHERE Con...,What is the total surface area of the continen...,"[SELECT, sum, (, SurfaceArea, ), FROM, country...","[select, sum, (, surfacearea, ), from, country...","[What, is, the, total, surface, area, of, the,...","""Write a query that answers the following ques...",\n\nSELECT SUM(area) FROM continent WHERE con...
727,world_1,SELECT sum(SurfaceArea) FROM country WHERE Con...,Give the total surface area covered by countri...,"[SELECT, sum, (, SurfaceArea, ), FROM, country...","[select, sum, (, surfacearea, ), from, country...","[Give, the, total, surface, area, covered, by,...","""Write a query that answers the following ques...",\n\nSELECT SUM(area) FROM country WHERE conti...

====================================================================================================
(51, 7)
Input:  ['"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> How many people live in Gelderland district? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the total population of Gelderland district? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the average GNP and total population in all nations whose government is US territory? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Give the mean GNP and total population of nations which are considered US territory. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> How many unique languages are spoken in the world? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the number of distinct languages used around the world? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> How many type of governments are in Africa? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> How many different forms of governments are there in Africa? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the total number of languages used in Aruba? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> How many languages are spoken in Aruba? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> How many official languages does Afghanistan have? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> How many official languages are spoken in Afghanistan? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is name of the country that speaks the largest number of languages? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Give the name of the nation that uses the greatest amount of languages. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Which continent has the most diverse languages? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Which continent speaks the most languages? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> How many countries speak both English and Dutch? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the number of nations that use English and Dutch? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the names of nations speak both English and French? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Give the names of nations that speak both English and French. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the names of nations where both English and French are official languages? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Give the names of countries with English and French as official languages. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the number of distinct continents where Chinese is spoken? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> How many continents speak Chinese? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the regions that use English or Dutch? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Which regions speak Dutch or English? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the countries where either English or Dutch is the official language ? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Which countries have either English or Dutch as an official language? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Which language is the most popular on the Asian continent? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the language that is used by the largest number of Asian nations? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Which languages are spoken by only one country in republic governments? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What languages are only used by a single country with a republic government? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Find the city with the largest population that uses English. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the most populace city that speaks English? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Find the name, population and expected life length of asian country with the largest area? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the name, population, and life expectancy of the largest Asian country by land? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is average life expectancy in the countries where English is not the official language? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Give the mean life expectancy of countries in which English is not the official language. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the total number of people living in the nations that do not use English? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> How many people live in countries that do not speak English? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the official language spoken in the country whose head of state is Beatrix? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the official language used in the country the name of whose head of state is Beatrix. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the total number of unique official languages spoken in the countries that are founded before 1930? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> For the countries founded before 1930, what is the total number of distinct official languages? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the countries that have greater surface area than any country in Europe? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Which countries have greater area than that of any country in Europe? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the African countries that have a  population less than any country in Asia? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Which African countries have a smaller population than that of any country in Asia? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Which Asian countries have a population that is larger than any country in Africa? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the Asian countries which have a population larger than that of any country in Africa? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the country codes for countries that do not speak English? <query> ']
Original query:
SELECT sum(Population) FROM city WHERE District  =  "Gelderland"
Generated query:


SELECT count(*) FROM person WHERE district_id = 1<eos>
____________________________________________________________________________________________________
Original query:
SELECT sum(Population) FROM city WHERE District  =  "Gelderland"
Generated query:


SELECT SUM(population) FROM district WHERE district_name = 'Gelderland'<eos>
____________________________________________________________________________________________________
Original query:
SELECT avg(GNP) ,  sum(population) FROM country WHERE GovernmentForm  =  "US Territory"
Generated query:


SELECT  avg(GNP) ,  total_population  FROM  nation  WHERE  government  =  "US territory"<eos>
____________________________________________________________________________________________________
Original query:
SELECT avg(GNP) ,  sum(population) FROM country WHERE GovernmentForm  =  "US Territory"
Generated query:


SELECT  mean_gdp , total_population FROM nations WHERE nation_name  =  'United States'<eos>
____________________________________________________________________________________________________
Original query:
SELECT count(DISTINCT LANGUAGE) FROM countrylanguage
Generated query:


SELECT DISTINCT language FROM languages<eos>
____________________________________________________________________________________________________
Original query:
SELECT count(DISTINCT LANGUAGE) FROM countrylanguage
Generated query:


SELECT DISTINCT  language  FROM  languages<eos>
____________________________________________________________________________________________________
Original query:
SELECT count(DISTINCT GovernmentForm) FROM country WHERE Continent  =  "Africa"
Generated query:


SELECT count(*) FROM government<eos>
____________________________________________________________________________________________________
Original query:
SELECT count(DISTINCT GovernmentForm) FROM country WHERE Continent  =  "Africa"
Generated query:


SELECT DISTINCT  form_of_government  FROM  countries<eos>
____________________________________________________________________________________________________
Original query:
SELECT COUNT(T2.Language) FROM country AS T1 JOIN countrylanguage AS T2 ON T1.Code  =  T2.CountryCode WHERE T1.Name  =  "Aruba"
Generated query:


SELECT  count(*) FROM  languages<eos>
____________________________________________________________________________________________________
Original query:
SELECT COUNT(T2.Language) FROM country AS T1 JOIN countrylanguage AS T2 ON T1.Code  =  T2.CountryCode WHERE T1.Name  =  "Aruba"
Generated query:


SELECT COUNT(*) FROM languages<eos>
____________________________________________________________________________________________________
Original query:
SELECT COUNT(*) FROM country AS T1 JOIN countrylanguage AS T2 ON T1.Code  =  T2.CountryCode WHERE T1.Name  =  "Afghanistan" AND IsOfficial  =  "T"
Generated query:


SELECT COUNT(*) FROM languages WHERE language_code = 'af'<eos>
____________________________________________________________________________________________________
Original query:
SELECT COUNT(*) FROM country AS T1 JOIN countrylanguage AS T2 ON T1.Code  =  T2.CountryCode WHERE T1.Name  =  "Afghanistan" AND IsOfficial  =  "T"
Generated query:


SELECT COUNT(*) FROM languages WHERE language_code = 'af'<eos>
____________________________________________________________________________________________________
Original query:
SELECT T1.Name FROM country AS T1 JOIN countrylanguage AS T2 ON T1.Code  =  T2.CountryCode GROUP BY T1.Name ORDER BY COUNT(*) DESC LIMIT 1
Generated query:


SELECT country_name FROM languages ORDER BY count DESC LIMIT 1<eos>
____________________________________________________________________________________________________
Original query:
SELECT T1.Name FROM country AS T1 JOIN countrylanguage AS T2 ON T1.Code  =  T2.CountryCode GROUP BY T1.Name ORDER BY COUNT(*) DESC LIMIT 1
Generated query:


SELECT nation FROM nation ORDER BY  count(*) DESC LIMIT 1<eos>
____________________________________________________________________________________________________
Original query:
SELECT T1.Continent FROM country AS T1 JOIN countrylanguage AS T2 ON T1.Code  =  T2.CountryCode GROUP BY T1.Continent ORDER BY COUNT(*) DESC LIMIT 1
Generated query:


SELECT  continent FROM  languages GROUP BY  continent ORDER BY  count(*) DESC LIMIT 1<eos>
____________________________________________________________________________________________________
Original query:
SELECT T1.Continent FROM country AS T1 JOIN countrylanguage AS T2 ON T1.Code  =  T2.CountryCode GROUP BY T1.Continent ORDER BY COUNT(*) DESC LIMIT 1
Generated query:


SELECT  continent ,  count(*) AS  total_languages  FROM  languages GROUP BY  continent ORDER BY  total_languages DESC LIMIT  1<eos>
____________________________________________________________________________________________________
Original query:
SELECT COUNT(*) FROM (SELECT T1.Name FROM country AS T1 JOIN countrylanguage AS T2 ON T1.Code  =  T2.CountryCode WHERE T2.Language  =  "English" INTERSECT SELECT T1.Name FROM country AS T1 JOIN countrylanguage AS T2 ON T1.Code  =  T2.CountryCode WHERE T2.Language  =  "Dutch")
Generated query:


SELECT COUNT(*) FROM country WHERE language_code  =  "en"  AND  language_code  =  "nl"<eos>
____________________________________________________________________________________________________
Original query:
SELECT COUNT(*) FROM (SELECT T1.Name FROM country AS T1 JOIN countrylanguage AS T2 ON T1.Code  =  T2.CountryCode WHERE T2.Language  =  "English" INTERSECT SELECT T1.Name FROM country AS T1 JOIN countrylanguage AS T2 ON T1.Code  =  T2.CountryCode WHERE T2.Language  =  "Dutch")
Generated query:


SELECT count(*) FROM nation WHERE language_code  =  "en"  AND  language_code  =  "nl"<eos>
____________________________________________________________________________________________________
Original query:
SELECT T1.Name FROM country AS T1 JOIN countrylanguage AS T2 ON T1.Code  =  T2.CountryCode WHERE T2.Language  =  "English" INTERSECT SELECT T1.Name FROM country AS T1 JOIN countrylanguage AS T2 ON T1.Code  =  T2.CountryCode WHERE T2.Language  =  "French"
Generated query:


SELECT  nations  FROM  nations  WHERE  languages  =  "English"  AND  languages  =  "French"<eos>
____________________________________________________________________________________________________
Original query:
SELECT T1.Name FROM country AS T1 JOIN countrylanguage AS T2 ON T1.Code  =  T2.CountryCode WHERE T2.Language  =  "English" INTERSECT SELECT T1.Name FROM country AS T1 JOIN countrylanguage AS T2 ON T1.Code  =  T2.CountryCode WHERE T2.Language  =  "French"
Generated query:
 <strong>SELECT</strong>  name FROM nation WHERE language  =  "English" AND language  =  "French"<eos>
____________________________________________________________________________________________________
Original query:
SELECT T1.Name FROM country AS T1 JOIN countrylanguage AS T2 ON T1.Code  =  T2.CountryCode WHERE T2.Language  =  "English" AND T2.IsOfficial  =  "T" INTERSECT SELECT T1.Name FROM country AS T1 JOIN countrylanguage AS T2 ON T1.Code  =  T2.CountryCode WHERE T2.Language  =  "French" AND T2.IsOfficial  =  "T"
Generated query:


SELECT  nation_name FROM nations WHERE official_language  =  'English'  AND  official_language  =  'French'<eos>
____________________________________________________________________________________________________
Original query:
SELECT T1.Name FROM country AS T1 JOIN countrylanguage AS T2 ON T1.Code  =  T2.CountryCode WHERE T2.Language  =  "English" AND T2.IsOfficial  =  "T" INTERSECT SELECT T1.Name FROM country AS T1 JOIN countrylanguage AS T2 ON T1.Code  =  T2.CountryCode WHERE T2.Language  =  "French" AND T2.IsOfficial  =  "T"
Generated query:
 <strong>SELECT</strong>  country_name  <strong>FROM</strong>  country  <strong>WHERE</strong>  official_language  =  'English'  OR  official_language  =  'French'<eos>
____________________________________________________________________________________________________
Original query:
SELECT COUNT( DISTINCT Continent) FROM country AS T1 JOIN countrylanguage AS T2 ON T1.Code  =  T2.CountryCode WHERE T2.Language  =  "Chinese"
Generated query:


SELECT DISTINCT continent FROM languages WHERE language_name = 'Chinese'<eos>
____________________________________________________________________________________________________
Original query:
SELECT COUNT( DISTINCT Continent) FROM country AS T1 JOIN countrylanguage AS T2 ON T1.Code  =  T2.CountryCode WHERE T2.Language  =  "Chinese"
Generated query:


SELECT count(*) FROM continent WHERE language_code = 'zh'<eos>
____________________________________________________________________________________________________
Original query:
SELECT DISTINCT T1.Region FROM country AS T1 JOIN countrylanguage AS T2 ON T1.Code  =  T2.CountryCode WHERE T2.Language  =  "English" OR T2.Language  =  "Dutch"
Generated query:


SELECT  region_name FROM  region WHERE  language_code  =  'en'  OR  language_code  =  'nl'<eos>
____________________________________________________________________________________________________
Original query:
SELECT DISTINCT T1.Region FROM country AS T1 JOIN countrylanguage AS T2 ON T1.Code  =  T2.CountryCode WHERE T2.Language  =  "English" OR T2.Language  =  "Dutch"
Generated query:


SELECT  region_name FROM regions WHERE language_code  =  'nl' OR language_code  =  'en'<eos>
____________________________________________________________________________________________________
Original query:

,db_id,query,question,query_toks,query_toks_no_value,question_toks,modified question,generated_query
728,world_1,SELECT sum(Population) FROM city WHERE Distric...,How many people live in Gelderland district?,"[SELECT, sum, (, Population, ), FROM, city, WH...","[select, sum, (, population, ), from, city, wh...","[How, many, people, live, in, Gelderland, dist...","""Write a query that answers the following ques...",\n\nSELECT count(*) FROM person WHERE distric...
729,world_1,SELECT sum(Population) FROM city WHERE Distric...,What is the total population of Gelderland dis...,"[SELECT, sum, (, Population, ), FROM, city, WH...","[select, sum, (, population, ), from, city, wh...","[What, is, the, total, population, of, Gelderl...","""Write a query that answers the following ques...",\n\nSELECT SUM(population) FROM district WHER...
730,world_1,"SELECT avg(GNP) , sum(population) FROM countr...",What is the average GNP and total population i...,"[SELECT, avg, (, GNP, ), ,, sum, (, population...","[select, avg, (, gnp, ), ,, sum, (, population...","[What, is, the, average, GNP, and, total, popu...","""Write a query that answers the following ques...","\n\nSELECT avg(GNP) , total_population FRO..."
731,world_1,"SELECT avg(GNP) , sum(population) FROM countr...",Give the mean GNP and total population of nati...,"[SELECT, avg, (, GNP, ), ,, sum, (, population...","[select, avg, (, gnp, ), ,, sum, (, population...","[Give, the, mean, GNP, and, total, population,...","""Write a query that answers the following ques...","\n\nSELECT mean_gdp , total_population FROM ..."
732,world_1,SELECT count(DISTINCT LANGUAGE) FROM countryla...,How many unique languages are spoken in the wo...,"[SELECT, count, (, DISTINCT, LANGUAGE, ), FROM...","[select, count, (, distinct, language, ), from...","[How, many, unique, languages, are, spoken, in...","""Write a query that answers the following ques...",\n\nSELECT DISTINCT language FROM languages
733,world_1,SELECT count(DISTINCT LANGUAGE) FROM countryla...,What is the number of distinct languages used ...,"[SELECT, count, (, DISTINCT, LANGUAGE, ), FROM...","[select, count, (, distinct, language, ), from...","[What, is, the, number, of, distinct, language...","""Write a query that answers the following ques...",\n\nSELECT DISTINCT language FROM languages
734,world_1,SELECT count(DISTINCT GovernmentForm) FROM cou...,How many type of governments are in Africa?,"[SELECT, count, (, DISTINCT, GovernmentForm, )...","[select, count, (, distinct, governmentform, )...","[How, many, type, of, governments, are, in, Af...","""Write a query that answers the following ques...",\n\nSELECT count(*) FROM government
735,world_1,SELECT count(DISTINCT GovernmentForm) FROM cou...,How many different forms of governments are th...,"[SELECT, count, (, DISTINCT, GovernmentForm, )...","[select, count, (, distinct, governmentform, )...","[How, many, different, forms, of, governments,...","""Write a query that answers the following ques...",\n\nSELECT DISTINCT form_of_government FROM...
736,world_1,SELECT COUNT(T2.Language) FROM country AS T1 J...,What is the total number of languages used in ...,"[SELECT, COUNT, (, T2.Language, ), FROM, count...","[select, count, (, t2, ., language, ), from, c...","[What, is, the, total, number, of, languages, ...","""Write a query that answers the following ques...",\n\nSELECT count(*) FROM languages
737,world_1,SELECT COUNT(T2.Language) FROM country AS T1 J...,How many languages are spoken in Aruba?,"[SELECT, COUNT, (, T2.Language, ), FROM, count...","[select, count, (, t2, ., language, ), from, c...","[How, many, languages, are, spoken, in, Aruba, ?]","""Write a query that answers the following ques...",\n\nSELECT COUNT(*) FROM languages
738,world_1,SELECT COUNT(*) FROM country AS T1 JOIN countr...,How many official languages does Afghanistan h...,"[SELECT, COUNT, (, *, ), FROM, country, AS, T1...","[select, count, (, *, ), from, country, as, t1...","[How, many, official, languages, does, Afghani...","""Write a query that answers the following ques...",\n\nSELECT COUNT(*) FROM languages WHERE lang...
739,world_1,SELECT COUNT(*) FROM country AS T1 JOIN countr...,How many official languages are spoken in Afgh...,"[SELECT, COUNT, (, *, ), FROM, country, AS, T1...","[select, count, (, *, ), from, country, as, t1...","[How, many, official, languages, are, spoken, ...","""Write a query that answers the following ques...",\n\nSELECT COUNT(*) FROM languages WHERE lang...
740,world_1,SELECT T1.Name FROM country AS T1 JOIN country...,What is name of the country that speaks the la...,"[SELECT, T1.Name, FROM, country, AS, T1, JOIN,...","[select, t1, ., name, from, country, as, t1, j...","[What, is, name, of, the, country, that, speak...","""Write a query that answers the following ques...",\n\nSELECT country_name FROM languages ORDER ...
741,world_1,SELECT T1.Name FROM country AS T1 JOIN country...,Give the name of the nation that uses the grea...,"[SELECT, T1.Name, FROM, country, AS, T1, JOIN,...","[select, t1, ., name, from, country, as, t1, j...","[Give, the, name, of, the, nation, that, uses,...","""Write a query that answers the following ques...",\n\nSELECT nation FROM nation ORDER BY count...
742,world_1,SELECT T1.Continent FROM country AS T1 JOIN co...,Which continent has the most diverse languages?,"[SELECT, T1.Continent, FROM, country, AS, T1, ...","[select, t1, ., continent, from, country, as, ...","[Which, continent, has, the, most, diverse, la...","""Write a query that answers the following ques...",\n\nSELECT continent FROM languages GROUP B...
743,world_1,SELECT T1.Continent FROM country AS T1 JOIN co...,Which continent speaks the most languages?,"[SELECT, T1.Continent, FROM, country, AS, T1, ...","[select, t1, ., continent, from, country, as, ...","[Which, continent, speaks, the, most, language...","""Write a query that answers the following ques...","\n\nSELECT continent , count(*) AS total_l..."
744,world_1,SELECT COUNT(*) FROM (SELECT T1.Name FROM coun...,How many countries speak both English and Dutch?,"[SELECT, COUNT, (, *, ), FROM, (, SELECT, T1.N...","[select, count, (, *, ), from, (, select, t1, ...","[How, many, countries, speak, both, English, a...","""Write a query that answers the following ques...",\n\nSELECT COUNT(*) FROM country WHERE langua...
745,world_1,SELECT COUNT(*) FROM (SELECT T1.Name FROM coun...,What is the number of nations that use English...,"[SELECT, COUNT, (, *, ), FROM, (, SELECT, T1.N...","[select, count, (, *, ), from, (, select, t1, ...","[What, is, the, number, of, nations, that, use...","""Write a query that answers the following ques...",\n\nSELECT count(*) FROM nation WHERE languag...
746,world_1,SELECT T1.Name FROM country AS T1 JOIN country...,What are the names of nations speak both Engli...,"[SELECT, T1.Name, FROM, country, AS, T1, JOIN,...","[select, t1, ., name, from, country, as, t1, j...","[What, are, the, names, of, nations, speak, bo...","""Write a query that answers the following ques...",\n\nSELECT nations FROM nations WHERE la...
747,world_1,SELECT T1.Name FROM country AS T1 JOIN country...,Give the names of nations that speak both Engl...,"[SELECT, T1.Name, FROM, country, AS, T1, JOIN,...","[select, t1, ., name, from, country, as, t1, j...","[Give, the, names, of, nations, that, speak, b...","""Write a query that answers the following ques...",<strong>SELECT</strong> name FROM nation WHE...
748,world_1,SELECT T1.Name FROM country AS T1 JOIN country...,What are the names of nations where both Engli...,"[SELECT, T1.Name, FROM, country, AS, T1, JOIN,...","[select, t1, ., name, from, country, as, t1, j...","[What, are, the, names, of, nations, where, bo...","""Write a query that answers the following ques...",\n\nSELECT nation_name FROM nations WHERE of...
749,world_1,SELECT T1.Name FROM country AS T1 JOIN country...,Give the names of countries with English and F...,"[SELECT, T1.Name, FROM, country, AS, T1, JOIN,...","[select, t1, ., name, from, country, as, t1, j...","[Give, the, names, of, countries, with, Englis...","""Write a query that answers the following ques...",<strong>SELECT</strong> country_name <stron...
750,world_1,SELECT COUNT( DISTINCT Continent) FROM country...,What is the number of distinct continents wher...,"[SELECT, COUNT, (, DISTINCT, Continent, ), FRO...","[select, count, (, distinct, continent, ), fro...","[What, is, the, number, of, distinct, continen...","""Write a query that answers the following ques...",\n\nSELECT DISTINCT continent FROM languages ...
751,world_1,SELECT COUNT( DISTINCT Continent) FROM country...,How many continents speak Chinese?,"[SELECT, COUNT, (, DISTINCT, Continent, ), FRO...","[select, count, (, distinct, continent, ), fro...","[How, many, continents, speak, Chinese, ?]","""Write a query that answers the following ques...",\n\nSELECT count(*) FROM continent WHERE lang...
752,world_1,SELECT DISTINCT T1.Region FROM country AS T1 J...,What are the regions that use English or Dutch?,"[SELECT, DISTINCT, T1.Region, FROM, country, A...","[select, distinct, t1, ., region, from, countr...","[What, are, the, regions, that, use, English, ...","""Write a query that answers the following ques...",\n\nSELECT region_name FROM region WHERE l...
753,world_1,SELECT DISTINCT T1.Region FROM country AS T1 J...,Which regions speak Dutch or English?,"[SELECT, DISTINCT, T1.Region, FROM, country, A...","[select, distinct, t1, ., region, from, countr...","[Which, regions, speak, Dutch, or, English, ?]","""Write a query that answers the following ques...",\n\nSELECT region_name FROM regions WHERE la...
754,world_1,select t1.name from country as t1 join country...,What are the countries where either English or...,"[select, t1.name, from, country, as, t1, join,...","[select, t1, ., name, from, country, as, t1, j...","[What, are, the, countries, where, either, Eng...","""Write a query that answers the following ques...",\n\nSELECT country_name FROM countries WHERE...
755,world_1,SELECT * FROM country AS T1 JOIN countrylangua...,Which countries have either English or Dutch a...,"[SELECT, *, FROM, country, AS, T1, JOIN, count...","[select, *, from, country, as, t1, join, count...","[Which, countries, have, either, English, or, ...","""Write a query that answers the following ques...",\n\nSELECT DISTINCT country FROM country WHER...
756,world_1,SELECT T2.Language FROM country AS T1 JOIN cou...,Which language is the most popular on the Asia...,"[SELECT, T2.Language, FROM, country, AS, T1, J...","[select, t2, ., language, from, country, as, t...","[Which, language, is, the, most, popular, on, ...","""Write a query that answers the following ques...",\n\nSELECT language FROM languages WHERE ...
757,world_1,SELECT T2.Language FROM country AS T1 JOIN cou...,What is the language that is used by the large...,"[SELECT, T2.Language, FROM, country, AS, T1, J...","[select, t2, ., language, from, country, as, t...","[What, is, the, language, that, is, used, by, ...","""Write a query that answers the following ques...",\n\nSELECT language FROM country WHERE c...
758,world_1,SELECT T2.Language FROM country AS T1 JOIN cou...,Which languages are spoken by only one country...,"[SELECT, T2.Language, FROM, country, AS, T1, J...","[select, t2, ., language, from, country, as, t...","[Which, languages, are, spoken, by, only, one,...","""Write a query that answers the following ques...",\n\nSELECT languages FROM countries WHERE ...
759,world_1,SELECT T2.Language FROM country AS T1 JOIN cou...,What languages are only used by a single count...,"[SELECT, T2.Language, FROM, country, AS, T1, J...","[select, t2, ., language, from, country, as, t...","[What, languages, are, only, used, by, a, sing...","""Write a query that answers the following ques...",\n\nSELECT language FROM languages WHERE cou...
760,world_1,"SELECT T1.Name , T1.Population FROM city AS T...",Find the city with the largest population that...,"[SELECT, T1.Name, ,, T1.Population, FROM, city...","[select, t1, ., name, ,, t1, ., population, fr...","[Find, the, city, with, the, largest, populati...","""Write a query that answers the following ques...",\n\nSELECT city FROM city WHERE population > ...
761,world_1,"SELECT T1.Name , T1.Population FROM city AS T...",What is the most populace city that speaks Eng...,"[SELECT, T1.Name, ,, T1.Population, FROM, city...","[select, t1, ., name, ,, t1, ., population, fr...","[What, is, the, most, populace, city, that, sp...","""Write a query that answers the following ques...",\n\nSELECT city_name FROM city WHERE lan...
762,world_1,"SELECT Name , Population , LifeExpectancy FR...","Find the name, population and expected life le...","[SELECT, Name, ,, Population, ,, LifeExpectanc...","[select, name, ,, population, ,, lifeexpectanc...","[Find, the, name, ,, population, and, expected...","""Write a query that answers the following ques...","\n\nSELECT country_name , population , expect..."
763,world_1,"SELECT Name , Population , LifeExpectancy FR...","What are the name, population, and life expect...","[SELECT, Name, ,, Population, ,, LifeExpectanc...","[select, name, ,, population, ,, lifeexpectanc...","[What, are, the, name, ,, population, ,, and, ...","""Write a query that answers the following ques...","\n\nSELECT name, population, life_expectancy ..."
764,world_1,SELECT avg(LifeExpectancy) FROM country WHERE ...,What is average life expectancy in the countri...,"[SELECT, avg, (, LifeExpectancy, ), FROM, coun...","[select, avg, (, lifeexpectancy, ), from, coun...","[What, is, average, life, expectancy, in, the,...","""Write a query that answers the following ques...","\n\nSELECT country_name , AVG(life_expectan..."
765,world_1,SELECT avg(LifeExpectancy) FROM country WHERE ...,Give the mean life expectancy of countries in ...,"[SELECT, avg, (, LifeExpectancy, ), FROM, coun...","[select, avg, (, lifeexpectancy, ), from, coun...","[Give, the, mean, life, expectancy, of, countr...","""Write a query that answers the following ques...",\n\nSELECT mean_life_expectancy FROM countri...
766,world_1,SELECT sum(Population) FROM country WHERE Name...,What is the total number of people living in t...,"[SELECT, sum, (, Population, ), FROM, country,...","[select, sum, (, population, ), from, country,...","[What, is, the, total, number, of, people, liv...","""Write a query that answers the following ques...",\n\nSELECT COUNT(*) FROM nation WHERE languag...
767,world_1,SELECT sum(Population) FROM country WHERE Name...,How many people live in countries that do not ...,"[SELECT, sum, (, Population, ), FROM, country,...","[select, sum, (, population, ), from, country,...","[How, many, people, live, in, countries, that,...","""Write a query that answers the following ques...",\n\nSELECT COUNT(*) FROM people WHERE country...
768,world_1,SELECT T2.Language FROM country AS T1 JOIN cou...,What is the official language spoken in the co...,"[SELECT, T2.Language, FROM, country, AS, T1, J...","[select, t2, ., language, from, country, as, t...","[What, is, the, official, language, spoken, in...","""Write a query that answers the following ques...",\n\nSELECT language FROM country WHERE head...
769,world_1,SELECT T2.Language FROM country AS T1 JOIN cou...,What is the official language used in the coun...,"[SELECT, T2.Language, FROM, country, AS, T1, J...","[select, t2, ., language, from, country, as, t...","[What, is, the, official, language, used, in, ...","""Write a query that answers the following ques...",\n\nSELECT language FROM country WHERE name ...
770,world_1,SELECT count(DISTINCT T2.Language) FROM countr...,What is the total number of unique official la...,"[SELECT, count, (, DISTINCT, T2.Language, ), F...","[select, count, (, distinct, t2, ., language, ...","[What, is, the, total, number, of, unique, off...","""Write a query that answers the following ques...",\n\nSELECT COUNT(DISTINCT official_language) ...
771,world_1,SELECT count(DISTINCT T2.Language) FROM countr...,"For the countries founded before 1930, what is...","[SELECT, count, (, DISTINCT, T2.Language, ), F...","[select, count, (, distinct, t2, ., language, ...","[For, the, countries, founded, before, 1930, ,...","""Write a query that answers the following ques...",\n\nSELECT COUNT(DISTINCT official_language) ...
772,world_1,SELECT Name FROM country WHERE SurfaceArea > ...,What are the countries that have greater surfa...,"[SELECT, Name, FROM, country, WHERE, SurfaceAr...","[select, name, from, country, where, surfacear...","[What, are, the, countries, that, have, greate...","""Write a query that answers the following ques...",\n\nSELECT DISTINCT country FROM countries WH...
773,world_1,SELECT Name FROM country WHERE SurfaceArea > ...,Which countries have greater area than that of...,"[SELECT, Name, FROM, country, WHERE, SurfaceAr...","[select, name, from, country, where, surfacear...","[Which, countries, have, greater, area, than, ...","""Write a query that answers the following ques...",\n\nSELECT country_name FROM countries WHERE...
774,world_1,"SELECT Name FROM country WHERE Continent = ""...",What are the African countries that have a po...,"[SELECT, Name, FROM, country, WHERE, Continent...","[select, name, from, country, where, continent...","[What, are, the, African, countries, that, hav...","""Write a query that answers the following ques...",\n\nSELECT DISTINCT country FROM countries WH...
775,world_1,"SELECT Name FROM country WHERE Continent = ""...",Which African countries have a smaller populat...,"[SELECT, Name, FROM, country, WHERE, Continent...","[select, name, from, country, where, continent...","[Which, African, countries, have, a, smaller, ...","""Write a query that answers the following ques...",\n\nSELECT country_name FROM countries WHERE...
776,world_1,"SELECT Name FROM country WHERE Continent = ""...",Which Asian countries have a population that i...,"[SELECT, Name, FROM, country, WHERE, Continent...","[select, name, from, country, where, continent...","[Which, Asian, countries, have, a, population,...","""Write a query that answers the following ques...",\n\nSELECT country_name FROM countries WHER...
777,world_1,"SELECT Name FROM country WHERE Continent = ""...",What are the Asian countries which have a popu...,"[SELECT, Name, FROM, country, WHERE, Continent...","[select, name, from, country, where, continent...","[What, are, the, Asian, countries, which, have...","""Write a query that answers the following ques...",\n\nSELECT country_name FROM countries WHERE...
778,world_1,SELECT CountryCode FROM countrylanguage EXCEPT...,What are the country codes for countries that ...,"[SELECT, CountryCode, FROM, countrylanguage, E...","[select, countrycode, from, countrylanguage, e...","[What, are, the, country, codes, for, countrie...","""Write a query that answers the following ques...",\n\nSELECT DISTINCT country_code FROM country...

====================================================================================================
(51, 7)
Input:  ['"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Return the country codes for countries that do not speak English. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the country codes of countries where people use languages other than English? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Give the country codes for countries in which people speak langauges that are not English. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the codes of the countries that do not speak English and whose government forms are not Republic? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Return the codes of countries that do not speak English and do not have Republics for governments. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Which cities are in European countries where English is not the official language? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the names of cities in Europe for which English is not the official language? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Which unique cities are in Asian countries where Chinese is the official language ? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Return the different names of cities that are in Asia and for which Chinese is the official language. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the name, independence year, and surface area of the country with the smallest population? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Give the name, year of independence, and surface area of the country that has the lowest population. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the population, name and leader of the country with the largest area? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Give the name, population, and head of state for the country that has the largest area. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Return the country name and the numbers of languages spoken for each country that speaks at least 3 languages. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the names of countries that speak more than 2 languages, as well as how many languages they speak? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Find the number of cities in each district whose population is greater than the average population of cities? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> How many cities in each district have a population that is above the average population across all cities? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Find the government form name and total population for each government form whose average life expectancy is longer than 72. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the different government forms and what is the total population of each for government forms that have an average life expectancy greater than 72? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Find the average life expectancy and total population for each continent where the average life expectancy is shorter than 72? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the different continents and the total popuation and average life expectancy corresponding to each, for continents that have an average life expectancy less than 72? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the names and areas of countries with the top 5 largest area? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Return the names and surface areas of the 5 largest countries. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are names of countries with the top 3 largest population? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Return the names of the 3 most populated countries. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the names of the nations with the 3 lowest populations? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Return the names of the 3 countries with the fewest people. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> how many countries are in Asia? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Count the number of countries in Asia. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the names of the countries that are in the continent of Europe and have a population of 80000? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Give the names of countries that are in Europe and have a population equal to 80000. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the total population and average area of countries in the continent of North America whose area is bigger than 3000 ? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Give the total population and average surface area corresponding to countries in North America that have a surface area greater than 3000 . <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the cities whose population is between 160000 and 900000? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Return the names of cities that have a population between 160000 and 900000 . <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Which language is spoken by the largest number of countries? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Give the language that is spoken in the most countries. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the language spoken by the largest percentage of people in each country? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the country codes of the different countries, and what are the languages spoken by the greatest percentage of people for each? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the total number of countries where Spanish is spoken by the largest percentage of people? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Count the number of countries for which Spanish is the predominantly spoken language. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the codes of countries where Spanish is spoken by the largest percentage of people? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Return the codes of countries for which Spanish is the predominantly spoken language. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> How many conductors are there? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Count the number of conductors. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> List the names of conductors in ascending order of age. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the names of conductors, ordered by age? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the names of conductors whose nationalities are not "USA"? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Return the names of conductors that do not have the nationality "USA". <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the record companies of orchestras in descending order of years in which they were founded? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Return the record companies of orchestras, sorted descending by the years in which they were founded. <query> ']
Original query:
SELECT CountryCode FROM countrylanguage EXCEPT SELECT CountryCode FROM countrylanguage WHERE LANGUAGE  =  "English"
Generated query:


SELECT country_code FROM country WHERE language_code <> 'en'<eos>
____________________________________________________________________________________________________
Original query:
SELECT DISTINCT CountryCode FROM countrylanguage WHERE LANGUAGE != "English"
Generated query:


SELECT country_code FROM country WHERE language_code <> 'en'<eos>
____________________________________________________________________________________________________
Original query:
SELECT DISTINCT CountryCode FROM countrylanguage WHERE LANGUAGE != "English"
Generated query:


SELECT country_code FROM country WHERE language_code NOT IN (SELECT language_code FROM language WHERE language_name = 'English')<eos>
____________________________________________________________________________________________________
Original query:
SELECT Code FROM country WHERE GovernmentForm != "Republic" EXCEPT SELECT CountryCode FROM countrylanguage WHERE LANGUAGE  =  "English"
Generated query:


SELECT  country_code FROM countries WHERE  language_code  <>  "en" AND  government_form  <>  "Republic"<eos>
____________________________________________________________________________________________________
Original query:
SELECT Code FROM country WHERE GovernmentForm != "Republic" EXCEPT SELECT CountryCode FROM countrylanguage WHERE LANGUAGE  =  "English"
Generated query:
 <strong>SELECT</strong>  code FROM country WHERE  language  <>  "English" AND  government  <>  "Republic"<eos>
____________________________________________________________________________________________________
Original query:
SELECT DISTINCT T2.Name FROM country AS T1 JOIN city AS T2 ON T2.CountryCode  =  T1.Code WHERE T1.Continent  =  'Europe' AND T1.Name NOT IN (SELECT T3.Name FROM country AS T3 JOIN countrylanguage AS T4 ON T3.Code  =  T4.CountryCode WHERE T4.IsOfficial  =  'T' AND T4.Language  =  'English')
Generated query:


SELECT DISTINCT city FROM cities WHERE country_code  =  'EU' AND language_code  =  'ENG'<eos>
____________________________________________________________________________________________________
Original query:
SELECT DISTINCT T2.Name FROM country AS T1 JOIN city AS T2 ON T2.CountryCode  =  T1.Code WHERE T1.Continent  =  'Europe' AND T1.Name NOT IN (SELECT T3.Name FROM country AS T3 JOIN countrylanguage AS T4 ON T3.Code  =  T4.CountryCode WHERE T4.IsOfficial  =  'T' AND T4.Language  =  'English')
Generated query:


SELECT DISTINCT city_name FROM cities WHERE language_code <> 'en'<eos>
____________________________________________________________________________________________________
Original query:
select distinct t3.name from country as t1 join countrylanguage as t2 on t1.code  =  t2.countrycode join city as t3 on t1.code  =  t3.countrycode where t2.isofficial  =  't' and t2.language  =  'chinese' and t1.continent  =  "asia"
Generated query:


SELECT DISTINCT city FROM cities WHERE country_code  =  "CN"<eos>
____________________________________________________________________________________________________
Original query:
SELECT DISTINCT T3.Name FROM country AS T1 JOIN countrylanguage AS T2 ON T1.Code  =  T2.CountryCode JOIN city AS T3 ON T1.Code  =  T3.CountryCode WHERE T2.IsOfficial  =  'T' AND T2.Language  =  'Chinese' AND T1.Continent  =  "Asia"
Generated query:
 <strong>SELECT DISTINCT city_name FROM cities WHERE country_name = 'Asia' AND official_language = 'Chinese'</strong><eos>
____________________________________________________________________________________________________
Original query:
SELECT Name ,  SurfaceArea ,  IndepYear FROM country ORDER BY Population LIMIT 1
Generated query:


SELECT  country_name ,  year_of_independence ,  surface_area  FROM  country  WHERE  population  <  10000000<eos>
____________________________________________________________________________________________________
Original query:
SELECT Name ,  SurfaceArea ,  IndepYear FROM country ORDER BY Population LIMIT 1
Generated query:


SELECT  country_name ,  year_of_independence ,  surface_area  FROM  country  WHERE  population  =  (SELECT  MIN(population)  FROM  country)<eos>
____________________________________________________________________________________________________
Original query:
SELECT Name ,  population ,  HeadOfState FROM country ORDER BY SurfaceArea DESC LIMIT 1
Generated query:


SELECT population, name, leader FROM country ORDER BY area DESC LIMIT 1<eos>
____________________________________________________________________________________________________
Original query:
SELECT Name ,  population ,  HeadOfState FROM country ORDER BY SurfaceArea DESC LIMIT 1
Generated query:


SELECT  country_name , population , head_of_state FROM countries ORDER BY area DESC LIMIT 1<eos>
____________________________________________________________________________________________________
Original query:
SELECT COUNT(T2.Language) ,  T1.Name FROM country AS T1 JOIN countrylanguage AS T2 ON T1.Code  =  T2.CountryCode GROUP BY T1.Name HAVING COUNT(*)  >  2
Generated query:


SELECT country_name , count(*) FROM languages GROUP BY country_name HAVING count(*) >= 3<eos>
____________________________________________________________________________________________________
Original query:
SELECT COUNT(T2.Language) ,  T1.Name FROM country AS T1 JOIN countrylanguage AS T2 ON T1.Code  =  T2.CountryCode GROUP BY T1.Name HAVING COUNT(*)  >  2
Generated query:


SELECT  country_name ,  count(*) AS  "number of languages" FROM  languages GROUP BY  country_name HAVING  count(*) >  2<eos>
____________________________________________________________________________________________________
Original query:
SELECT count(*) ,  District FROM city WHERE Population  >  (SELECT avg(Population) FROM city) GROUP BY District
Generated query:


SELECT COUNT(*) FROM city_district GROUP BY district HAVING AVG(population) <  (SELECT AVG(population) FROM city_district)<eos>
____________________________________________________________________________________________________
Original query:
SELECT count(*) ,  District FROM city WHERE Population  >  (SELECT avg(Population) FROM city) GROUP BY District
Generated query:


SELECT  count(*) AS total_city_population ,  district_name  FROM  city  GROUP BY  district_name  HAVING  count(*) >  (SELECT  AVG(population)  FROM  city)<eos>
____________________________________________________________________________________________________
Original query:
SELECT sum(Population) ,  GovernmentForm FROM country GROUP BY GovernmentForm HAVING avg(LifeExpectancy)  >  72
Generated query:


SELECT  form_name ,  total_population FROM  government_form WHERE  average_life_expectancy >  72<eos>
____________________________________________________________________________________________________
Original query:
SELECT sum(Population) ,  GovernmentForm FROM country GROUP BY GovernmentForm HAVING avg(LifeExpectancy)  >  72
Generated query:


SELECT DISTINCT  government_form ,  total_population FROM  population_by_government_form WHERE  average_life_expectancy > 72<eos>
____________________________________________________________________________________________________
Original query:
SELECT sum(Population) ,  avg(LifeExpectancy) ,  Continent FROM country GROUP BY Continent HAVING avg(LifeExpectancy)  <  72
Generated query:


SELECT continent, avg_life_expectancy, total_population FROM continent WHERE avg_life_expectancy < 72<eos>
____________________________________________________________________________________________________
Original query:
SELECT sum(Population) ,  avg(LifeExpectancy) ,  Continent FROM country GROUP BY Continent HAVING avg(LifeExpectancy)  <  72
Generated query:


SELECT continent ,  total_population ,  average_life_expectancy FROM  continent WHERE average_life_expectancy < 72<eos>
____________________________________________________________________________________________________
Original query:
SELECT Name ,  SurfaceArea FROM country ORDER BY SurfaceArea DESC LIMIT 5
Generated query:


SELECT country_name , area FROM countries ORDER BY area DESC LIMIT 5<eos>
____________________________________________________________________________________________________
Original query:
SELECT Name ,  SurfaceArea FROM country ORDER BY SurfaceArea DESC LIMIT 5
Generated query:
 <strong>SELECT country_name , surface_area FROM countries ORDER BY surface_area DESC LIMIT 5</strong><eos>
____________________________________________________________________________________________________
Original query:
SELECT Name FROM country ORDER BY Population DESC LIMIT 3

,db_id,query,question,query_toks,query_toks_no_value,question_toks,modified question,generated_query
779,world_1,SELECT CountryCode FROM countrylanguage EXCEPT...,Return the country codes for countries that do...,"[SELECT, CountryCode, FROM, countrylanguage, E...","[select, countrycode, from, countrylanguage, e...","[Return, the, country, codes, for, countries, ...","""Write a query that answers the following ques...",\n\nSELECT country_code FROM country WHERE la...
780,world_1,SELECT DISTINCT CountryCode FROM countrylangua...,What are the country codes of countries where ...,"[SELECT, DISTINCT, CountryCode, FROM, countryl...","[select, distinct, countrycode, from, countryl...","[What, are, the, country, codes, of, countries...","""Write a query that answers the following ques...",\n\nSELECT country_code FROM country WHERE la...
781,world_1,SELECT DISTINCT CountryCode FROM countrylangua...,Give the country codes for countries in which ...,"[SELECT, DISTINCT, CountryCode, FROM, countryl...","[select, distinct, countrycode, from, countryl...","[Give, the, country, codes, for, countries, in...","""Write a query that answers the following ques...",\n\nSELECT country_code FROM country WHERE la...
782,world_1,SELECT Code FROM country WHERE GovernmentForm ...,What are the codes of the countries that do no...,"[SELECT, Code, FROM, country, WHERE, Governmen...","[select, code, from, country, where, governmen...","[What, are, the, codes, of, the, countries, th...","""Write a query that answers the following ques...",\n\nSELECT country_code FROM countries WHERE...
783,world_1,SELECT Code FROM country WHERE GovernmentForm ...,Return the codes of countries that do not spea...,"[SELECT, Code, FROM, country, WHERE, Governmen...","[select, code, from, country, where, governmen...","[Return, the, codes, of, countries, that, do, ...","""Write a query that answers the following ques...",<strong>SELECT</strong> code FROM country WH...
784,world_1,SELECT DISTINCT T2.Name FROM country AS T1 JOI...,Which cities are in European countries where E...,"[SELECT, DISTINCT, T2.Name, FROM, country, AS,...","[select, distinct, t2, ., name, from, country,...","[Which, cities, are, in, European, countries, ...","""Write a query that answers the following ques...",\n\nSELECT DISTINCT city FROM cities WHERE co...
785,world_1,SELECT DISTINCT T2.Name FROM country AS T1 JOI...,What are the names of cities in Europe for whi...,"[SELECT, DISTINCT, T2.Name, FROM, country, AS,...","[select, distinct, t2, ., name, from, country,...","[What, are, the, names, of, cities, in, Europe...","""Write a query that answers the following ques...",\n\nSELECT DISTINCT city_name FROM cities WHE...
786,world_1,select distinct t3.name from country as t1 joi...,Which unique cities are in Asian countries whe...,"[select, distinct, t3.name, from, country, as,...","[select, distinct, t3, ., name, from, country,...","[Which, unique, cities, are, in, Asian, countr...","""Write a query that answers the following ques...",\n\nSELECT DISTINCT city FROM cities WHERE co...
787,world_1,SELECT DISTINCT T3.Name FROM country AS T1 JOI...,Return the different names of cities that are ...,"[SELECT, DISTINCT, T3.Name, FROM, country, AS,...","[select, distinct, t3, ., name, from, country,...","[Return, the, different, names, of, cities, th...","""Write a query that answers the following ques...",<strong>SELECT DISTINCT city_name FROM cities...
788,world_1,"SELECT Name , SurfaceArea , IndepYear FROM c...","What are the name, independence year, and surf...","[SELECT, Name, ,, SurfaceArea, ,, IndepYear, F...","[select, name, ,, surfacearea, ,, indepyear, f...","[What, are, the, name, ,, independence, year, ...","""Write a query that answers the following ques...","\n\nSELECT country_name , year_of_independe..."
789,world_1,"SELECT Name , SurfaceArea , IndepYear FROM c...","Give the name, year of independence, and surfa...","[SELECT, Name, ,, SurfaceArea, ,, IndepYear, F...","[select, name, ,, surfacearea, ,, indepyear, f...","[Give, the, name, ,, year, of, independence, ,...","""Write a query that answers the following ques...","\n\nSELECT country_name , year_of_independe..."
790,world_1,"SELECT Name , population , HeadOfState FROM ...","What are the population, name and leader of th...","[SELECT, Name, ,, population, ,, HeadOfState, ...","[select, name, ,, population, ,, headofstate, ...","[What, are, the, population, ,, name, and, lea...","""Write a query that answers the following ques...","\n\nSELECT population, name, leader FROM coun..."
791,world_1,"SELECT Name , population , HeadOfState FROM ...","Give the name, population, and head of state f...","[SELECT, Name, ,, population, ,, HeadOfState, ...","[select, name, ,, population, ,, headofstate, ...","[Give, the, name, ,, population, ,, and, head,...","""Write a query that answers the following ques...","\n\nSELECT country_name , population , head_..."
792,world_1,"SELECT COUNT(T2.Language) , T1.Name FROM coun...",Return the country name and the numbers of lan...,"[SELECT, COUNT, (, T2.Language, ), ,, T1.Name,...","[select, count, (, t2, ., language, ), ,, t1, ...","[Return, the, country, name, and, the, numbers...","""Write a query that answers the following ques...","\n\nSELECT country_name , count(*) FROM langu..."
793,world_1,"SELECT COUNT(T2.Language) , T1.Name FROM coun...",What are the names of countries that speak mor...,"[SELECT, COUNT, (, T2.Language, ), ,, T1.Name,...","[select, count, (, t2, ., language, ), ,, t1, ...","[What, are, the, names, of, countries, that, s...","""Write a query that answers the following ques...","\n\nSELECT country_name , count(*) AS ""num..."
794,world_1,"SELECT count(*) , District FROM city WHERE Po...",Find the number of cities in each district who...,"[SELECT, count, (, *, ), ,, District, FROM, ci...","[select, count, (, *, ), ,, district, from, ci...","[Find, the, number, of, cities, in, each, dist...","""Write a query that answers the following ques...",\n\nSELECT COUNT(*) FROM city_district GROUP ...
795,world_1,"SELECT count(*) , District FROM city WHERE Po...",How many cities in each district have a popula...,"[SELECT, count, (, *, ), ,, District, FROM, ci...","[select, count, (, *, ), ,, district, from, ci...","[How, many, cities, in, each, district, have, ...","""Write a query that answers the following ques...",\n\nSELECT count(*) AS total_city_population...
796,world_1,"SELECT sum(Population) , GovernmentForm FROM ...",Find the government form name and total popula...,"[SELECT, sum, (, Population, ), ,, GovernmentF...","[select, sum, (, population, ), ,, governmentf...","[Find, the, government, form, name, and, total...","""Write a query that answers the following ques...","\n\nSELECT form_name , total_population FRO..."
797,world_1,"SELECT sum(Population) , GovernmentForm FROM ...",What are the different government forms and wh...,"[SELECT, sum, (, Population, ), ,, GovernmentF...","[select, sum, (, population, ), ,, governmentf...","[What, are, the, different, government, forms,...","""Write a query that answers the following ques...","\n\nSELECT DISTINCT government_form , total..."
798,world_1,"SELECT sum(Population) , avg(LifeExpectancy) ...",Find the average life expectancy and total pop...,"[SELECT, sum, (, Population, ), ,, avg, (, Lif...","[select, sum, (, population, ), ,, avg, (, lif...","[Find, the, average, life, expectancy, and, to...","""Write a query that answers the following ques...","\n\nSELECT continent, avg_life_expectancy, to..."
799,world_1,"SELECT sum(Population) , avg(LifeExpectancy) ...",What are the different continents and the tota...,"[SELECT, sum, (, Population, ), ,, avg, (, Lif...","[select, sum, (, population, ), ,, avg, (, lif...","[What, are, the, different, continents, and, t...","""Write a query that answers the following ques...","\n\nSELECT continent , total_population , a..."
800,world_1,"SELECT Name , SurfaceArea FROM country ORDER ...",What are the names and areas of countries with...,"[SELECT, Name, ,, SurfaceArea, FROM, country, ...","[select, name, ,, surfacearea, from, country, ...","[What, are, the, names, and, areas, of, countr...","""Write a query that answers the following ques...","\n\nSELECT country_name , area FROM countries..."
801,world_1,"SELECT Name , SurfaceArea FROM country ORDER ...",Return the names and surface areas of the 5 la...,"[SELECT, Name, ,, SurfaceArea, FROM, country, ...","[select, name, ,, surfacearea, from, country, ...","[Return, the, names, and, surface, areas, of, ...","""Write a query that answers the following ques...","<strong>SELECT country_name , surface_area FR..."
802,world_1,SELECT Name FROM country ORDER BY Population D...,What are names of countries with the top 3 lar...,"[SELECT, Name, FROM, country, ORDER, BY, Popul...","[select, name, from, country, order, by, popul...","[What, are, names, of, countries, with, the, t...","""Write a query that answers the following ques...",\n\nSELECT country_name FROM country ORDER BY...
803,world_1,SELECT Name FROM country ORDER BY Population D...,Return the names of the 3 most populated count...,"[SELECT, Name, FROM, country, ORDER, BY, Popul...","[select, name, from, country, order, by, popul...","[Return, the, names, of, the, 3, most, populat...","""Write a query that answers the following ques...",\n\nSELECT country FROM city GROUP BY count...
804,world_1,SELECT Name FROM country ORDER BY Population A...,What are the names of the nations with the 3 l...,"[SELECT, Name, FROM, country, ORDER, BY, Popul...","[select, name, from, country, order, by, popul...","[What, are, the, names, of, the, nations, with...","""Write a query that answers the following ques...",\n\nSELECT nation_name FROM nations ORDER BY...
805,world_1,SELECT Name FROM country ORDER BY Population A...,Return the names of the 3 countries with the f...,"[SELECT, Name, FROM, country, ORDER, BY, Popul...","[select, name, from, country, order, by, popul...","[Return, the, names, of, the, 3, countries, wi...","""Write a query that answers the following ques...",\n\nSELECT country FROM countries GROUP BY...
806,world_1,SELECT count(*) FROM country WHERE continent ...,how many countries are in Asia?,"[SELECT, count, (, *, ), FROM, country, WHERE,...","[select, count, (, *, ), from, country, where,...","[how, many, countries, are, in, Asia, ?]","""Write a query that answers the following ques...",\n\nSELECT count(*) FROM country WHERE contin...
807,world_1,SELECT count(*) FROM country WHERE continent ...,Count the number of countries in Asia.,"[SELECT, count, (, *, ), FROM, country, WHERE,...","[select, count, (, *, ), from, country, where,...","[Count, the, number, of, countries, in, Asia, .]","""Write a query that answers the following ques...",\n\nSELECT COUNT(*) FROM countries WHERE cont...
808,world_1,"SELECT Name FROM country WHERE continent = ""...",What are the names of the countries that are i...,"[SELECT, Name, FROM, country, WHERE, continent...","[select, name, from, country, where, continent...","[What, are, the, names, of, the, countries, th...","""Write a query that answers the following ques...",\n\nSELECT country_name FROM countries WHERE...
809,world_1,"SELECT Name FROM country WHERE continent = ""...",Give the names of countries that are in Europe...,"[SELECT, Name, FROM, country, WHERE, continent...","[select, name, from, country, where, continent...","[Give, the, names, of, countries, that, are, i...","""Write a query that answers the following ques...",<strong>SELECT country FROM countries WHERE p...
810,world_1,"select sum(population) , avg(surfacearea) fro...",What is the total population and average area ...,"[select, sum, (, population, ), ,, avg, (, sur...","[select, sum, (, population, ), ,, avg, (, sur...","[What, is, the, total, population, and, averag...","""Write a query that answers the following ques...","\n\nSELECT SUM(population) , AVG(area) FROM c..."
811,world_1,"select sum(population) , avg(surfacearea) fro...",Give the total population and average surface ...,"[select, sum, (, population, ), ,, avg, (, sur...","[select, sum, (, population, ), ,, avg, (, sur...","[Give, the, total, population, and, average, s...","""Write a query that answers the following ques...","\n\nSELECT SUM(population) , AVG(surface_area..."
812,world_1,SELECT name FROM city WHERE Population BETWEEN...,What are the cities whose population is betwee...,"[SELECT, name, FROM, city, WHERE, Population, ...","[select, name, from, city, where, population, ...","[What, are, the, cities, whose, population, is...","""Write a query that answers the following ques...",\n\nSELECT city FROM city WHERE population B...
813,world_1,select name from city where population between...,Return the names of cities that have a populat...,"[select, name, from, city, where, population, ...","[select, name, from, city, where, population, ...","[Return, the, names, of, cities, that, have, a...","""Write a query that answers the following ques...",<strong>SELECT city FROM city WHERE populatio...
814,world_1,SELECT LANGUAGE FROM countrylanguage GROUP BY ...,Which language is spoken by the largest number...,"[SELECT, LANGUAGE, FROM, countrylanguage, GROU...","[select, language, from, countrylanguage, grou...","[Which, language, is, spoken, by, the, largest...","""Write a query that answers the following ques...","\n\nSELECT language , count(*) AS count FR..."
815,world_1,SELECT LANGUAGE FROM countrylanguage GROUP BY ...,Give the language that is spoken in the most c...,"[SELECT, LANGUAGE, FROM, countrylanguage, GROU...","[select, language, from, countrylanguage, grou...","[Give, the, language, that, is, spoken, in, th...","""Write a query that answers the following ques...",\n\nSELECT language FROM languages GROUP ...
816,world_1,"SELECT LANGUAGE , CountryCode , max(Percenta...",What is the language spoken by the largest per...,"[SELECT, LANGUAGE, ,, CountryCode, ,, max, (, ...","[select, language, ,, countrycode, ,, max, (, ...","[What, is, the, language, spoken, by, the, lar...","""Write a query that answers the following ques...","\n\nSELECT country , language FROM countr..."
817,world_1,"SELECT LANGUAGE , CountryCode , max(Percenta...",What are the country codes of the different co...,"[SELECT, LANGUAGE, ,, CountryCode, ,, max, (, ...","[select, language, ,, countrycode, ,, max, (, ...","[What, are, the, country, codes, of, the, diff...","""Write a query that answers the following ques...","\n\nSELECT country_code , language_code , ..."
818,world_1,"SELECT count(*) , max(Percentage) FROM count...",What is the total number of countries where Sp...,"[SELECT, count, (, *, ), ,, max, (, Percentage...","[select, count, (, *, ), ,, max, (, percentage...","[What, is, the, total, number, of, countries, ...","""Write a query that answers the following ques...",\n\nSELECT SUM(country_population) FROM count...
819,world_1,"SELECT count(*) , max(Percentage) FROM count...",Count the number of countries for which Spanis...,"[SELECT, count, (, *, ), ,, max, (, Percentage...","[select, count, (, *, ), ,, max, (, percentage...","[Count, the, number, of, countries, for, which...","""Write a query that answers the following ques...",\n\nSELECT COUNT(*) FROM country WHERE langua...
820,world_1,"SELECT CountryCode , max(Percentage) FROM cou...",What are the codes of countries where Spanish ...,"[SELECT, CountryCode, ,, max, (, Percentage, )...","[select, countrycode, ,, max, (, percentage, )...","[What, are, the, codes, of, countries, where, ...","""Write a query that answers the following ques...","\n\nSELECT country_code , count(*) AS count..."
821,world_1,"SELECT CountryCode , max(Percentage) FROM cou...",Return the codes of countries for which Spanis...,"[SELECT, CountryCode, ,, max, (, Percentage, )...","[select, countrycode, ,, max, (, percentage, )...","[Return, the, codes, of, countries, for, which...","""Write a query that answers the following ques...",<strong>SELECT</strong> code <strong>FROM</...
822,orchestra,SELECT count(*) FROM conductor,How many conductors are there?,"[SELECT, count, (, *, ), FROM, conductor]","[select, count, (, *, ), from, conductor]","[How, many, conductors, are, there, ?]","""Write a query that answers the following ques...",\n\nSELECT COUNT(*) FROM conductor
823,orchestra,SELECT count(*) FROM conductor,Count the number of conductors.,"[SELECT, count, (, *, ), FROM, conductor]","[select, count, (, *, ), from, conductor]","[Count, the, number, of, conductors, .]","""Write a query that answers the following ques...",\n\nSELECT COUNT(*) FROM conductor
824,orchestra,SELECT Name FROM conductor ORDER BY Age ASC,List the names of conductors in ascending orde...,"[SELECT, Name, FROM, conductor, ORDER, BY, Age...","[select, name, from, conductor, order, by, age...","[List, the, names, of, conductors, in, ascendi...","""Write a query that answers the following ques...",<strong>SELECT name FROM conductor ORDER BY ...
825,orchestra,SELECT Name FROM conductor ORDER BY Age ASC,"What are the names of conductors, ordered by age?","[SELECT, Name, FROM, conductor, ORDER, BY, Age...","[select, name, from, conductor, order, by, age...","[What, are, the, names, of, conductors, ,, ord...","""Write a query that answers the following ques...",\n\nSELECT name FROM conductor ORDER BY age
826,orchestra,SELECT Name FROM conductor WHERE Nationality !...,What are the names of conductors whose nationa...,"[SELECT, Name, FROM, conductor, WHERE, Nationa...","[select, name, from, conductor, where, nationa...","[What, are, the, names, of, conductors, whose,...","""Write a query that answers the following ques...",\n\nSELECT name FROM conductors WHERE nation...
827,orchestra,SELECT Name FROM conductor WHERE Nationality !...,Return the names of conductors that do not hav...,"[SELECT, Name, FROM, conductor, WHERE, Nationa...","[select, name, from, conductor, where, nationa...","[Return, the, names, of, conductors, that, do,...","""Write a query that answers the following ques...",<strong>SELECT name FROM conductor WHERE nati...
828,orchestra,SELECT Record_Company FROM orchestra ORDER BY ...,What are the record companies of orchestras in...,"[SELECT, Record_Company, FROM, orchestra, ORDE...","[select, record_company, from, orchestra, orde...","[What, are, the, record, companies, of, orches...","""Write a query that answers the following ques...",\n\nSELECT record_company FROM orchestra ORD...
829,orchestra,SELECT Record_Company FROM orchestra ORDER BY ...,"Return the record companies of orchestras, sor...","[SELECT, Record_Company, FROM, orchestra, ORDE...","[select, record_company, from, orchestra, orde...","[Return, the, record, companies, of, orchestra...","""Write a query that answers the following ques...",\n\nSELECT * FROM orchestras ORDER BY founde...

====================================================================================================
(51, 7)
Input:  ['"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the average attendance of shows? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Return the average attendance across all shows. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the maximum and minimum share of performances whose type is not "Live final". <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Return the maximum and minimum shares for performances that do not have the type "Live final". <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> How many different nationalities do conductors have? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Count the number of different nationalities of conductors. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> List names of conductors in descending order of years of work. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the names of conductors, sorted descending by the number of years they have worked? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> List the name of the conductor with the most years of work. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the name of the conductor who has worked the greatest number of years? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Show the names of conductors and the orchestras they have conducted. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the names of conductors as well as the corresonding orchestras that they have conducted? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Show the names of conductors that have conducted more than one orchestras. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the names of conductors who have conducted at more than one orchestra? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Show the name of the conductor that has conducted the most number of orchestras. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the name of the conductor who has conducted the most orchestras? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Please show the name of the conductor that has conducted orchestras founded after 2008. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the names of conductors who have conducted orchestras founded after the year 2008? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Please show the different record companies and the corresponding number of orchestras. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> How many orchestras does each record company manage? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Please show the record formats of orchestras in ascending order of count. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the major record formats of orchestras, sorted by their frequency? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> List the record company shared by the most number of orchestras. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the record company used by the greatest number of orchestras? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> List the names of orchestras that have no performance. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the orchestras that do not have any performances? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Show the record companies shared by orchestras founded before 2003 and after 2003. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the record companies that are used by both orchestras founded before 2003 and those founded after 2003? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Find the number of orchestras whose record format is "CD" or "DVD". <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Count the number of orchestras that have CD or DVD as their record format. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Show the years in which orchestras that have given more than one performance are founded. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are years of founding for orchestras that have had more than a single performance? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> How many high schoolers are there? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Count the number of high schoolers. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Show the names and grades of each high schooler. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the names and grades for each high schooler? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Show all the grades of the high schoolers. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the grade of each high schooler? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What grade is Kyle in? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Return the grade for the high schooler named Kyle. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Show the names of all high schoolers in grade 10. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the names of all high schoolers in grade 10? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Show the ID of the high schooler named Kyle. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is Kyle\'s id? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> How many high schoolers are there in grade 9 or 10? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Count the number of high schoolers in grades 9 or 10. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Show the number of high schoolers for each grade. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> How many high schoolers are in each grade? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Which grade has the most high schoolers? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Return the grade that has the greatest number of high schoolers. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Show me all grades that have at least 4 students. <query> ']
Original query:
SELECT avg(Attendance) FROM SHOW
Generated query:


SELECT  avg(attendance) FROM  show<eos>
____________________________________________________________________________________________________
Original query:
SELECT avg(Attendance) FROM SHOW
Generated query:
 <strong>SELECT</strong>  avg(attendance)  <strong>FROM</strong>  show<eos>
____________________________________________________________________________________________________
Original query:
SELECT max(SHARE) ,  min(SHARE) FROM performance WHERE TYPE != "Live final"
Generated query:


SELECT MAX(type) , MIN(type) FROM performances WHERE type <> "Live final"<eos>
____________________________________________________________________________________________________
Original query:
SELECT max(SHARE) ,  min(SHARE) FROM performance WHERE TYPE != "Live final"
Generated query:


SELECT MAX(share) , MIN(share) FROM performances WHERE type != "Live final"<eos>
____________________________________________________________________________________________________
Original query:
SELECT count(DISTINCT Nationality) FROM conductor
Generated query:


SELECT DISTINCT nationality FROM conductor<eos>
____________________________________________________________________________________________________
Original query:
SELECT count(DISTINCT Nationality) FROM conductor
Generated query:


SELECT COUNT(DISTINCT nationality) FROM conductor<eos>
____________________________________________________________________________________________________
Original query:
SELECT Name FROM conductor ORDER BY Year_of_Work DESC
Generated query:


SELECT  name FROM conductor ORDER BY years_of_work DESC<eos>
____________________________________________________________________________________________________
Original query:
SELECT Name FROM conductor ORDER BY Year_of_Work DESC
Generated query:


SELECT  name FROM conductors ORDER BY  years_worked DESC<eos>
____________________________________________________________________________________________________
Original query:
SELECT Name FROM conductor ORDER BY Year_of_Work DESC LIMIT 1
Generated query:


SELECT  t1.name FROM conductor AS t1 JOIN work AS t2 ON t1.id = t2.conductor_id GROUP BY t1.name ORDER BY COUNT(*) DESC LIMIT 1<eos>
____________________________________________________________________________________________________
Original query:
SELECT Name FROM conductor ORDER BY Year_of_Work DESC LIMIT 1
Generated query:


SELECT  t1.name FROM conductor AS t1 JOIN  (SELECT  MAX(years) AS max_years FROM conductor GROUP BY conductor_id) AS t2 ON t1.id = t2.max_years<eos>
____________________________________________________________________________________________________
Original query:
SELECT T1.Name ,  T2.Orchestra FROM conductor AS T1 JOIN orchestra AS T2 ON T1.Conductor_ID  =  T2.Conductor_ID
Generated query:
 <strong>SELECT</strong> conductor , orchestra <strong>FROM</strong> conductor , orchestra<eos>
____________________________________________________________________________________________________
Original query:
SELECT T1.Name ,  T2.Orchestra FROM conductor AS T1 JOIN orchestra AS T2 ON T1.Conductor_ID  =  T2.Conductor_ID
Generated query:


SELECT  conductor.name ,  orchestra.name  FROM conductor JOIN orchestra ON conductor.orchestra_id  =  orchestra.id<eos>
____________________________________________________________________________________________________
Original query:
SELECT T1.Name FROM conductor AS T1 JOIN orchestra AS T2 ON T1.Conductor_ID  =  T2.Conductor_ID GROUP BY T2.Conductor_ID HAVING COUNT(*)  >  1
Generated query:
 <strong>SELECT</strong>  name FROM conductor JOIN orchestra ON conductor.id = orchestra.conductor_id GROUP BY name HAVING COUNT(*) > 1<eos>
____________________________________________________________________________________________________
Original query:
SELECT T1.Name FROM conductor AS T1 JOIN orchestra AS T2 ON T1.Conductor_ID  =  T2.Conductor_ID GROUP BY T2.Conductor_ID HAVING COUNT(*)  >  1
Generated query:


SELECT  name FROM conductor WHERE  count(*) > 1<eos>
____________________________________________________________________________________________________
Original query:
SELECT T1.Name FROM conductor AS T1 JOIN orchestra AS T2 ON T1.Conductor_ID  =  T2.Conductor_ID GROUP BY T2.Conductor_ID ORDER BY COUNT(*) DESC LIMIT 1
Generated query:
 <strong>SELECT</strong>  name FROM conductor ORDER BY  number_of_orchestra DESC LIMIT 1<eos>
____________________________________________________________________________________________________
Original query:
SELECT T1.Name FROM conductor AS T1 JOIN orchestra AS T2 ON T1.Conductor_ID  =  T2.Conductor_ID GROUP BY T2.Conductor_ID ORDER BY COUNT(*) DESC LIMIT 1
Generated query:


SELECT  t1.name FROM conductor AS t1 JOIN orchestra AS t2 ON t1.id = t2.conductor_id GROUP BY t1.name ORDER BY COUNT(*) DESC LIMIT 1<eos>
____________________________________________________________________________________________________
Original query:
SELECT T1.Name FROM conductor AS T1 JOIN orchestra AS T2 ON T1.Conductor_ID  =  T2.Conductor_ID WHERE Year_of_Founded  >  2008
Generated query:
 <strong>SELECT conductor FROM conductor WHERE year_founded > 2008</strong><eos>
____________________________________________________________________________________________________
Original query:
SELECT T1.Name FROM conductor AS T1 JOIN orchestra AS T2 ON T1.Conductor_ID  =  T2.Conductor_ID WHERE Year_of_Founded  >  2008
Generated query:


SELECT name FROM conductor WHERE year_founded > 2008<eos>
____________________________________________________________________________________________________
Original query:
SELECT Record_Company ,  COUNT(*) FROM orchestra GROUP BY Record_Company
Generated query:


SELECT  record_company ,  count(*) FROM orchestra GROUP BY record_company<eos>
____________________________________________________________________________________________________
Original query:
SELECT Record_Company ,  COUNT(*) FROM orchestra GROUP BY Record_Company
Generated query:


SELECT COUNT(*) FROM orchestra WHERE company_name IN (SELECT company_name FROM record_company)<eos>
____________________________________________________________________________________________________
Original query:
SELECT Major_Record_Format FROM orchestra GROUP BY Major_Record_Format ORDER BY COUNT(*) ASC
Generated query:


SELECT  * FROM orchestra ORDER BY count<eos>
____________________________________________________________________________________________________
Original query:
SELECT Major_Record_Format FROM orchestra GROUP BY Major_Record_Format ORDER BY COUNT(*) ASC
Generated query:


SELECT  format_name FROM  record_format WHERE  format_name  IN  (SELECT  format_name FROM  record_format WHERE  format_name  IN  (SELECT  format_name FROM  record_format WHERE  format_name  IN  (SELECT  format_name FROM  record_format WHERE  format_name  IN  (SELECT  format_name FROM  record_format WHERE  format_name  IN  (SELECT  format_name FROM  record_format WHERE  format_name  IN  (SELECT  format_name FROM  record_format WHERE  format_name  IN  (SELECT  format_name FROM  record_format WHERE  format_name  IN  (SELECT  format_name FROM  record_format WHERE  format_name  IN  (SELECT  format_name FROM  record_format WHERE  format_name  IN  (SELECT  format_name FROM  record_format WHERE  format_name  IN  (SELECT  format_name FROM  record_format WHERE  format_name  IN  (SELECT  format_name FROM  record_format WHERE  format_name  IN  (SELECT  format_name FROM  record_format WHERE  format_name  IN  (SELECT  format_name FROM  record_format WHERE  format_name  IN  (SELECT  format_name FROM  record_format WHERE  format_name  IN  (SELECT  format_name FROM  record_format WHERE  format_name  IN  (SELECT  format_name FROM  record_format WHERE  format_name  IN  (SELECT  format_name FROM  record_format WHERE  format_name  IN  (SELECT  format_name FROM  record_format WHERE  format_name  IN  (SELECT  format_name FROM  record_format WHERE  format_name  IN  (SELECT  format_name FROM  record_format WHERE  format_name  IN  (SELECT  format_name FROM  record_format WHERE  format_name  IN  (SELECT  format_name FROM  record_format WHERE  format_name  IN  (SELECT  format_name FROM  record_format WHERE  format_name  IN  (SELECT  format_name FROM  record_format WHERE  format_name  IN  (SELECT  format_name FROM  record_format WHERE  format_name  IN  (SELECT  format_name FROM  record_format WHERE  format_name  IN  (SELECT  format_name FROM  record_format WHERE  format_name  IN  (SELECT  format_name FROM  record_format WHERE  format_name  IN  (SELECT  format_name FROM  record_format WHERE  format_name  IN  (SELECT  format_name FROM  record_format
____________________________________________________________________________________________________
Original query:
SELECT Record_Company FROM orchestra GROUP BY Record_Company ORDER BY COUNT(*) DESC LIMIT 1
Generated query:


SELECT  record_company  FROM  (SELECT  COUNT(*)  FROM  (SELECT  DISTINCT  record_company  FROM  orchestra)  GROUP  BY  record_company)  ORDER  BY  COUNT(*)  DESC<eos>
____________________________________________________________________________________________________
Original query:
SELECT Record_Company FROM orchestra GROUP BY Record_Company ORDER BY COUNT(*) DESC LIMIT 1
Generated query:


SELECT  record_company  FROM  (SELECT  count(*)  FROM  (SELECT  record_company  FROM  orchestra GROUP BY  record_company ORDER BY  count(*) DESC LIMIT  1) AS t1) AS t2<eos>
____________________________________________________________________________________________________
Original query:
SELECT Orchestra FROM orchestra WHERE Orchestra_ID NOT IN (SELECT Orchestra_ID FROM performance)
Generated query:
 <strong>SELECT DISTINCT orchestra_name FROM orchestra WHERE performance_count = 0</strong><eos>
____________________________________________________________________________________________________

,db_id,query,question,query_toks,query_toks_no_value,question_toks,modified question,generated_query
830,orchestra,SELECT avg(Attendance) FROM SHOW,What is the average attendance of shows?,"[SELECT, avg, (, Attendance, ), FROM, SHOW]","[select, avg, (, attendance, ), from, show]","[What, is, the, average, attendance, of, shows...","""Write a query that answers the following ques...",\n\nSELECT avg(attendance) FROM show
831,orchestra,SELECT avg(Attendance) FROM SHOW,Return the average attendance across all shows.,"[SELECT, avg, (, Attendance, ), FROM, SHOW]","[select, avg, (, attendance, ), from, show]","[Return, the, average, attendance, across, all...","""Write a query that answers the following ques...",<strong>SELECT</strong> avg(attendance) <st...
832,orchestra,"SELECT max(SHARE) , min(SHARE) FROM performan...",What are the maximum and minimum share of perf...,"[SELECT, max, (, SHARE, ), ,, min, (, SHARE, )...","[select, max, (, share, ), ,, min, (, share, )...","[What, are, the, maximum, and, minimum, share,...","""Write a query that answers the following ques...","\n\nSELECT MAX(type) , MIN(type) FROM perform..."
833,orchestra,"SELECT max(SHARE) , min(SHARE) FROM performan...",Return the maximum and minimum shares for perf...,"[SELECT, max, (, SHARE, ), ,, min, (, SHARE, )...","[select, max, (, share, ), ,, min, (, share, )...","[Return, the, maximum, and, minimum, shares, f...","""Write a query that answers the following ques...","\n\nSELECT MAX(share) , MIN(share) FROM perfo..."
834,orchestra,SELECT count(DISTINCT Nationality) FROM conductor,How many different nationalities do conductors...,"[SELECT, count, (, DISTINCT, Nationality, ), F...","[select, count, (, distinct, nationality, ), f...","[How, many, different, nationalities, do, cond...","""Write a query that answers the following ques...",\n\nSELECT DISTINCT nationality FROM conductor
835,orchestra,SELECT count(DISTINCT Nationality) FROM conductor,Count the number of different nationalities of...,"[SELECT, count, (, DISTINCT, Nationality, ), F...","[select, count, (, distinct, nationality, ), f...","[Count, the, number, of, different, nationalit...","""Write a query that answers the following ques...",\n\nSELECT COUNT(DISTINCT nationality) FROM c...
836,orchestra,SELECT Name FROM conductor ORDER BY Year_of_Wo...,List names of conductors in descending order o...,"[SELECT, Name, FROM, conductor, ORDER, BY, Yea...","[select, name, from, conductor, order, by, yea...","[List, names, of, conductors, in, descending, ...","""Write a query that answers the following ques...",\n\nSELECT name FROM conductor ORDER BY year...
837,orchestra,SELECT Name FROM conductor ORDER BY Year_of_Wo...,"What are the names of conductors, sorted desce...","[SELECT, Name, FROM, conductor, ORDER, BY, Yea...","[select, name, from, conductor, order, by, yea...","[What, are, the, names, of, conductors, ,, sor...","""Write a query that answers the following ques...",\n\nSELECT name FROM conductors ORDER BY ye...
838,orchestra,SELECT Name FROM conductor ORDER BY Year_of_Wo...,List the name of the conductor with the most y...,"[SELECT, Name, FROM, conductor, ORDER, BY, Yea...","[select, name, from, conductor, order, by, yea...","[List, the, name, of, the, conductor, with, th...","""Write a query that answers the following ques...",\n\nSELECT t1.name FROM conductor AS t1 JOIN...
839,orchestra,SELECT Name FROM conductor ORDER BY Year_of_Wo...,What is the name of the conductor who has work...,"[SELECT, Name, FROM, conductor, ORDER, BY, Yea...","[select, name, from, conductor, order, by, yea...","[What, is, the, name, of, the, conductor, who,...","""Write a query that answers the following ques...",\n\nSELECT t1.name FROM conductor AS t1 JOIN...
840,orchestra,"SELECT T1.Name , T2.Orchestra FROM conductor ...",Show the names of conductors and the orchestra...,"[SELECT, T1.Name, ,, T2.Orchestra, FROM, condu...","[select, t1, ., name, ,, t2, ., orchestra, fro...","[Show, the, names, of, conductors, and, the, o...","""Write a query that answers the following ques...","<strong>SELECT</strong> conductor , orchestra..."
841,orchestra,"SELECT T1.Name , T2.Orchestra FROM conductor ...",What are the names of conductors as well as th...,"[SELECT, T1.Name, ,, T2.Orchestra, FROM, condu...","[select, t1, ., name, ,, t2, ., orchestra, fro...","[What, are, the, names, of, conductors, as, we...","""Write a query that answers the following ques...","\n\nSELECT conductor.name , orchestra.name ..."
842,orchestra,SELECT T1.Name FROM conductor AS T1 JOIN orche...,Show the names of conductors that have conduct...,"[SELECT, T1.Name, FROM, conductor, AS, T1, JOI...","[select, t1, ., name, from, conductor, as, t1,...","[Show, the, names, of, conductors, that, have,...","""Write a query that answers the following ques...",<strong>SELECT</strong> name FROM conductor ...
843,orchestra,SELECT T1.Name FROM conductor AS T1 JOIN orche...,What are the names of conductors who have cond...,"[SELECT, T1.Name, FROM, conductor, AS, T1, JOI...","[select, t1, ., name, from, conductor, as, t1,...","[What, are, the, names, of, conductors, who, h...","""Write a query that answers the following ques...",\n\nSELECT name FROM conductor WHERE count(...
844,orchestra,SELECT T1.Name FROM conductor AS T1 JOIN orche...,Show the name of the conductor that has conduc...,"[SELECT, T1.Name, FROM, conductor, AS, T1, JOI...","[select, t1, ., name, from, conductor, as, t1,...","[Show, the, name, of, the, conductor, that, ha...","""Write a query that answers the following ques...",<strong>SELECT</strong> name FROM conductor ...
845,orchestra,SELECT T1.Name FROM conductor AS T1 JOIN orche...,What is the name of the conductor who has cond...,"[SELECT, T1.Name, FROM, conductor, AS, T1, JOI...","[select, t1, ., name, from, conductor, as, t1,...","[What, is, the, name, of, the, conductor, who,...","""Write a query that answers the following ques...",\n\nSELECT t1.name FROM conductor AS t1 JOIN...
846,orchestra,SELECT T1.Name FROM conductor AS T1 JOIN orche...,Please show the name of the conductor that has...,"[SELECT, T1.Name, FROM, conductor, AS, T1, JOI...","[select, t1, ., name, from, conductor, as, t1,...","[Please, show, the, name, of, the, conductor, ...","""Write a query that answers the following ques...",<strong>SELECT conductor FROM conductor WHERE...
847,orchestra,SELECT T1.Name FROM conductor AS T1 JOIN orche...,What are the names of conductors who have cond...,"[SELECT, T1.Name, FROM, conductor, AS, T1, JOI...","[select, t1, ., name, from, conductor, as, t1,...","[What, are, the, names, of, conductors, who, h...","""Write a query that answers the following ques...",\n\nSELECT name FROM conductor WHERE year_fou...
848,orchestra,"SELECT Record_Company , COUNT(*) FROM orchest...",Please show the different record companies and...,"[SELECT, Record_Company, ,, COUNT, (, *, ), FR...","[select, record_company, ,, count, (, *, ), fr...","[Please, show, the, different, record, compani...","""Write a query that answers the following ques...","\n\nSELECT record_company , count(*) FROM o..."
849,orchestra,"SELECT Record_Company , COUNT(*) FROM orchest...",How many orchestras does each record company m...,"[SELECT, Record_Company, ,, COUNT, (, *, ), FR...","[select, record_company, ,, count, (, *, ), fr...","[How, many, orchestras, does, each, record, co...","""Write a query that answers the following ques...",\n\nSELECT COUNT(*) FROM orchestra WHERE comp...
850,orchestra,SELECT Major_Record_Format FROM orchestra GROU...,Please show the record formats of orchestras i...,"[SELECT, Major_Record_Format, FROM, orchestra,...","[select, major_record_format, from, orchestra,...","[Please, show, the, record, formats, of, orche...","""Write a query that answers the following ques...",\n\nSELECT * FROM orchestra ORDER BY count
851,orchestra,SELECT Major_Record_Format FROM orchestra GROU...,What are the major record formats of orchestra...,"[SELECT, Major_Record_Format, FROM, orchestra,...","[select, major_record_format, from, orchestra,...","[What, are, the, major, record, formats, of, o...","""Write a query that answers the following ques...",\n\nSELECT format_name FROM record_format W...
852,orchestra,SELECT Record_Company FROM orchestra GROUP BY ...,List the record company shared by the most num...,"[SELECT, Record_Company, FROM, orchestra, GROU...","[select, record_company, from, orchestra, grou...","[List, the, record, company, shared, by, the, ...","""Write a query that answers the following ques...",\n\nSELECT record_company FROM (SELECT CO...
853,orchestra,SELECT Record_Company FROM orchestra GROUP BY ...,What is the record company used by the greates...,"[SELECT, Record_Company, FROM, orchestra, GROU...","[select, record_company, from, orchestra, grou...","[What, is, the, record, company, used, by, the...","""Write a query that answers the following ques...",\n\nSELECT record_company FROM (SELECT co...
854,orchestra,SELECT Orchestra FROM orchestra WHERE Orchestr...,List the names of orchestras that have no perf...,"[SELECT, Orchestra, FROM, orchestra, WHERE, Or...","[select, orchestra, from, orchestra, where, or...","[List, the, names, of, orchestras, that, have,...","""Write a query that answers the following ques...",<strong>SELECT DISTINCT orchestra_name FROM o...
855,orchestra,SELECT Orchestra FROM orchestra WHERE Orchestr...,What are the orchestras that do not have any p...,"[SELECT, Orchestra, FROM, orchestra, WHERE, Or...","[select, orchestra, from, orchestra, where, or...","[What, are, the, orchestras, that, do, not, ha...","""Write a query that answers the following ques...",\n\nSELECT DISTINCT orchestra FROM orchestra ...
856,orchestra,SELECT Record_Company FROM orchestra WHERE Yea...,Show the record companies shared by orchestras...,"[SELECT, Record_Company, FROM, orchestra, WHER...","[select, record_company, from, orchestra, wher...","[Show, the, record, companies, shared, by, orc...","""Write a query that answers the following ques...",\n\nSELECT record_company FROM orchestra WHE...
857,orchestra,SELECT Record_Company FROM orchestra WHERE Yea...,What are the record companies that are used by...,"[SELECT, Record_Company, FROM, orchestra, WHER...","[select, record_company, from, orchestra, wher...","[What, are, the, record, companies, that, are,...","""Write a query that answers the following ques...",\n\nSELECT record_company FROM (SELECT re...
858,orchestra,SELECT COUNT(*) FROM orchestra WHERE Major_Rec...,Find the number of orchestras whose record for...,"[SELECT, COUNT, (, *, ), FROM, orchestra, WHER...","[select, count, (, *, ), from, orchestra, wher...","[Find, the, number, of, orchestras, whose, rec...","""Write a query that answers the following ques...",<strong>SELECT COUNT(*) FROM orchestra WHERE ...
859,orchestra,SELECT COUNT(*) FROM orchestra WHERE Major_Rec...,Count the number of orchestras that have CD or...,"[SELECT, COUNT, (, *, ), FROM, orchestra, WHER...","[select, count, (, *, ), from, orchestra, wher...","[Count, the, number, of, orchestras, that, hav...","""Write a query that answers the following ques...",\n\nSELECT COUNT(*) FROM orchestra WHERE reco...
860,orchestra,SELECT Year_of_Founded FROM orchestra AS T1 JO...,Show the years in which orchestras that have g...,"[SELECT, Year_of_Founded, FROM, orchestra, AS,...","[select, year_of_founded, from, orchestra, as,...","[Show, the, years, in, which, orchestras, that...","""Write a query that answers the following ques...",<strong>SELECT DISTINCT year FROM orchestra W...
861,orchestra,SELECT Year_of_Founded FROM orchestra AS T1 JO...,What are years of founding for orchestras that...,"[SELECT, Year_of_Founded, FROM, orchestra, AS,...","[select, year_of_founded, from, orchestra, as,...","[What, are, years, of, founding, for, orchestr...","""Write a query that answers the following ques...",\n\nSELECT DISTINCT year_of_founding FROM or...
862,network_1,SELECT count(*) FROM Highschooler,How many high schoolers are there?,"[SELECT, count, (, *, ), FROM, Highschooler]","[select, count, (, *, ), from, highschooler]","[How, many, high, schoolers, are, there, ?]","""Write a query that answers the following ques...",\n\nSELECT COUNT(*) FROM student
863,network_1,SELECT count(*) FROM Highschooler,Count the number of high schoolers.,"[SELECT, count, (, *, ), FROM, Highschooler]","[select, count, (, *, ), from, highschooler]","[Count, the, number, of, high, schoolers, .]","""Write a query that answers the following ques...",\n\nSELECT COUNT(*) FROM student WHERE grade...
864,network_1,"SELECT name , grade FROM Highschooler",Show the names and grades of each high schooler.,"[SELECT, name, ,, grade, FROM, Highschooler]","[select, name, ,, grade, from, highschooler]","[Show, the, names, and, grades, of, each, high...","""Write a query that answers the following ques...","<strong>SELECT</strong> name , grade <stro..."
865,network_1,"SELECT name , grade FROM Highschooler",What are the names and grades for each high sc...,"[SELECT, name, ,, grade, FROM, Highschooler]","[select, name, ,, grade, from, highschooler]","[What, are, the, names, and, grades, for, each...","""Write a query that answers the following ques...","\n\nSELECT h.name , h.grade FROM high_sch..."
866,network_1,SELECT grade FROM Highschooler,Show all the grades of the high schoolers.,"[SELECT, grade, FROM, Highschooler]","[select, grade, from, highschooler]","[Show, all, the, grades, of, the, high, school...","""Write a query that answers the following ques...",<strong>SELECT * FROM student JOIN grade...
867,network_1,SELECT grade FROM Highschooler,What is the grade of each high schooler?,"[SELECT, grade, FROM, Highschooler]","[select, grade, from, highschooler]","[What, is, the, grade, of, each, high, schoole...","""Write a query that answers the following ques...",\n\nSELECT grade FROM high_schooler
868,network_1,SELECT grade FROM Highschooler WHERE name = ...,What grade is Kyle in?,"[SELECT, grade, FROM, Highschooler, WHERE, nam...","[select, grade, from, highschooler, where, nam...","[What, grade, is, Kyle, in, ?]","""Write a query that answers the following ques...",\n\nSELECT grade FROM students WHERE name = ...
869,network_1,SELECT grade FROM Highschooler WHERE name = ...,Return the grade for the high schooler named K...,"[SELECT, grade, FROM, Highschooler, WHERE, nam...","[select, grade, from, highschooler, where, nam...","[Return, the, grade, for, the, high, schooler,...","""Write a query that answers the following ques...",\n\nSELECT grade FROM student WHERE name ...
870,network_1,SELECT name FROM Highschooler WHERE grade = 10,Show the names of all high schoolers in grade 10.,"[SELECT, name, FROM, Highschooler, WHERE, grad...","[select, name, from, highschooler, where, grad...","[Show, the, names, of, all, high, schoolers, i...","""Write a query that answers the following ques...",<strong>SELECT</strong> name <strong>FROM</...
871,network_1,SELECT name FROM Highschooler WHERE grade = 10,What are the names of all high schoolers in gr...,"[SELECT, name, FROM, Highschooler, WHERE, grad...","[select, name, from, highschooler, where, grad...","[What, are, the, names, of, all, high, schoole...","""Write a query that answers the following ques...",\n\nSELECT name FROM student WHERE grade = 10
872,network_1,"SELECT ID FROM Highschooler WHERE name = ""Kyle""",Show the ID of the high schooler named Kyle.,"[SELECT, ID, FROM, Highschooler, WHERE, name, ...","[select, id, from, highschooler, where, name, ...","[Show, the, ID, of, the, high, schooler, named...","""Write a query that answers the following ques...",\n\nSELECT * FROM student WHERE name = '...
873,network_1,"SELECT ID FROM Highschooler WHERE name = ""Kyle""",What is Kyle's id?,"[SELECT, ID, FROM, Highschooler, WHERE, name, ...","[select, id, from, highschooler, where, name, ...","[What, is, Kyle, 's, id, ?]","""Write a query that answers the following ques...",\n\nSELECT id FROM employees WHERE name = 'Kyle'
874,network_1,SELECT count(*) FROM Highschooler WHERE grade ...,How many high schoolers are there in grade 9 o...,"[SELECT, count, (, *, ), FROM, Highschooler, W...","[select, count, (, *, ), from, highschooler, w...","[How, many, high, schoolers, are, there, in, g...","""Write a query that answers the following ques...",\n\nSELECT COUNT(*) FROM student WHERE grade ...
875,network_1,SELECT count(*) FROM Highschooler WHERE grade ...,Count the number of high schoolers in grades 9...,"[SELECT, count, (, *, ), FROM, Highschooler, W...","[select, count, (, *, ), from, highschooler, w...","[Count, the, number, of, high, schoolers, in, ...","""Write a query that answers the following ques...",\n\nSELECT COUNT(*) FROM student WHERE grade ...
876,network_1,"SELECT grade , count(*) FROM Highschooler GRO...",Show the number of high schoolers for each grade.,"[SELECT, grade, ,, count, (, *, ), FROM, Highs...","[select, grade, ,, count, (, *, ), from, highs...","[Show, the, number, of, high, schoolers, for, ...","""Write a query that answers the following ques...",\n\nSELECT COUNT(*) FROM student WHERE grade ...
877,network_1,"SELECT grade , count(*) FROM Highschooler GRO...",How many high schoolers are in each grade?,"[SELECT, grade, ,, count, (, *, ), FROM, Highs...","[select, grade, ,, count, (, *, ), from, highs...","[How, many, high, schoolers, are, in, each, gr...","""Write a query that answers the following ques...",\n\nSELECT COUNT(*) FROM student GROUP BY grade
878,network_1,SELECT grade FROM Highschooler GROUP BY grade ...,Which grade has the most high schoolers?,"[SELECT, grade, FROM, Highschooler, GROUP, BY,...","[select, grade, from, highschooler, group, by,...","[Which, grade, has, the, most, high, schoolers...","""Write a query that answers the following ques...",\n\nSELECT COUNT(*) FROM student GROUP BY grade
879,network_1,SELECT grade FROM Highschooler GROUP BY grade ...,Return the grade that has the greatest number ...,"[SELECT, grade, FROM, Highschooler, GROUP, BY,...","[select, grade, from, highschooler, group, by,...","[Return, the, grade, that, has, the, greatest,...","""Write a query that answers the following ques...","\n\nSELECT MAX(grade) FROM ""high_school"""
880,network_1,SELECT grade FROM Highschooler GROUP BY grade ...,Show me all grades that have at least 4 students.,"[SELECT, grade, FROM, Highschooler, GROUP, BY,...","[select, grade, from, highschooler, group, by,...","[Show, me, all, grades, that, have, at, least,...","""Write a query that answers the following ques...",<strong>SELECT</strong> * <strong>FROM</str...

====================================================================================================
(51, 7)
Input:  ['"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Which grades have 4 or more high schoolers? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Show the student IDs and numbers of friends corresponding to each. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> How many friends does each student have? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Show the names of high school students and their corresponding number of friends. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the names of the high schoolers and how many friends does each have? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the name of the high schooler who has the greatest number of friends? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Return the name of the high school student with the most friends. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Show the names of high schoolers who have at least 3 friends. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the names of high schoolers who have 3 or more friends? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Show the names of all of the high schooler Kyle\'s friends. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Return the names of friends of the high school student Kyle. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> How many friends does the high school student Kyle have? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Count the number of friends Kyle has. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Show ids of all students who do not have any friends. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the ids of high school students who do not have friends? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Show names of all high school students who do not have any friends. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the names of students who have no friends? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Show the ids of high schoolers who have friends and are also liked by someone else. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the ids of students who both have friends and are liked? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Show name of all students who have some friends and also are liked by someone else. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the names of high schoolers who both have friends and are liked? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Count the number of likes for each student id. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> How many likes correspond to each student id? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Show the names of high schoolers who have likes, and numbers of likes for each. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the names of high schoolers who have likes, and how many likes does each have? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the name of the high schooler who has the greatest number of likes? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Give the name of the student with the most likes. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Show the names of students who have at least 2 likes. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the names of students who have 2 or more likes? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Show the names of students who have a grade higher than 5 and have at least 2 friends. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the names of high schoolers who have a grade of over 5 and have 2 or more friends? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> How many likes does Kyle have? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Return the number of likes that the high schooler named Kyle has. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Find the average grade of all students who have some friends. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the average grade of students who have friends? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Find the minimum grade of students who have no friends. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the lowest grade of students who do not have any friends? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Which states have both owners and professionals living there? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Find the states where both owners and professionals live. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the average age of the dogs who have gone through any treatments? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Find the average age of the dogs who went through treatments. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Which professionals live in the state of Indiana or have done treatment on more than 2 treatments? List his or her id, last name and cell phone. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Find the id, last name and cell phone of the professionals who live in the state of Indiana or have performed more than two treatments. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Which dogs have not cost their owner more than 1000 for treatment ? List the dog names . <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the names of the dogs for which the owner has not spend more than 1000 for treatment ? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Which first names are used for professionals or owners but are not used as dog names? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Find the first names that are used for professionals or owners but are not used as dog names. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Which professional did not operate any treatment on dogs? List the professional\'s id, role and email. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Give me the id, role and email of the professionals who did not perform any treatment on dogs. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Which owner owns the most dogs? List the owner id, first name and last name. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Return the owner id, first name and last name of the owner who has the most dogs. <query> ']
Original query:
SELECT grade FROM Highschooler GROUP BY grade HAVING count(*)  >=  4
Generated query:


SELECT  * FROM  student_grade WHERE  grade_count >= 4<eos>
____________________________________________________________________________________________________
Original query:
SELECT student_id ,  count(*) FROM Friend GROUP BY student_id
Generated query:


SELECT  student_id ,  count(*) AS number_of_friends FROM  student GROUP BY student_id<eos>
____________________________________________________________________________________________________
Original query:
SELECT student_id ,  count(*) FROM Friend GROUP BY student_id
Generated query:


SELECT  count(*) FROM  student<eos>
____________________________________________________________________________________________________
Original query:
SELECT T2.name ,  count(*) FROM Friend AS T1 JOIN Highschooler AS T2 ON T1.student_id  =  T2.id GROUP BY T1.student_id
Generated query:
 <strong>SELECT</strong>  name ,  count(*)  <strong>FROM</strong>  student  <strong>JOIN</strong>  friend  <strong>ON</strong>  student.id  =  friend.student_id  <strong>GROUP BY</strong>  student.id<eos>
____________________________________________________________________________________________________
Original query:
SELECT T2.name ,  count(*) FROM Friend AS T1 JOIN Highschooler AS T2 ON T1.student_id  =  T2.id GROUP BY T1.student_id
Generated query:


SELECT  firstname ,  lastname ,  COUNT(*) AS  "number of friends" FROM  student GROUP BY  firstname ,  lastname<eos>
____________________________________________________________________________________________________
Original query:
SELECT T2.name FROM Friend AS T1 JOIN Highschooler AS T2 ON T1.student_id  =  T2.id GROUP BY T1.student_id ORDER BY count(*) DESC LIMIT 1
Generated query:


SELECT  name FROM  student  WHERE  count  =  (SELECT  count  FROM  student  WHERE  name  =  student.name)<eos>
____________________________________________________________________________________________________
Original query:
SELECT T2.name FROM Friend AS T1 JOIN Highschooler AS T2 ON T1.student_id  =  T2.id GROUP BY T1.student_id ORDER BY count(*) DESC LIMIT 1
Generated query:


SELECT  name FROM student GROUP BY name ORDER BY count(*) DESC LIMIT 1<eos>
____________________________________________________________________________________________________
Original query:
SELECT T2.name FROM Friend AS T1 JOIN Highschooler AS T2 ON T1.student_id  =  T2.id GROUP BY T1.student_id HAVING count(*)  >=  3
Generated query:
 <strong>SELECT</strong>  name  <strong>FROM</strong>  student  <strong>WHERE</strong>  count(name) >= 3<eos>
____________________________________________________________________________________________________
Original query:
SELECT T2.name FROM Friend AS T1 JOIN Highschooler AS T2 ON T1.student_id  =  T2.id GROUP BY T1.student_id HAVING count(*)  >=  3
Generated query:


SELECT  name FROM  student WHERE  count(name) >= 3<eos>
____________________________________________________________________________________________________
Original query:
SELECT T3.name FROM Friend AS T1 JOIN Highschooler AS T2 ON T1.student_id  =  T2.id JOIN Highschooler AS T3 ON T1.friend_id  =  T3.id WHERE T2.name  =  "Kyle"
Generated query:
 <strong>SELECT</strong>  name  <strong>FROM</strong>  friends  <strong>WHERE</strong>  friends_id  =  '1'<eos>
____________________________________________________________________________________________________
Original query:
SELECT T3.name FROM Friend AS T1 JOIN Highschooler AS T2 ON T1.student_id  =  T2.id JOIN Highschooler AS T3 ON T1.friend_id  =  T3.id WHERE T2.name  =  "Kyle"
Generated query:


SELECT  name FROM  friends WHERE  student_id  =  '123456789'<eos>
____________________________________________________________________________________________________
Original query:
SELECT count(*) FROM Friend AS T1 JOIN Highschooler AS T2 ON T1.student_id  =  T2.id WHERE T2.name  =  "Kyle"
Generated query:


SELECT COUNT(*) FROM student WHERE name = 'Kyle'<eos>
____________________________________________________________________________________________________
Original query:
SELECT count(*) FROM Friend AS T1 JOIN Highschooler AS T2 ON T1.student_id  =  T2.id WHERE T2.name  =  "Kyle"
Generated query:


SELECT COUNT(*) FROM friends WHERE friend_id = 1<eos>
____________________________________________________________________________________________________
Original query:
SELECT id FROM Highschooler EXCEPT SELECT student_id FROM Friend
Generated query:
 <strong>SELECT DISTINCT student_id FROM student WHERE NOT EXISTS ( SELECT student_id FROM friend WHERE friend_id = student_id )</strong><eos>
____________________________________________________________________________________________________
Original query:
SELECT id FROM Highschooler EXCEPT SELECT student_id FROM Friend
Generated query:


SELECT  student_id FROM  student WHERE  student_id NOT IN  (SELECT  student_id FROM  friend WHERE  student_id  =  student_id)<eos>
____________________________________________________________________________________________________
Original query:
SELECT name FROM Highschooler EXCEPT SELECT T2.name FROM Friend AS T1 JOIN Highschooler AS T2 ON T1.student_id  =  T2.id
Generated query:
 <strong>SELECT</strong>  name  <strong>FROM</strong>  student  <strong>WHERE</strong>  NOT EXISTS  (  SELECT  *  FROM  friend  WHERE  student_id  =  friend_student_id  )<eos>
____________________________________________________________________________________________________
Original query:
SELECT name FROM Highschooler EXCEPT SELECT T2.name FROM Friend AS T1 JOIN Highschooler AS T2 ON T1.student_id  =  T2.id
Generated query:


SELECT  name FROM student WHERE  NOT EXISTS  (SELECT  * FROM  friend WHERE  student_id  =  student.id)<eos>
____________________________________________________________________________________________________
Original query:
SELECT student_id FROM Friend INTERSECT SELECT liked_id FROM Likes
Generated query:
 <strong>SELECT</strong>  <em>  </em>  <strong>FROM</strong>  <em>  </em>  <strong>WHERE</strong>  <em>  </em><eos>
____________________________________________________________________________________________________
Original query:
SELECT student_id FROM Friend INTERSECT SELECT liked_id FROM Likes
Generated query:


SELECT  student_id FROM  student WHERE  student_id IN  (SELECT  student_id FROM  friend WHERE  student_id IN  (SELECT  student_id FROM  student WHERE  student_id IN  (SELECT  student_id FROM  friend WHERE  student_id IN  (SELECT  student_id FROM  student WHERE  student_id IN  (SELECT  student_id FROM  friend WHERE  student_id IN  (SELECT  student_id FROM  student WHERE  student_id IN  (SELECT  student_id FROM  friend WHERE  student_id IN  (SELECT  student_id FROM  student WHERE  student_id IN  (SELECT  student_id FROM  friend WHERE  student_id IN  (SELECT  student_id FROM  student WHERE  student_id IN  (SELECT  student_id FROM  friend WHERE  student_id IN  (SELECT  student_id FROM  student WHERE  student_id IN  (SELECT  student_id FROM  friend WHERE  student_id IN  (SELECT  student_id FROM  student WHERE  student_id IN  (SELECT  student_id FROM  friend WHERE  student_id IN  (SELECT  student_id FROM  student WHERE  student_id IN  (SELECT  student_id FROM  friend WHERE  student_id IN  (SELECT  student_id FROM  student WHERE  student_id IN  (SELECT  student_id FROM  friend WHERE  student_id IN  (SELECT  student_id FROM  student WHERE  student_id IN  (SELECT  student_id FROM  friend WHERE  student_id IN  (SELECT  student_id FROM  student WHERE  student_id IN  (SELECT  student_id FROM  friend WHERE  student_id IN  (SELECT  student_id FROM  student WHERE  student_id IN  (SELECT  student_id FROM  friend WHERE  student_id IN  (SELECT  student_id FROM  student WHERE  student_id IN  (SELECT  student_id FROM  friend WHERE  student_id IN  (SELECT  student_id FROM  student WHERE  student_id IN  (SELECT  student_id FROM  friend WHERE  student_id IN  (SELECT  student_id FROM  student WHERE  student_id IN  (SELECT  student_id FROM  friend WHERE  student_id IN  (SELECT  student_id FROM  student WHERE  student_id IN  (SELECT  student_id FROM  friend WHERE  student_id IN  (SELECT  student_id FROM  student WHERE  student_id IN  (SELECT  student_id FROM  friend WHERE  student_id IN  (SELECT  student_id FROM  student WHERE  student_id IN  (SELECT  student_id FROM
____________________________________________________________________________________________________
Original query:
SELECT T2.name FROM Friend AS T1 JOIN Highschooler AS T2 ON T1.student_id  =  T2.id INTERSECT SELECT T2.name FROM Likes AS T1 JOIN Highschooler AS T2 ON T1.liked_id  =  T2.id
Generated query:
 <strong>SELECT name FROM student WHERE EXISTS ( SELECT name FROM friend WHERE name = student.name AND name IN ( SELECT name FROM friend WHERE name = student.name ) ) AND EXISTS ( SELECT name FROM friend WHERE name = student.name AND name IN ( SELECT name FROM friend WHERE name = student.name ) )</strong><eos>
____________________________________________________________________________________________________
Original query:
SELECT T2.name FROM Friend AS T1 JOIN Highschooler AS T2 ON T1.student_id  =  T2.id INTERSECT SELECT T2.name FROM Likes AS T1 JOIN Highschooler AS T2 ON T1.liked_id  =  T2.id
Generated query:


SELECT  name FROM  student WHERE  (  SELECT  count(*) FROM  friend WHERE  student_id  =  student_id  )  >  0  AND  (  SELECT  count(*) FROM  like WHERE  student_id  =  student_id  )  >  0<eos>

,db_id,query,question,query_toks,query_toks_no_value,question_toks,modified question,generated_query
881,network_1,SELECT grade FROM Highschooler GROUP BY grade ...,Which grades have 4 or more high schoolers?,"[SELECT, grade, FROM, Highschooler, GROUP, BY,...","[select, grade, from, highschooler, group, by,...","[Which, grades, have, 4, or, more, high, schoo...","""Write a query that answers the following ques...",\n\nSELECT * FROM student_grade WHERE grad...
882,network_1,"SELECT student_id , count(*) FROM Friend GROU...",Show the student IDs and numbers of friends co...,"[SELECT, student_id, ,, count, (, *, ), FROM, ...","[select, student_id, ,, count, (, *, ), from, ...","[Show, the, student, IDs, and, numbers, of, fr...","""Write a query that answers the following ques...","\n\nSELECT student_id , count(*) AS number_..."
883,network_1,"SELECT student_id , count(*) FROM Friend GROU...",How many friends does each student have?,"[SELECT, student_id, ,, count, (, *, ), FROM, ...","[select, student_id, ,, count, (, *, ), from, ...","[How, many, friends, does, each, student, have...","""Write a query that answers the following ques...",\n\nSELECT count(*) FROM student
884,network_1,"SELECT T2.name , count(*) FROM Friend AS T1 J...",Show the names of high school students and the...,"[SELECT, T2.name, ,, count, (, *, ), FROM, Fri...","[select, t2, ., name, ,, count, (, *, ), from,...","[Show, the, names, of, high, school, students,...","""Write a query that answers the following ques...","<strong>SELECT</strong> name , count(*) <s..."
885,network_1,"SELECT T2.name , count(*) FROM Friend AS T1 J...",What are the names of the high schoolers and h...,"[SELECT, T2.name, ,, count, (, *, ), FROM, Fri...","[select, t2, ., name, ,, count, (, *, ), from,...","[What, are, the, names, of, the, high, schoole...","""Write a query that answers the following ques...","\n\nSELECT firstname , lastname , COUNT(*)..."
886,network_1,SELECT T2.name FROM Friend AS T1 JOIN Highscho...,What is the name of the high schooler who has ...,"[SELECT, T2.name, FROM, Friend, AS, T1, JOIN, ...","[select, t2, ., name, from, friend, as, t1, jo...","[What, is, the, name, of, the, high, schooler,...","""Write a query that answers the following ques...",\n\nSELECT name FROM student WHERE count ...
887,network_1,SELECT T2.name FROM Friend AS T1 JOIN Highscho...,Return the name of the high school student wit...,"[SELECT, T2.name, FROM, Friend, AS, T1, JOIN, ...","[select, t2, ., name, from, friend, as, t1, jo...","[Return, the, name, of, the, high, school, stu...","""Write a query that answers the following ques...",\n\nSELECT name FROM student GROUP BY name O...
888,network_1,SELECT T2.name FROM Friend AS T1 JOIN Highscho...,Show the names of high schoolers who have at l...,"[SELECT, T2.name, FROM, Friend, AS, T1, JOIN, ...","[select, t2, ., name, from, friend, as, t1, jo...","[Show, the, names, of, high, schoolers, who, h...","""Write a query that answers the following ques...",<strong>SELECT</strong> name <strong>FROM</...
889,network_1,SELECT T2.name FROM Friend AS T1 JOIN Highscho...,What are the names of high schoolers who have ...,"[SELECT, T2.name, FROM, Friend, AS, T1, JOIN, ...","[select, t2, ., name, from, friend, as, t1, jo...","[What, are, the, names, of, high, schoolers, w...","""Write a query that answers the following ques...",\n\nSELECT name FROM student WHERE count(n...
890,network_1,SELECT T3.name FROM Friend AS T1 JOIN Highscho...,Show the names of all of the high schooler Kyl...,"[SELECT, T3.name, FROM, Friend, AS, T1, JOIN, ...","[select, t3, ., name, from, friend, as, t1, jo...","[Show, the, names, of, all, of, the, high, sch...","""Write a query that answers the following ques...",<strong>SELECT</strong> name <strong>FROM</...
891,network_1,SELECT T3.name FROM Friend AS T1 JOIN Highscho...,Return the names of friends of the high school...,"[SELECT, T3.name, FROM, Friend, AS, T1, JOIN, ...","[select, t3, ., name, from, friend, as, t1, jo...","[Return, the, names, of, friends, of, the, hig...","""Write a query that answers the following ques...",\n\nSELECT name FROM friends WHERE student...
892,network_1,SELECT count(*) FROM Friend AS T1 JOIN Highsch...,How many friends does the high school student ...,"[SELECT, count, (, *, ), FROM, Friend, AS, T1,...","[select, count, (, *, ), from, friend, as, t1,...","[How, many, friends, does, the, high, school, ...","""Write a query that answers the following ques...",\n\nSELECT COUNT(*) FROM student WHERE name =...
893,network_1,SELECT count(*) FROM Friend AS T1 JOIN Highsch...,Count the number of friends Kyle has.,"[SELECT, count, (, *, ), FROM, Friend, AS, T1,...","[select, count, (, *, ), from, friend, as, t1,...","[Count, the, number, of, friends, Kyle, has, .]","""Write a query that answers the following ques...",\n\nSELECT COUNT(*) FROM friends WHERE friend...
894,network_1,SELECT id FROM Highschooler EXCEPT SELECT stud...,Show ids of all students who do not have any f...,"[SELECT, id, FROM, Highschooler, EXCEPT, SELEC...","[select, id, from, highschooler, except, selec...","[Show, ids, of, all, students, who, do, not, h...","""Write a query that answers the following ques...",<strong>SELECT DISTINCT student_id FROM stude...
895,network_1,SELECT id FROM Highschooler EXCEPT SELECT stud...,What are the ids of high school students who d...,"[SELECT, id, FROM, Highschooler, EXCEPT, SELEC...","[select, id, from, highschooler, except, selec...","[What, are, the, ids, of, high, school, studen...","""Write a query that answers the following ques...",\n\nSELECT student_id FROM student WHERE s...
896,network_1,SELECT name FROM Highschooler EXCEPT SELECT T2...,Show names of all high school students who do ...,"[SELECT, name, FROM, Highschooler, EXCEPT, SEL...","[select, name, from, highschooler, except, sel...","[Show, names, of, all, high, school, students,...","""Write a query that answers the following ques...",<strong>SELECT</strong> name <strong>FROM</...
897,network_1,SELECT name FROM Highschooler EXCEPT SELECT T2...,What are the names of students who have no fri...,"[SELECT, name, FROM, Highschooler, EXCEPT, SEL...","[select, name, from, highschooler, except, sel...","[What, are, the, names, of, students, who, hav...","""Write a query that answers the following ques...",\n\nSELECT name FROM student WHERE NOT EXIS...
898,network_1,SELECT student_id FROM Friend INTERSECT SELECT...,Show the ids of high schoolers who have friend...,"[SELECT, student_id, FROM, Friend, INTERSECT, ...","[select, student_id, from, friend, intersect, ...","[Show, the, ids, of, high, schoolers, who, hav...","""Write a query that answers the following ques...",<strong>SELECT</strong> <em> </em> <strong...
899,network_1,SELECT student_id FROM Friend INTERSECT SELECT...,What are the ids of students who both have fri...,"[SELECT, student_id, FROM, Friend, INTERSECT, ...","[select, student_id, from, friend, intersect, ...","[What, are, the, ids, of, students, who, both,...","""Write a query that answers the following ques...",\n\nSELECT student_id FROM student WHERE s...
900,network_1,SELECT T2.name FROM Friend AS T1 JOIN Highscho...,Show name of all students who have some friend...,"[SELECT, T2.name, FROM, Friend, AS, T1, JOIN, ...","[select, t2, ., name, from, friend, as, t1, jo...","[Show, name, of, all, students, who, have, som...","""Write a query that answers the following ques...",<strong>SELECT name FROM student WHERE EXISTS...
901,network_1,SELECT T2.name FROM Friend AS T1 JOIN Highscho...,What are the names of high schoolers who both ...,"[SELECT, T2.name, FROM, Friend, AS, T1, JOIN, ...","[select, t2, ., name, from, friend, as, t1, jo...","[What, are, the, names, of, high, schoolers, w...","""Write a query that answers the following ques...",\n\nSELECT name FROM student WHERE ( SELE...
902,network_1,"SELECT student_id , count(*) FROM Likes GROUP...",Count the number of likes for each student id.,"[SELECT, student_id, ,, count, (, *, ), FROM, ...","[select, student_id, ,, count, (, *, ), from, ...","[Count, the, number, of, likes, for, each, stu...","""Write a query that answers the following ques...",\n\nSELECT count(*) FROM likes WHERE stude...
903,network_1,"SELECT student_id , count(*) FROM Likes GROUP...",How many likes correspond to each student id?,"[SELECT, student_id, ,, count, (, *, ), FROM, ...","[select, student_id, ,, count, (, *, ), from, ...","[How, many, likes, correspond, to, each, stude...","""Write a query that answers the following ques...","\n\nSELECT count(*) , student_id FROM lik..."
904,network_1,"SELECT T2.name , count(*) FROM Likes AS T1 JO...",Show the names of high schoolers who have like...,"[SELECT, T2.name, ,, count, (, *, ), FROM, Lik...","[select, t2, ., name, ,, count, (, *, ), from,...","[Show, the, names, of, high, schoolers, who, h...","""Write a query that answers the following ques...","\n\nSELECT name , count(*) FROM likes GR..."
905,network_1,"SELECT T2.name , count(*) FROM Likes AS T1 JO...",What are the names of high schoolers who have ...,"[SELECT, T2.name, ,, count, (, *, ), FROM, Lik...","[select, t2, ., name, ,, count, (, *, ), from,...","[What, are, the, names, of, high, schoolers, w...","""Write a query that answers the following ques...","\n\nSELECT name , count(*) FROM likes GR..."
906,network_1,SELECT T2.name FROM Likes AS T1 JOIN Highschoo...,What is the name of the high schooler who has ...,"[SELECT, T2.name, FROM, Likes, AS, T1, JOIN, H...","[select, t2, ., name, from, likes, as, t1, joi...","[What, is, the, name, of, the, high, schooler,...","""Write a query that answers the following ques...",\n\nSELECT name FROM likes WHERE likes.li...
907,network_1,SELECT T2.name FROM Likes AS T1 JOIN Highschoo...,Give the name of the student with the most likes.,"[SELECT, T2.name, FROM, Likes, AS, T1, JOIN, H...","[select, t2, ., name, from, likes, as, t1, joi...","[Give, the, name, of, the, student, with, the,...","""Write a query that answers the following ques...",\n\nSELECT student_name FROM student ORDER...
908,network_1,SELECT T2.name FROM Likes AS T1 JOIN Highschoo...,Show the names of students who have at least 2...,"[SELECT, T2.name, FROM, Likes, AS, T1, JOIN, H...","[select, t2, ., name, from, likes, as, t1, joi...","[Show, the, names, of, students, who, have, at...","""Write a query that answers the following ques...",<strong>SELECT name FROM student WHERE likes ...
909,network_1,SELECT T2.name FROM Likes AS T1 JOIN Highschoo...,What are the names of students who have 2 or m...,"[SELECT, T2.name, FROM, Likes, AS, T1, JOIN, H...","[select, t2, ., name, from, likes, as, t1, joi...","[What, are, the, names, of, students, who, hav...","""Write a query that answers the following ques...",\n\nSELECT name FROM student WHERE likes >= 2
910,network_1,SELECT T2.name FROM Friend AS T1 JOIN Highscho...,Show the names of students who have a grade hi...,"[SELECT, T2.name, FROM, Friend, AS, T1, JOIN, ...","[select, t2, ., name, from, friend, as, t1, jo...","[Show, the, names, of, students, who, have, a,...","""Write a query that answers the following ques...",<strong>SELECT name FROM student WHERE grade ...
911,network_1,SELECT T2.name FROM Friend AS T1 JOIN Highscho...,What are the names of high schoolers who have ...,"[SELECT, T2.name, FROM, Friend, AS, T1, JOIN, ...","[select, t2, ., name, from, friend, as, t1, jo...","[What, are, the, names, of, high, schoolers, w...","""Write a query that answers the following ques...",\n\nSELECT name FROM student WHERE grade >...
912,network_1,SELECT count(*) FROM Likes AS T1 JOIN Highscho...,How many likes does Kyle have?,"[SELECT, count, (, *, ), FROM, Likes, AS, T1, ...","[select, count, (, *, ), from, likes, as, t1, ...","[How, many, likes, does, Kyle, have, ?]","""Write a query that answers the following ques...",\n\nSELECT COUNT(*) FROM likes WHERE user_id = 1
913,network_1,SELECT count(*) FROM Likes AS T1 JOIN Highscho...,Return the number of likes that the high schoo...,"[SELECT, count, (, *, ), FROM, Likes, AS, T1, ...","[select, count, (, *, ), from, likes, as, t1, ...","[Return, the, number, of, likes, that, the, hi...","""Write a query that answers the following ques...",\n\nSELECT COUNT(*) FROM likes WHERE user_nam...
914,network_1,SELECT avg(grade) FROM Highschooler WHERE id I...,Find the average grade of all students who hav...,"[SELECT, avg, (, grade, ), FROM, Highschooler,...","[select, avg, (, grade, ), from, highschooler,...","[Find, the, average, grade, of, all, students,...","""Write a query that answers the following ques...",<strong>SELECT AVG(grade) FROM student JOIN f...
915,network_1,SELECT avg(grade) FROM Highschooler WHERE id I...,What is the average grade of students who have...,"[SELECT, avg, (, grade, ), FROM, Highschooler,...","[select, avg, (, grade, ), from, highschooler,...","[What, is, the, average, grade, of, students, ...","""Write a query that answers the following ques...",\n\nSELECT AVG(grade) FROM student JOIN frien...
916,network_1,SELECT min(grade) FROM Highschooler WHERE id N...,Find the minimum grade of students who have no...,"[SELECT, min, (, grade, ), FROM, Highschooler,...","[select, min, (, grade, ), from, highschooler,...","[Find, the, minimum, grade, of, students, who,...","""Write a query that answers the following ques...",<strong>SELECT MIN(grade) FROM student WHERE ...
917,network_1,SELECT min(grade) FROM Highschooler WHERE id N...,What is the lowest grade of students who do no...,"[SELECT, min, (, grade, ), FROM, Highschooler,...","[select, min, (, grade, ), from, highschooler,...","[What, is, the, lowest, grade, of, students, w...","""Write a query that answers the following ques...",\n\nSELECT MIN(grade) FROM student WHERE frie...
918,dog_kennels,SELECT state FROM Owners INTERSECT SELECT stat...,Which states have both owners and professional...,"[SELECT, state, FROM, Owners, INTERSECT, SELEC...","[select, state, from, owners, intersect, selec...","[Which, states, have, both, owners, and, profe...","""Write a query that answers the following ques...","\n\nSELECT state_name , owner_count , prof..."
919,dog_kennels,SELECT state FROM Owners INTERSECT SELECT stat...,Find the states where both owners and professi...,"[SELECT, state, FROM, Owners, INTERSECT, SELEC...","[select, state, from, owners, intersect, selec...","[Find, the, states, where, both, owners, and, ...","""Write a query that answers the following ques...","\n\nSELECT * FROM ""owner"" JOIN ""owner_stat..."
920,dog_kennels,SELECT avg(age) FROM Dogs WHERE dog_id IN ( SE...,What is the average age of the dogs who have g...,"[SELECT, avg, (, age, ), FROM, Dogs, WHERE, do...","[select, avg, (, age, ), from, dogs, where, do...","[What, is, the, average, age, of, the, dogs, w...","""Write a query that answers the following ques...",\n\nSELECT AVG(age) FROM Treatment WHERE trea...
921,dog_kennels,SELECT avg(age) FROM Dogs WHERE dog_id IN ( SE...,Find the average age of the dogs who went thro...,"[SELECT, avg, (, age, ), FROM, Dogs, WHERE, do...","[select, avg, (, age, ), from, dogs, where, do...","[Find, the, average, age, of, the, dogs, who, ...","""Write a query that answers the following ques...",\n\nSELECT AVG(age) FROM treatment WHERE trea...
922,dog_kennels,"SELECT professional_id , last_name , cell_nu...",Which professionals live in the state of India...,"[SELECT, professional_id, ,, last_name, ,, cel...","[select, professional_id, ,, last_name, ,, cel...","[Which, professionals, live, in, the, state, o...","""Write a query that answers the following ques...","\n\nSELECT prof_id , last_name , cell_phone ..."
923,dog_kennels,"SELECT professional_id , last_name , cell_nu...","Find the id, last name and cell phone of the p...","[SELECT, professional_id, ,, last_name, ,, cel...","[select, professional_id, ,, last_name, ,, cel...","[Find, the, id, ,, last, name, and, cell, phon...","""Write a query that answers the following ques...","\n\nSELECT prof_id , last_name , cell_phone ..."
924,dog_kennels,select name from dogs where dog_id not in ( se...,Which dogs have not cost their owner more than...,"[select, name, from, dogs, where, dog_id, not,...","[select, name, from, dogs, where, dog_id, not,...","[Which, dogs, have, not, cost, their, owner, m...","""Write a query that answers the following ques...",\n\nSELECT dog_name FROM dogs WHERE cost_tre...
925,dog_kennels,select name from dogs where dog_id not in ( se...,What are the names of the dogs for which the o...,"[select, name, from, dogs, where, dog_id, not,...","[select, name, from, dogs, where, dog_id, not,...","[What, are, the, names, of, the, dogs, for, wh...","""Write a query that answers the following ques...",\n\nSELECT owner_name FROM dog WHERE owne...
926,dog_kennels,SELECT first_name FROM Professionals UNION SEL...,Which first names are used for professionals o...,"[SELECT, first_name, FROM, Professionals, UNIO...","[select, first_name, from, professionals, unio...","[Which, first, names, are, used, for, professi...","""Write a query that answers the following ques...",\n\nSELECT first_name FROM professionals WHER...
927,dog_kennels,SELECT first_name FROM Professionals UNION SEL...,Find the first names that are used for profess...,"[SELECT, first_name, FROM, Professionals, UNIO...","[select, first_name, from, professionals, unio...","[Find, the, first, names, that, are, used, for...","""Write a query that answers the following ques...",\n\nSELECT first_name FROM professionals WHE...
928,dog_kennels,"SELECT professional_id , role_code , email_a...",Which professional did not operate any treatme...,"[SELECT, professional_id, ,, role_code, ,, ema...","[select, professional_id, ,, role_code, ,, ema...","[Which, professional, did, not, operate, any, ...","""Write a query that answers the following ques...","\n\nSELECT prof_id , role , email FROM profe..."
929,dog_kennels,"SELECT professional_id , role_code , email_a...","Give me the id, role and email of the professi...","[SELECT, professional_id, ,, role_code, ,, ema...","[select, professional_id, ,, role_code, ,, ema...","[Give, me, the, id, ,, role, and, email, of, t...","""Write a query that answers the following ques...","\n\nSELECT t1.id , t1.role , t1.email FROM p..."
930,dog_kennels,"SELECT T1.owner_id , T2.first_name , T2.last...",Which owner owns the most dogs? List the owner...,"[SELECT, T1.owner_id, ,, T2.first_name, ,, T2....","[select, t1, ., owner_id, ,, t2, ., first_name...","[Which, owner, owns, the, most, dogs, ?, List,...","""Write a query that answers the following ques...","\n\nSELECT owner_id , first_name , last_name..."
931,dog_kennels,"SELECT T1.owner_id , T2.first_name , T2.last...","Return the owner id, first name and last name ...","[SELECT, T1.owner_id, ,, T2.first_name, ,, T2....","[select, t1, ., owner_id, ,, t2, ., first_name...","[Return, the, owner, id, ,, first, name, and, ...","""Write a query that answers the following ques...","\n\nSELECT owner_id , first_name , last_na..."

====================================================================================================
(51, 7)
Input:  ['"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Which professionals have done at least two treatments? List the professional\'s id, role, and first name. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the id, role, and first name of the professionals who have performed two or more treatments? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the name of the breed with the most dogs? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Which breed do the most dogs have? Give me the breed name. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Which owner has paid for the most treatments on his or her dogs? List the owner id and last name. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Tell me the owner id and last name of the owner who spent the most on treatments of his or her dogs. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the description of the treatment type that costs the least money in total? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Give me the description of the treatment type whose total cost is the lowest. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Which owner has paid the largest amount of money in total for their dogs? Show the owner id and zip code. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Find the owner id and zip code of the owner who spent the most money in total for his or her dogs. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Which professionals have done at least two types of treatments? List the professional id and cell phone. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Find the id and cell phone of the professionals who operate two or more types of treatments. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the first name and last name of the professionals who have done treatment with cost below average? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Which professionals have operated a treatment that costs less than the average? Give me theor first names and last names. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> List the date of each treatment, together with the first name of the professional who operated it. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the date and the operating professional\'s first name of each treatment? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> List the cost of each treatment and the corresponding treatment type description. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the cost and treatment type description of each treatment? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> List each owner\'s first name, last name, and the size of his for her dog. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are each owner\'s first name, last name, and the size of their dog? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> List pairs of the owner\'s first name and the dogs\'s name. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are each owner\'s first name and their dogs\'s name? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> List the names of the dogs of the rarest breed and the treatment dates of them. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Which dogs are of the rarest breed? Show their names and treatment dates. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Which dogs are owned by someone who lives in Virginia? List the owner\'s first name and the dog\'s name. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Find the first names of owners living in Virginia and the names of dogs they own. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the arriving date and the departing date of the dogs who have gone through a treatment? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Find the arriving date and the departing date of the dogs that received a treatment. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> List the last name of the owner owning the youngest dog. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Who owns the youngest dog? Give me his or her last name. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> List the emails of the professionals who live in the state of Hawaii or the state of Wisconsin. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the emails of the professionals living in either the state of Hawaii or the state of Wisconsin? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the arriving date and the departing date of all the dogs? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> List the arrival date and the departure date for all the dogs. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> How many dogs went through any treatments? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Count the number of dogs that went through a treatment. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> How many professionals have performed any treatment to dogs? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Find the number of professionals who have ever treated dogs. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Which professionals live in a city containing the substring \'West\'? List his or her role, street, city and state. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Find the role, street, city and state of the professionals living in a city that contains the substring \'West\'. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Which owners live in the state whose name contains the substring \'North\'? List his first name, last name and email. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Return the first name, last name and email of the owners living in a state whose name contains the substring \'North\'. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> How many dogs have an age below the average? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Count the number of dogs of an age below the average. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> How much does the most recent treatment cost? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Show me the cost of the most recently performed treatment. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> How many dogs have not gone through any treatment? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Tell me the number of dogs that have not received any treatment . <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> How many owners temporarily do not have any dogs? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Find the number of owners who do not own any dogs at this moment. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> How many professionals did not operate any treatment on dogs? <query> ']
Original query:
SELECT T1.professional_id ,  T1.role_code ,  T1.first_name FROM Professionals AS T1 JOIN Treatments AS T2 ON T1.professional_id  =  T2.professional_id GROUP BY T1.professional_id HAVING count(*)  >=  2
Generated query:


SELECT  prof_id , role , first_name FROM professionals WHERE  count(treatment_id) >= 2<eos>
____________________________________________________________________________________________________
Original query:
SELECT T1.professional_id ,  T1.role_code ,  T1.first_name FROM Professionals AS T1 JOIN Treatments AS T2 ON T1.professional_id  =  T2.professional_id GROUP BY T1.professional_id HAVING count(*)  >=  2
Generated query:


SELECT  t1.id , t1.role , t1.first_name FROM professionals AS t1 JOIN treatments AS t2 ON t1.id = t2.professional_id GROUP BY t1.id , t1.role , t1.first_name HAVING COUNT(*) >= 2<eos>
____________________________________________________________________________________________________
Original query:
SELECT T1.breed_name FROM Breeds AS T1 JOIN Dogs AS T2 ON T1.breed_code  =  T2.breed_code GROUP BY T1.breed_name ORDER BY count(*) DESC LIMIT 1
Generated query:


SELECT breed_name FROM breeds ORDER BY dog_count DESC LIMIT 1<eos>
____________________________________________________________________________________________________
Original query:
SELECT T1.breed_name FROM Breeds AS T1 JOIN Dogs AS T2 ON T1.breed_code  =  T2.breed_code GROUP BY T1.breed_name ORDER BY count(*) DESC LIMIT 1
Generated query:


SELECT breed FROM dogs ORDER BY count DESC LIMIT 1<eos>
____________________________________________________________________________________________________
Original query:
SELECT T1.owner_id ,  T1.last_name FROM Owners AS T1 JOIN Dogs AS T2 ON T1.owner_id  =  T2.owner_id JOIN Treatments AS T3 ON T2.dog_id  =  T3.dog_id GROUP BY T1.owner_id ORDER BY count(*) DESC LIMIT 1
Generated query:


SELECT  owner_id ,  last_name FROM owners  WHERE  total_treatment_cost  =  ( SELECT  MAX(total_treatment_cost) FROM treatments WHERE owner_id  =  owners.owner_id )<eos>
____________________________________________________________________________________________________
Original query:
SELECT T1.owner_id ,  T1.last_name FROM Owners AS T1 JOIN Dogs AS T2 ON T1.owner_id  =  T2.owner_id JOIN Treatments AS T3 ON T2.dog_id  =  T3.dog_id GROUP BY T1.owner_id ORDER BY count(*) DESC LIMIT 1
Generated query:


SELECT owner_id , last_name FROM owners WHERE sum(treatment_cost)  =  (SELECT MAX(sum(treatment_cost)) FROM owners)<eos>
____________________________________________________________________________________________________
Original query:
SELECT T1.treatment_type_description FROM Treatment_types AS T1 JOIN Treatments AS T2 ON T1.treatment_type_code  =  T2.treatment_type_code GROUP BY T1.treatment_type_code ORDER BY sum(cost_of_treatment) ASC LIMIT 1
Generated query:


SELECT  treatment_type_description FROM treatment_type WHERE cost_total  =  (SELECT  MIN(cost_total) FROM treatment_type)<eos>
____________________________________________________________________________________________________
Original query:
SELECT T1.treatment_type_description FROM Treatment_types AS T1 JOIN Treatments AS T2 ON T1.treatment_type_code  =  T2.treatment_type_code GROUP BY T1.treatment_type_code ORDER BY sum(cost_of_treatment) ASC LIMIT 1
Generated query:


SELECT  treatment_type_description FROM treatment_type WHERE total_cost  =  (SELECT  MIN(total_cost) FROM treatment_type)<eos>
____________________________________________________________________________________________________
Original query:
SELECT T1.owner_id ,  T1.zip_code FROM Owners AS T1 JOIN Dogs AS T2 ON T1.owner_id  =  T2.owner_id JOIN Treatments AS T3 ON T2.dog_id  =  T3.dog_id GROUP BY T1.owner_id ORDER BY sum(T3.cost_of_treatment) DESC LIMIT 1
Generated query:


SELECT  owner_id ,  zip_code FROM  owners  GROUP BY  owner_id  ORDER BY  sum(total_cost) DESC LIMIT 1<eos>
____________________________________________________________________________________________________
Original query:
SELECT T1.owner_id ,  T1.zip_code FROM Owners AS T1 JOIN Dogs AS T2 ON T1.owner_id  =  T2.owner_id JOIN Treatments AS T3 ON T2.dog_id  =  T3.dog_id GROUP BY T1.owner_id ORDER BY sum(T3.cost_of_treatment) DESC LIMIT 1
Generated query:


SELECT owner_id ,  zip_code FROM  owner  WHERE  total_spent  =  (SELECT MAX(total_spent) FROM owner)<eos>
____________________________________________________________________________________________________
Original query:
SELECT T1.professional_id ,  T1.cell_number FROM Professionals AS T1 JOIN Treatments AS T2 ON T1.professional_id  =  T2.professional_id GROUP BY T1.professional_id HAVING count(*)  >=  2
Generated query:


SELECT  prof_id ,  cell_phone FROM  treatment_prof<eos>
____________________________________________________________________________________________________
Original query:
SELECT T1.professional_id ,  T1.cell_number FROM Professionals AS T1 JOIN Treatments AS T2 ON T1.professional_id  =  T2.professional_id GROUP BY T1.professional_id HAVING count(*)  >=  2
Generated query:


SELECT  treatment_id ,  cell_phone FROM  treatment  WHERE  treatment_id  >  0  AND  treatment_id  <  2<eos>
____________________________________________________________________________________________________
Original query:
SELECT DISTINCT T1.first_name ,  T1.last_name FROM Professionals AS T1 JOIN Treatments AS T2 WHERE cost_of_treatment  <  ( SELECT avg(cost_of_treatment) FROM Treatments )
Generated query:


SELECT  first_name , last_name FROM professionals WHERE cost <  (SELECT  min(cost) FROM professionals)<eos>
____________________________________________________________________________________________________
Original query:
SELECT DISTINCT T1.first_name ,  T1.last_name FROM Professionals AS T1 JOIN Treatments AS T2 WHERE cost_of_treatment  <  ( SELECT avg(cost_of_treatment) FROM Treatments )
Generated query:


SELECT  first_name , last_name FROM  professional  WHERE  treatment_cost <  (SELECT  AVG(treatment_cost) FROM  treatment  GROUP BY  treatment_id )<eos>
____________________________________________________________________________________________________
Original query:
SELECT T1.date_of_treatment ,  T2.first_name FROM Treatments AS T1 JOIN Professionals AS T2 ON T1.professional_id  =  T2.professional_id
Generated query:


SELECT Treatment_Date ,  First_Name FROM Treatment<eos>
____________________________________________________________________________________________________
Original query:
SELECT T1.date_of_treatment ,  T2.first_name FROM Treatments AS T1 JOIN Professionals AS T2 ON T1.professional_id  =  T2.professional_id
Generated query:


SELECT  treatment_date ,  first_name FROM treatment<eos>
____________________________________________________________________________________________________
Original query:
SELECT T1.cost_of_treatment ,  T2.treatment_type_description FROM Treatments AS T1 JOIN treatment_types AS T2 ON T1.treatment_type_code  =  T2.treatment_type_code
Generated query:


SELECT  treatment_cost ,  treatment_type FROM treatment<eos>
____________________________________________________________________________________________________
Original query:
SELECT T1.cost_of_treatment ,  T2.treatment_type_description FROM Treatments AS T1 JOIN treatment_types AS T2 ON T1.treatment_type_code  =  T2.treatment_type_code
Generated query:


SELECT  treatment_cost ,  treatment_type_description FROM treatment<eos>
____________________________________________________________________________________________________
Original query:
SELECT T1.first_name ,  T1.last_name ,  T2.size_code FROM Owners AS T1 JOIN Dogs AS T2 ON T1.owner_id  =  T2.owner_id
Generated query:
 <strong>SELECT</strong>  owner_first_name , owner_last_name , dog_size  <strong>FROM</strong>  owner  <strong>JOIN</strong>  dog  ON  owner_id  =  dog_owner_id<eos>
____________________________________________________________________________________________________
Original query:
SELECT T1.first_name ,  T1.last_name ,  T2.size_code FROM Owners AS T1 JOIN Dogs AS T2 ON T1.owner_id  =  T2.owner_id
Generated query:


SELECT  owner_first_name , owner_last_name , dog_size FROM owners JOIN dogs ON owners.owner_id  = dogs.owner_id<eos>
____________________________________________________________________________________________________
Original query:
SELECT T1.first_name ,  T2.name FROM Owners AS T1 JOIN Dogs AS T2 ON T1.owner_id  =  T2.owner_id
Generated query:
 <strong>SELECT owner_first_name , dog_name FROM owner JOIN dog ON owner.owner_id = dog.owner_id ORDER BY dog_name</strong><eos>
____________________________________________________________________________________________________
Original query:
SELECT T1.first_name ,  T2.name FROM Owners AS T1 JOIN Dogs AS T2 ON T1.owner_id  =  T2.owner_id
Generated query:


SELECT  owner.first_name , dog.name FROM owner JOIN dog ON owner.id  = dog.owner_id<eos>
____________________________________________________________________________________________________
Original query:

,db_id,query,question,query_toks,query_toks_no_value,question_toks,modified question,generated_query
932,dog_kennels,"SELECT T1.professional_id , T1.role_code , T...",Which professionals have done at least two tre...,"[SELECT, T1.professional_id, ,, T1.role_code, ...","[select, t1, ., professional_id, ,, t1, ., rol...","[Which, professionals, have, done, at, least, ...","""Write a query that answers the following ques...","\n\nSELECT prof_id , role , first_name FROM ..."
933,dog_kennels,"SELECT T1.professional_id , T1.role_code , T...","What are the id, role, and first name of the p...","[SELECT, T1.professional_id, ,, T1.role_code, ...","[select, t1, ., professional_id, ,, t1, ., rol...","[What, are, the, id, ,, role, ,, and, first, n...","""Write a query that answers the following ques...","\n\nSELECT t1.id , t1.role , t1.first_name F..."
934,dog_kennels,SELECT T1.breed_name FROM Breeds AS T1 JOIN Do...,What is the name of the breed with the most dogs?,"[SELECT, T1.breed_name, FROM, Breeds, AS, T1, ...","[select, t1, ., breed_name, from, breeds, as, ...","[What, is, the, name, of, the, breed, with, th...","""Write a query that answers the following ques...",\n\nSELECT breed_name FROM breeds ORDER BY do...
935,dog_kennels,SELECT T1.breed_name FROM Breeds AS T1 JOIN Do...,Which breed do the most dogs have? Give me the...,"[SELECT, T1.breed_name, FROM, Breeds, AS, T1, ...","[select, t1, ., breed_name, from, breeds, as, ...","[Which, breed, do, the, most, dogs, have, ?, G...","""Write a query that answers the following ques...",\n\nSELECT breed FROM dogs ORDER BY count DES...
936,dog_kennels,"SELECT T1.owner_id , T1.last_name FROM Owners...",Which owner has paid for the most treatments o...,"[SELECT, T1.owner_id, ,, T1.last_name, FROM, O...","[select, t1, ., owner_id, ,, t1, ., last_name,...","[Which, owner, has, paid, for, the, most, trea...","""Write a query that answers the following ques...","\n\nSELECT owner_id , last_name FROM owners..."
937,dog_kennels,"SELECT T1.owner_id , T1.last_name FROM Owners...",Tell me the owner id and last name of the owne...,"[SELECT, T1.owner_id, ,, T1.last_name, FROM, O...","[select, t1, ., owner_id, ,, t1, ., last_name,...","[Tell, me, the, owner, id, and, last, name, of...","""Write a query that answers the following ques...","\n\nSELECT owner_id , last_name FROM owners W..."
938,dog_kennels,SELECT T1.treatment_type_description FROM Trea...,What is the description of the treatment type ...,"[SELECT, T1.treatment_type_description, FROM, ...","[select, t1, ., treatment_type_description, fr...","[What, is, the, description, of, the, treatmen...","""Write a query that answers the following ques...",\n\nSELECT treatment_type_description FROM t...
939,dog_kennels,SELECT T1.treatment_type_description FROM Trea...,Give me the description of the treatment type ...,"[SELECT, T1.treatment_type_description, FROM, ...","[select, t1, ., treatment_type_description, fr...","[Give, me, the, description, of, the, treatmen...","""Write a query that answers the following ques...",\n\nSELECT treatment_type_description FROM t...
940,dog_kennels,"SELECT T1.owner_id , T1.zip_code FROM Owners ...",Which owner has paid the largest amount of mon...,"[SELECT, T1.owner_id, ,, T1.zip_code, FROM, Ow...","[select, t1, ., owner_id, ,, t1, ., zip_code, ...","[Which, owner, has, paid, the, largest, amount...","""Write a query that answers the following ques...","\n\nSELECT owner_id , zip_code FROM owners..."
941,dog_kennels,"SELECT T1.owner_id , T1.zip_code FROM Owners ...",Find the owner id and zip code of the owner wh...,"[SELECT, T1.owner_id, ,, T1.zip_code, FROM, Ow...","[select, t1, ., owner_id, ,, t1, ., zip_code, ...","[Find, the, owner, id, and, zip, code, of, the...","""Write a query that answers the following ques...","\n\nSELECT owner_id , zip_code FROM owner ..."
942,dog_kennels,"SELECT T1.professional_id , T1.cell_number FR...",Which professionals have done at least two typ...,"[SELECT, T1.professional_id, ,, T1.cell_number...","[select, t1, ., professional_id, ,, t1, ., cel...","[Which, professionals, have, done, at, least, ...","""Write a query that answers the following ques...","\n\nSELECT prof_id , cell_phone FROM treat..."
943,dog_kennels,"SELECT T1.professional_id , T1.cell_number FR...",Find the id and cell phone of the professional...,"[SELECT, T1.professional_id, ,, T1.cell_number...","[select, t1, ., professional_id, ,, t1, ., cel...","[Find, the, id, and, cell, phone, of, the, pro...","""Write a query that answers the following ques...","\n\nSELECT treatment_id , cell_phone FROM ..."
944,dog_kennels,"SELECT DISTINCT T1.first_name , T1.last_name ...",What are the first name and last name of the p...,"[SELECT, DISTINCT, T1.first_name, ,, T1.last_n...","[select, distinct, t1, ., first_name, ,, t1, ....","[What, are, the, first, name, and, last, name,...","""Write a query that answers the following ques...","\n\nSELECT first_name , last_name FROM profe..."
945,dog_kennels,"SELECT DISTINCT T1.first_name , T1.last_name ...",Which professionals have operated a treatment ...,"[SELECT, DISTINCT, T1.first_name, ,, T1.last_n...","[select, distinct, t1, ., first_name, ,, t1, ....","[Which, professionals, have, operated, a, trea...","""Write a query that answers the following ques...","\n\nSELECT first_name , last_name FROM prof..."
946,dog_kennels,"SELECT T1.date_of_treatment , T2.first_name F...","List the date of each treatment, together with...","[SELECT, T1.date_of_treatment, ,, T2.first_nam...","[select, t1, ., date_of_treatment, ,, t2, ., f...","[List, the, date, of, each, treatment, ,, toge...","""Write a query that answers the following ques...","\n\nSELECT Treatment_Date , First_Name FROM ..."
947,dog_kennels,"SELECT T1.date_of_treatment , T2.first_name F...",What are the date and the operating profession...,"[SELECT, T1.date_of_treatment, ,, T2.first_nam...","[select, t1, ., date_of_treatment, ,, t2, ., f...","[What, are, the, date, and, the, operating, pr...","""Write a query that answers the following ques...","\n\nSELECT treatment_date , first_name FROM..."
948,dog_kennels,"SELECT T1.cost_of_treatment , T2.treatment_ty...",List the cost of each treatment and the corres...,"[SELECT, T1.cost_of_treatment, ,, T2.treatment...","[select, t1, ., cost_of_treatment, ,, t2, ., t...","[List, the, cost, of, each, treatment, and, th...","""Write a query that answers the following ques...","\n\nSELECT treatment_cost , treatment_type ..."
949,dog_kennels,"SELECT T1.cost_of_treatment , T2.treatment_ty...",What are the cost and treatment type descripti...,"[SELECT, T1.cost_of_treatment, ,, T2.treatment...","[select, t1, ., cost_of_treatment, ,, t2, ., t...","[What, are, the, cost, and, treatment, type, d...","""Write a query that answers the following ques...","\n\nSELECT treatment_cost , treatment_type_..."
950,dog_kennels,"SELECT T1.first_name , T1.last_name , T2.siz...","List each owner's first name, last name, and t...","[SELECT, T1.first_name, ,, T1.last_name, ,, T2...","[select, t1, ., first_name, ,, t1, ., last_nam...","[List, each, owner, 's, first, name, ,, last, ...","""Write a query that answers the following ques...","<strong>SELECT</strong> owner_first_name , o..."
951,dog_kennels,"SELECT T1.first_name , T1.last_name , T2.siz...","What are each owner's first name, last name, a...","[SELECT, T1.first_name, ,, T1.last_name, ,, T2...","[select, t1, ., first_name, ,, t1, ., last_nam...","[What, are, each, owner, 's, first, name, ,, l...","""Write a query that answers the following ques...","\n\nSELECT owner_first_name , owner_last_nam..."
952,dog_kennels,"SELECT T1.first_name , T2.name FROM Owners AS...",List pairs of the owner's first name and the d...,"[SELECT, T1.first_name, ,, T2.name, FROM, Owne...","[select, t1, ., first_name, ,, t2, ., name, fr...","[List, pairs, of, the, owner, 's, first, name,...","""Write a query that answers the following ques...","<strong>SELECT owner_first_name , dog_name FR..."
953,dog_kennels,"SELECT T1.first_name , T2.name FROM Owners AS...",What are each owner's first name and their dog...,"[SELECT, T1.first_name, ,, T2.name, FROM, Owne...","[select, t1, ., first_name, ,, t2, ., name, fr...","[What, are, each, owner, 's, first, name, and,...","""Write a query that answers the following ques...","\n\nSELECT owner.first_name , dog.name FROM ..."
954,dog_kennels,"SELECT T1.name , T2.date_of_treatment FROM Do...",List the names of the dogs of the rarest breed...,"[SELECT, T1.name, ,, T2.date_of_treatment, FRO...","[select, t1, ., name, ,, t2, ., date_of_treatm...","[List, the, names, of, the, dogs, of, the, rar...","""Write a query that answers the following ques...","<strong>SELECT</strong> breed_name , treatme..."
955,dog_kennels,"SELECT T1.name , T2.date_of_treatment FROM Do...",Which dogs are of the rarest breed? Show their...,"[SELECT, T1.name, ,, T2.date_of_treatment, FRO...","[select, t1, ., name, ,, t2, ., date_of_treatm...","[Which, dogs, are, of, the, rarest, breed, ?, ...","""Write a query that answers the following ques...","<strong>SELECT</strong> treatment_date , br..."
956,dog_kennels,"SELECT T1.first_name , T2.name FROM Owners AS...",Which dogs are owned by someone who lives in V...,"[SELECT, T1.first_name, ,, T2.name, FROM, Owne...","[select, t1, ., first_name, ,, t2, ., name, fr...","[Which, dogs, are, owned, by, someone, who, li...","""Write a query that answers the following ques...","\n\nSELECT owner.first_name , dog.name FROM ..."
957,dog_kennels,"SELECT T1.first_name , T2.name FROM Owners AS...",Find the first names of owners living in Virgi...,"[SELECT, T1.first_name, ,, T2.name, FROM, Owne...","[select, t1, ., first_name, ,, t2, ., name, fr...","[Find, the, first, names, of, owners, living, ...","""Write a query that answers the following ques...","\n\nSELECT first_name , name FROM owner ..."
958,dog_kennels,"SELECT DISTINCT T1.date_arrived , T1.date_dep...",What are the arriving date and the departing d...,"[SELECT, DISTINCT, T1.date_arrived, ,, T1.date...","[select, distinct, t1, ., date_arrived, ,, t1,...","[What, are, the, arriving, date, and, the, dep...","""Write a query that answers the following ques...","\n\nSELECT a.arrival_date , a.departure_dat..."
959,dog_kennels,"SELECT DISTINCT T1.date_arrived , T1.date_dep...",Find the arriving date and the departing date ...,"[SELECT, DISTINCT, T1.date_arrived, ,, T1.date...","[select, distinct, t1, ., date_arrived, ,, t1,...","[Find, the, arriving, date, and, the, departin...","""Write a query that answers the following ques...","<strong>SELECT arrival_date , departure_dat..."
960,dog_kennels,SELECT T1.last_name FROM Owners AS T1 JOIN Dog...,List the last name of the owner owning the you...,"[SELECT, T1.last_name, FROM, Owners, AS, T1, J...","[select, t1, ., last_name, from, owners, as, t...","[List, the, last, name, of, the, owner, owning...","""Write a query that answers the following ques...",\n\nSELECT owner_last_name FROM dog ORDER BY...
961,dog_kennels,SELECT T1.last_name FROM Owners AS T1 JOIN Dog...,Who owns the youngest dog? Give me his or her ...,"[SELECT, T1.last_name, FROM, Owners, AS, T1, J...","[select, t1, ., last_name, from, owners, as, t...","[Who, owns, the, youngest, dog, ?, Give, me, h...","""Write a query that answers the following ques...",\n\nSELECT last_name FROM dog WHERE age = (S...
962,dog_kennels,SELECT email_address FROM Professionals WHERE ...,List the emails of the professionals who live ...,"[SELECT, email_address, FROM, Professionals, W...","[select, email_address, from, professionals, w...","[List, the, emails, of, the, professionals, wh...","""Write a query that answers the following ques...",\n\nSELECT email FROM professionals WHERE sta...
963,dog_kennels,SELECT email_address FROM Professionals WHERE ...,What are the emails of the professionals livin...,"[SELECT, email_address, FROM, Professionals, W...","[select, email_address, from, professionals, w...","[What, are, the, emails, of, the, professional...","""Write a query that answers the following ques...",\n\nSELECT email FROM professionals WHERE sta...
964,dog_kennels,"SELECT date_arrived , date_departed FROM Dogs",What are the arriving date and the departing d...,"[SELECT, date_arrived, ,, date_departed, FROM,...","[select, date_arrived, ,, date_departed, from,...","[What, are, the, arriving, date, and, the, dep...","""Write a query that answers the following ques...","<strong>SELECT arrival_date , departure_dat..."
965,dog_kennels,"SELECT date_arrived , date_departed FROM Dogs",List the arrival date and the departure date f...,"[SELECT, date_arrived, ,, date_departed, FROM,...","[select, date_arrived, ,, date_departed, from,...","[List, the, arrival, date, and, the, departure...","""Write a query that answers the following ques...","<strong>SELECT arrival_date , departure_date ..."
966,dog_kennels,SELECT count(DISTINCT dog_id) FROM Treatments,How many dogs went through any treatments?,"[SELECT, count, (, DISTINCT, dog_id, ), FROM, ...","[select, count, (, distinct, dog_id, ), from, ...","[How, many, dogs, went, through, any, treatmen...","""Write a query that answers the following ques...",\n\nSELECT count(*) FROM Treatment WHERE Trea...
967,dog_kennels,SELECT count(DISTINCT dog_id) FROM Treatments,Count the number of dogs that went through a t...,"[SELECT, count, (, DISTINCT, dog_id, ), FROM, ...","[select, count, (, distinct, dog_id, ), from, ...","[Count, the, number, of, dogs, that, went, thr...","""Write a query that answers the following ques...",\n\nSELECT COUNT(*) FROM Treatment WHERE Trea...
968,dog_kennels,SELECT count(DISTINCT professional_id) FROM Tr...,How many professionals have performed any trea...,"[SELECT, count, (, DISTINCT, professional_id, ...","[select, count, (, distinct, professional_id, ...","[How, many, professionals, have, performed, an...","""Write a query that answers the following ques...",\n\nSELECT COUNT(*) FROM treatment WHERE prof...
969,dog_kennels,SELECT count(DISTINCT professional_id) FROM Tr...,Find the number of professionals who have ever...,"[SELECT, count, (, DISTINCT, professional_id, ...","[select, count, (, distinct, professional_id, ...","[Find, the, number, of, professionals, who, ha...","""Write a query that answers the following ques...",\n\nSELECT COUNT(*) FROM professionals WHERE ...
970,dog_kennels,"SELECT role_code , street , city , state FR...",Which professionals live in a city containing ...,"[SELECT, role_code, ,, street, ,, city, ,, sta...","[select, role_code, ,, street, ,, city, ,, sta...","[Which, professionals, live, in, a, city, cont...","""Write a query that answers the following ques...","\n\nSELECT role , street , city , state FROM..."
971,dog_kennels,"SELECT role_code , street , city , state FR...","Find the role, street, city and state of the p...","[SELECT, role_code, ,, street, ,, city, ,, sta...","[select, role_code, ,, street, ,, city, ,, sta...","[Find, the, role, ,, street, ,, city, and, sta...","""Write a query that answers the following ques...","<strong>SELECT role, street, city, state FROM..."
972,dog_kennels,"SELECT first_name , last_name , email_addres...",Which owners live in the state whose name cont...,"[SELECT, first_name, ,, last_name, ,, email_ad...","[select, first_name, ,, last_name, ,, email_ad...","[Which, owners, live, in, the, state, whose, n...","""Write a query that answers the following ques...","\n\nSELECT owner_first_name , owner_last_na..."
973,dog_kennels,"SELECT first_name , last_name , email_addres...","Return the first name, last name and email of ...","[SELECT, first_name, ,, last_name, ,, email_ad...","[select, first_name, ,, last_name, ,, email_ad...","[Return, the, first, name, ,, last, name, and,...","""Write a query that answers the following ques...","\n\nSELECT first_name , last_name , email FR..."
974,dog_kennels,SELECT count(*) FROM Dogs WHERE age < ( SELE...,How many dogs have an age below the average?,"[SELECT, count, (, *, ), FROM, Dogs, WHERE, ag...","[select, count, (, *, ), from, dogs, where, ag...","[How, many, dogs, have, an, age, below, the, a...","""Write a query that answers the following ques...",\n\nSELECT COUNT(*) FROM dog WHERE age < (SEL...
975,dog_kennels,SELECT count(*) FROM Dogs WHERE age < ( SELE...,Count the number of dogs of an age below the a...,"[SELECT, count, (, *, ), FROM, Dogs, WHERE, ag...","[select, count, (, *, ), from, dogs, where, ag...","[Count, the, number, of, dogs, of, an, age, be...","""Write a query that answers the following ques...",\n\nSELECT COUNT(*) FROM dog WHERE age < AVG(...
976,dog_kennels,SELECT cost_of_treatment FROM Treatments ORDER...,How much does the most recent treatment cost?,"[SELECT, cost_of_treatment, FROM, Treatments, ...","[select, cost_of_treatment, from, treatments, ...","[How, much, does, the, most, recent, treatment...","""Write a query that answers the following ques...",\n\nSELECT treatment_cost FROM treatment ORD...
977,dog_kennels,SELECT cost_of_treatment FROM Treatments ORDER...,Show me the cost of the most recently performe...,"[SELECT, cost_of_treatment, FROM, Treatments, ...","[select, cost_of_treatment, from, treatments, ...","[Show, me, the, cost, of, the, most, recently,...","""Write a query that answers the following ques...",\n\nSELECT treatment_cost FROM treatment ORD...
978,dog_kennels,SELECT count(*) FROM Dogs WHERE dog_id NOT IN ...,How many dogs have not gone through any treatm...,"[SELECT, count, (, *, ), FROM, Dogs, WHERE, do...","[select, count, (, *, ), from, dogs, where, do...","[How, many, dogs, have, not, gone, through, an...","""Write a query that answers the following ques...",\n\nSELECT count(*) FROM Treatment WHERE Trea...
979,dog_kennels,select count(*) from dogs where dog_id not in ...,Tell me the number of dogs that have not recei...,"[select, count, (, *, ), from, dogs, where, do...","[select, count, (, *, ), from, dogs, where, do...","[Tell, me, the, number, of, dogs, that, have, ...","""Write a query that answers the following ques...",\n\nSELECT count(*) FROM dog WHERE treatment_...
980,dog_kennels,SELECT count(*) FROM Owners WHERE owner_id NOT...,How many owners temporarily do not have any dogs?,"[SELECT, count, (, *, ), FROM, Owners, WHERE, ...","[select, count, (, *, ), from, owners, where, ...","[How, many, owners, temporarily, do, not, have...","""Write a query that answers the following ques...",\n\nSELECT COUNT(*) FROM Owners WHERE NOT EXI...
981,dog_kennels,SELECT count(*) FROM Owners WHERE owner_id NOT...,Find the number of owners who do not own any d...,"[SELECT, count, (, *, ), FROM, Owners, WHERE, ...","[select, count, (, *, ), from, owners, where, ...","[Find, the, number, of, owners, who, do, not, ...","""Write a query that answers the following ques...",<strong>SELECT COUNT(*) FROM Owners WHERE NOT...
982,dog_kennels,SELECT count(*) FROM Professionals WHERE profe...,How many professionals did not operate any tre...,"[SELECT, count, (, *, ), FROM, Professionals, ...","[select, count, (, *, ), from, professionals, ...","[How, many, professionals, did, not, operate, ...","""Write a query that answers the following ques...",\n\nSELECT COUNT(*) FROM treatment WHERE prof...

====================================================================================================
(51, 7)
Input:  ['"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Find the number of professionals who have not treated any dogs. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> List the dog name, age and weight of the dogs who have been abandoned? 1 stands for yes, and 0 stands for no. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the dog name, age and weight of the dogs that were abandoned? Note that 1 stands for yes, and 0 stands for no in the tables. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the average age of all the dogs? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Compute the average age of all the dogs. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the age of the oldest dog? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Tell me the age of the oldest dog. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> How much does each charge type costs? List both charge type and amount. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> List each charge type and its amount. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> How much does the most expensive charge type costs? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the charge amount of the most expensive charge type? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> List the email, cell phone and home phone of all the professionals. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the email, cell phone and home phone of each professional? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are all the possible breed type and size type combinations? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Find the distinct breed type and size type combinations for dogs. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> List the first name of all the professionals along with the description of the treatment they have done. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are each professional\'s first name and description of the treatment they have performed? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> How many singers are there? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the count of singers? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> List the name of singers in ascending order of net worth. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the names of singers ordered by ascending net worth? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the birth year and citizenship of singers? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the birth years and citizenships of the singers? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> List the name of singers whose citizenship is not "France". <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the names of the singers who are not French citizens? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Show the name of singers whose birth year is either 1948 or 1949? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the names of the singers whose birth years are either 1948 or 1949? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the name of the singer with the largest net worth? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the name of the singer who is worth the most? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Show different citizenship of singers and the number of singers of each citizenship. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> For each citizenship, how many singers are from that country? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Please show the most common citizenship of singers. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the most common singer citizenship ? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Show different citizenships and the maximum net worth of singers of each citizenship. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> For each citizenship, what is the maximum net worth? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Show titles of songs and names of singers. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the song titles and singer names? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Show distinct names of singers that have songs with sales more than 300000. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> what are the different names of the singers that have sales more than 300000? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Show the names of singers that have more than one song. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the names of the singers that have more than one songs? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Show the names of singers and the total sales of their songs. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> For each singer name, what is the total sales for their songs? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> List the name of singers that do not have any song. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the sname of every sing that does not have any song? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Show the citizenship shared by singers with birth year before 1945 and after 1955. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the citizenships that are shared by singers with a birth year before 1945 and after 1955? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> How many available features are there in total? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What is the feature type name of feature AirCon? <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> Show the property type descriptions of properties belonging to that code. <query> ', '"Write a query that answers the following question. Return only the query and no additional explanation."\n\n<question> What are the names of properties that are either houses or apartments with more than 1 room? <query> ']
Original query:
SELECT count(*) FROM Professionals WHERE professional_id NOT IN ( SELECT professional_id FROM Treatments )
Generated query:


SELECT COUNT(*) FROM professionals WHERE profession = 'Veterinarian' AND dog_treated = 'No'<eos>
____________________________________________________________________________________________________
Original query:
SELECT name ,  age ,  weight FROM Dogs WHERE abandoned_yn  =  1
Generated query:
 <strong>SELECT dog_name, age, weight FROM dogs WHERE abandoned = 1</strong><eos>
____________________________________________________________________________________________________
Original query:
SELECT name ,  age ,  weight FROM Dogs WHERE abandoned_yn  =  1
Generated query:
 <strong>SELECT dog_name, age, weight FROM dogs WHERE abandoned = 1</strong><eos>
____________________________________________________________________________________________________
Original query:
SELECT avg(age) FROM Dogs
Generated query:


SELECT AVG(age) FROM dog<eos>
____________________________________________________________________________________________________
Original query:
SELECT avg(age) FROM Dogs
Generated query:
 <strong>SELECT AVG(age) FROM dog</strong><eos>
____________________________________________________________________________________________________
Original query:
SELECT max(age) FROM Dogs
Generated query:


SELECT  MAX(age) FROM dog<eos>
____________________________________________________________________________________________________
Original query:
SELECT max(age) FROM Dogs
Generated query:
 <strong>SELECT  age FROM  dog ORDER BY age DESC LIMIT 1</strong><eos>
____________________________________________________________________________________________________
Original query:
SELECT charge_type ,  charge_amount FROM Charges
Generated query:


SELECT charge_type , SUM(amount) FROM charge GROUP BY charge_type<eos>
____________________________________________________________________________________________________
Original query:
SELECT charge_type ,  charge_amount FROM Charges
Generated query:


SELECT charge_type , SUM(amount) FROM charge GROUP BY charge_type<eos>
____________________________________________________________________________________________________
Original query:
SELECT max(charge_amount) FROM Charges
Generated query:


SELECT MAX(charge_type_cost) FROM charge_type<eos>
____________________________________________________________________________________________________
Original query:
SELECT max(charge_amount) FROM Charges
Generated query:


SELECT MAX(charge_amount) FROM charge_type<eos>
____________________________________________________________________________________________________
Original query:
SELECT email_address ,  cell_number ,  home_phone FROM professionals
Generated query:


SELECT  email , cell_phone , home_phone FROM professionals<eos>
____________________________________________________________________________________________________
Original query:
SELECT email_address ,  cell_number ,  home_phone FROM professionals
Generated query:


SELECT  email , cell_phone , home_phone FROM professional<eos>
____________________________________________________________________________________________________
Original query:
SELECT DISTINCT breed_code ,  size_code FROM dogs
Generated query:


SELECT DISTINCT breed_type , size_type FROM breeds<eos>
____________________________________________________________________________________________________
Original query:
SELECT DISTINCT breed_code ,  size_code FROM dogs
Generated query:


SELECT DISTINCT breed_type , size_type FROM dog<eos>
____________________________________________________________________________________________________
Original query:
SELECT DISTINCT T1.first_name ,  T3.treatment_type_description FROM professionals AS T1 JOIN Treatments AS T2 ON T1.professional_id  =  T2.professional_id JOIN Treatment_types AS T3 ON T2.treatment_type_code  =  T3.treatment_type_code
Generated query:


SELECT  prof_name ,  treatment_desc FROM  treatment_prof<eos>
____________________________________________________________________________________________________
Original query:
SELECT DISTINCT T1.first_name ,  T3.treatment_type_description FROM professionals AS T1 JOIN Treatments AS T2 ON T1.professional_id  =  T2.professional_id JOIN Treatment_types AS T3 ON T2.treatment_type_code  =  T3.treatment_type_code
Generated query:


SELECT  first_name , description FROM  treatment_provider<eos>
____________________________________________________________________________________________________
Original query:
SELECT count(*) FROM singer
Generated query:


SELECT COUNT(*) FROM singers<eos>
____________________________________________________________________________________________________
Original query:
SELECT count(*) FROM singer
Generated query:


SELECT COUNT(*) FROM singers<eos>
____________________________________________________________________________________________________
Original query:
SELECT Name FROM singer ORDER BY Net_Worth_Millions ASC
Generated query:


SELECT  singer_name FROM singers ORDER BY net_worth ASC<eos>
____________________________________________________________________________________________________
Original query:
SELECT Name FROM singer ORDER BY Net_Worth_Millions ASC
Generated query:


SELECT  singer_name FROM singers ORDER BY net_worth ASC<eos>
____________________________________________________________________________________________________
Original query:
SELECT Birth_Year ,  Citizenship FROM singer
Generated query:


SELECT  birth_year ,  citizenship  FROM  singer<eos>
____________________________________________________________________________________________________
Original query:
SELECT Birth_Year ,  Citizenship FROM singer
Generated query:


SELECT  birth_year ,  citizenship  FROM  singer<eos>
____________________________________________________________________________________________________
Original query:
SELECT Name FROM singer WHERE Citizenship != "France"
Generated query:


SELECT  singers.name FROM singers WHERE citizenship != "France"<eos>
____________________________________________________________________________________________________
Original query:
SELECT Name FROM singer WHERE Citizenship != "France"
Generated query:


SELECT  singers_name FROM singers WHERE  citizenship != 'French'<eos>
____________________________________________________________________________________________________
Original query:
SELECT Name FROM singer WHERE Birth_Year  =  1948 OR Birth_Year  =  1949
Generated query:
 <strong>SELECT name FROM singer WHERE birth_year IN (1948, 1949)</strong><eos>
____________________________________________________________________________________________________
Original query:
SELECT Name FROM singer WHERE Birth_Year  =  1948 OR Birth_Year  =  1949
Generated query:


SELECT  singer_name FROM singers WHERE birth_year IN (1948,1949)<eos>
____________________________________________________________________________________________________
Original query:
SELECT Name FROM singer ORDER BY Net_Worth_Millions DESC LIMIT 1
Generated query:


SELECT  singer_name FROM singer ORDER BY net_worth DESC LIMIT 1<eos>
____________________________________________________________________________________________________
Original query:
SELECT Name FROM singer ORDER BY Net_Worth_Millions DESC LIMIT 1
Generated query:


SELECT  singer_name FROM  singer ORDER BY  total_worth DESC LIMIT 1<eos>
____________________________________________________________________________________________________
Original query:
SELECT Citizenship ,  COUNT(*) FROM singer GROUP BY Citizenship
Generated query:


SELECT DISTINCT citizenship FROM singers ORDER BY citizenship<eos>
____________________________________________________________________________________________________
Original query:
SELECT Citizenship ,  COUNT(*) FROM singer GROUP BY Citizenship
Generated query:


SELECT  country ,  COUNT(*) FROM singers GROUP BY country<eos>
____________________________________________________________________________________________________
Original query:
SELECT Citizenship FROM singer GROUP BY Citizenship ORDER BY COUNT(*) DESC LIMIT 1
Generated query:


SELECT  * FROM  singer JOIN  country ON singer.country_id  =  country.country_id  ORDER BY  count(*) DESC LIMIT  1<eos>
____________________________________________________________________________________________________
Original query:
select citizenship from singer group by citizenship order by count(*) desc limit 1
Generated query:


SELECT
  singer_country
FROM
  singer
GROUP BY
  singer_country
ORDER BY
  COUNT(*) DESC<eos>
____________________________________________________________________________________________________
Original query:
SELECT Citizenship ,  max(Net_Worth_Millions) FROM singer GROUP BY Citizenship
Generated query:


SELECT DISTINCT  citizenship ,  MAX(net_worth) FROM singers GROUP BY citizenship<eos>
____________________________________________________________________________________________________
Original query:
SELECT Citizenship ,  max(Net_Worth_Millions) FROM singer GROUP BY Citizenship
Generated query:


SELECT  * FROM  citizenship  WHERE  net_worth  =  (SELECT  MAX  (net_worth) FROM  citizenship)<eos>
____________________________________________________________________________________________________
Original query:
SELECT T2.Title ,  T1.Name FROM singer AS T1 JOIN song AS T2 ON T1.Singer_ID  =  T2.Singer_ID
Generated query:
 <strong>SELECT title , singer FROM song</strong><eos>
____________________________________________________________________________________________________
Original query:
SELECT T2.Title ,  T1.Name FROM singer AS T1 JOIN song AS T2 ON T1.Singer_ID  =  T2.Singer_ID
Generated query:


SELECT song_title , singer_name FROM song<eos>

,db_id,query,question,query_toks,query_toks_no_value,question_toks,modified question,generated_query
983,dog_kennels,SELECT count(*) FROM Professionals WHERE profe...,Find the number of professionals who have not ...,"[SELECT, count, (, *, ), FROM, Professionals, ...","[select, count, (, *, ), from, professionals, ...","[Find, the, number, of, professionals, who, ha...","""Write a query that answers the following ques...",\n\nSELECT COUNT(*) FROM professionals WHERE ...
984,dog_kennels,"SELECT name , age , weight FROM Dogs WHERE a...","List the dog name, age and weight of the dogs ...","[SELECT, name, ,, age, ,, weight, FROM, Dogs, ...","[select, name, ,, age, ,, weight, from, dogs, ...","[List, the, dog, name, ,, age, and, weight, of...","""Write a query that answers the following ques...","<strong>SELECT dog_name, age, weight FROM dog..."
985,dog_kennels,"SELECT name , age , weight FROM Dogs WHERE a...","What are the dog name, age and weight of the d...","[SELECT, name, ,, age, ,, weight, FROM, Dogs, ...","[select, name, ,, age, ,, weight, from, dogs, ...","[What, are, the, dog, name, ,, age, and, weigh...","""Write a query that answers the following ques...","<strong>SELECT dog_name, age, weight FROM dog..."
986,dog_kennels,SELECT avg(age) FROM Dogs,What is the average age of all the dogs?,"[SELECT, avg, (, age, ), FROM, Dogs]","[select, avg, (, age, ), from, dogs]","[What, is, the, average, age, of, all, the, do...","""Write a query that answers the following ques...",\n\nSELECT AVG(age) FROM dog
987,dog_kennels,SELECT avg(age) FROM Dogs,Compute the average age of all the dogs.,"[SELECT, avg, (, age, ), FROM, Dogs]","[select, avg, (, age, ), from, dogs]","[Compute, the, average, age, of, all, the, dog...","""Write a query that answers the following ques...",<strong>SELECT AVG(age) FROM dog</strong>
988,dog_kennels,SELECT max(age) FROM Dogs,What is the age of the oldest dog?,"[SELECT, max, (, age, ), FROM, Dogs]","[select, max, (, age, ), from, dogs]","[What, is, the, age, of, the, oldest, dog, ?]","""Write a query that answers the following ques...",\n\nSELECT MAX(age) FROM dog
989,dog_kennels,SELECT max(age) FROM Dogs,Tell me the age of the oldest dog.,"[SELECT, max, (, age, ), FROM, Dogs]","[select, max, (, age, ), from, dogs]","[Tell, me, the, age, of, the, oldest, dog, .]","""Write a query that answers the following ques...",<strong>SELECT age FROM dog ORDER BY age DE...
990,dog_kennels,"SELECT charge_type , charge_amount FROM Charges",How much does each charge type costs? List bot...,"[SELECT, charge_type, ,, charge_amount, FROM, ...","[select, charge_type, ,, charge_amount, from, ...","[How, much, does, each, charge, type, costs, ?...","""Write a query that answers the following ques...","\n\nSELECT charge_type , SUM(amount) FROM cha..."
991,dog_kennels,"SELECT charge_type , charge_amount FROM Charges",List each charge type and its amount.,"[SELECT, charge_type, ,, charge_amount, FROM, ...","[select, charge_type, ,, charge_amount, from, ...","[List, each, charge, type, and, its, amount, .]","""Write a query that answers the following ques...","\n\nSELECT charge_type , SUM(amount) FROM cha..."
992,dog_kennels,SELECT max(charge_amount) FROM Charges,How much does the most expensive charge type c...,"[SELECT, max, (, charge_amount, ), FROM, Charges]","[select, max, (, charge_amount, ), from, charges]","[How, much, does, the, most, expensive, charge...","""Write a query that answers the following ques...",\n\nSELECT MAX(charge_type_cost) FROM charge_...
993,dog_kennels,SELECT max(charge_amount) FROM Charges,What is the charge amount of the most expensiv...,"[SELECT, max, (, charge_amount, ), FROM, Charges]","[select, max, (, charge_amount, ), from, charges]","[What, is, the, charge, amount, of, the, most,...","""Write a query that answers the following ques...",\n\nSELECT MAX(charge_amount) FROM charge_type
994,dog_kennels,"SELECT email_address , cell_number , home_ph...","List the email, cell phone and home phone of a...","[SELECT, email_address, ,, cell_number, ,, hom...","[select, email_address, ,, cell_number, ,, hom...","[List, the, email, ,, cell, phone, and, home, ...","""Write a query that answers the following ques...","\n\nSELECT email , cell_phone , home_phone F..."
995,dog_kennels,"SELECT email_address , cell_number , home_ph...","What are the email, cell phone and home phone ...","[SELECT, email_address, ,, cell_number, ,, hom...","[select, email_address, ,, cell_number, ,, hom...","[What, are, the, email, ,, cell, phone, and, h...","""Write a query that answers the following ques...","\n\nSELECT email , cell_phone , home_phone F..."
996,dog_kennels,"SELECT DISTINCT breed_code , size_code FROM dogs",What are all the possible breed type and size ...,"[SELECT, DISTINCT, breed_code, ,, size_code, F...","[select, distinct, breed_code, ,, size_code, f...","[What, are, all, the, possible, breed, type, a...","""Write a query that answers the following ques...","\n\nSELECT DISTINCT breed_type , size_type FR..."
997,dog_kennels,"SELECT DISTINCT breed_code , size_code FROM dogs",Find the distinct breed type and size type com...,"[SELECT, DISTINCT, breed_code, ,, size_code, F...","[select, distinct, breed_code, ,, size_code, f...","[Find, the, distinct, breed, type, and, size, ...","""Write a query that answers the following ques...","\n\nSELECT DISTINCT breed_type , size_type FR..."
998,dog_kennels,"SELECT DISTINCT T1.first_name , T3.treatment_...",List the first name of all the professionals a...,"[SELECT, DISTINCT, T1.first_name, ,, T3.treatm...","[select, distinct, t1, ., first_name, ,, t3, ....","[List, the, first, name, of, all, the, profess...","""Write a query that answers the following ques...","\n\nSELECT prof_name , treatment_desc FROM ..."
999,dog_kennels,"SELECT DISTINCT T1.first_name , T3.treatment_...",What are each professional's first name and de...,"[SELECT, DISTINCT, T1.first_name, ,, T3.treatm...","[select, distinct, t1, ., first_name, ,, t3, ....","[What, are, each, professional, 's, first, nam...","""Write a query that answers the following ques...","\n\nSELECT first_name , description FROM tr..."
1000,singer,SELECT count(*) FROM singer,How many singers are there?,"[SELECT, count, (, *, ), FROM, singer]","[select, count, (, *, ), from, singer]","[How, many, singers, are, there, ?]","""Write a query that answers the following ques...",\n\nSELECT COUNT(*) FROM singers
1001,singer,SELECT count(*) FROM singer,What is the count of singers?,"[SELECT, count, (, *, ), FROM, singer]","[select, count, (, *, ), from, singer]","[What, is, the, count, of, singers, ?]","""Write a query that answers the following ques...",\n\nSELECT COUNT(*) FROM singers
1002,singer,SELECT Name FROM singer ORDER BY Net_Worth_Mil...,List the name of singers in ascending order of...,"[SELECT, Name, FROM, singer, ORDER, BY, Net_Wo...","[select, name, from, singer, order, by, net_wo...","[List, the, name, of, singers, in, ascending, ...","""Write a query that answers the following ques...",\n\nSELECT singer_name FROM singers ORDER BY...
1003,singer,SELECT Name FROM singer ORDER BY Net_Worth_Mil...,What are the names of singers ordered by ascen...,"[SELECT, Name, FROM, singer, ORDER, BY, Net_Wo...","[select, name, from, singer, order, by, net_wo...","[What, are, the, names, of, singers, ordered, ...","""Write a query that answers the following ques...",\n\nSELECT singer_name FROM singers ORDER BY...
1004,singer,"SELECT Birth_Year , Citizenship FROM singer",What are the birth year and citizenship of sin...,"[SELECT, Birth_Year, ,, Citizenship, FROM, sin...","[select, birth_year, ,, citizenship, from, sin...","[What, are, the, birth, year, and, citizenship...","""Write a query that answers the following ques...","\n\nSELECT birth_year , citizenship FROM ..."
1005,singer,"SELECT Birth_Year , Citizenship FROM singer",What are the birth years and citizenships of t...,"[SELECT, Birth_Year, ,, Citizenship, FROM, sin...","[select, birth_year, ,, citizenship, from, sin...","[What, are, the, birth, years, and, citizenshi...","""Write a query that answers the following ques...","\n\nSELECT birth_year , citizenship FROM ..."
1006,singer,"SELECT Name FROM singer WHERE Citizenship != ""...",List the name of singers whose citizenship is ...,"[SELECT, Name, FROM, singer, WHERE, Citizenshi...","[select, name, from, singer, where, citizenshi...","[List, the, name, of, singers, whose, citizens...","""Write a query that answers the following ques...",\n\nSELECT singers.name FROM singers WHERE c...
1007,singer,"SELECT Name FROM singer WHERE Citizenship != ""...",What are the names of the singers who are not ...,"[SELECT, Name, FROM, singer, WHERE, Citizenshi...","[select, name, from, singer, where, citizenshi...","[What, are, the, names, of, the, singers, who,...","""Write a query that answers the following ques...",\n\nSELECT singers_name FROM singers WHERE ...
1008,singer,SELECT Name FROM singer WHERE Birth_Year = 1...,Show the name of singers whose birth year is e...,"[SELECT, Name, FROM, singer, WHERE, Birth_Year...","[select, name, from, singer, where, birth_year...","[Show, the, name, of, singers, whose, birth, y...","""Write a query that answers the following ques...",<strong>SELECT name FROM singer WHERE birth_y...
1009,singer,SELECT Name FROM singer WHERE Birth_Year = 1...,What are the names of the singers whose birth ...,"[SELECT, Name, FROM, singer, WHERE, Birth_Year...","[select, name, from, singer, where, birth_year...","[What, are, the, names, of, the, singers, whos...","""Write a query that answers the following ques...",\n\nSELECT singer_name FROM singers WHERE bi...
1010,singer,SELECT Name FROM singer ORDER BY Net_Worth_Mil...,What is the name of the singer with the larges...,"[SELECT, Name, FROM, singer, ORDER, BY, Net_Wo...","[select, name, from, singer, order, by, net_wo...","[What, is, the, name, of, the, singer, with, t...","""Write a query that answers the following ques...",\n\nSELECT singer_name FROM singer ORDER BY ...
1011,singer,SELECT Name FROM singer ORDER BY Net_Worth_Mil...,What is the name of the singer who is worth th...,"[SELECT, Name, FROM, singer, ORDER, BY, Net_Wo...","[select, name, from, singer, order, by, net_wo...","[What, is, the, name, of, the, singer, who, is...","""Write a query that answers the following ques...",\n\nSELECT singer_name FROM singer ORDER BY...
1012,singer,"SELECT Citizenship , COUNT(*) FROM singer GRO...",Show different citizenship of singers and the ...,"[SELECT, Citizenship, ,, COUNT, (, *, ), FROM,...","[select, citizenship, ,, count, (, *, ), from,...","[Show, different, citizenship, of, singers, an...","""Write a query that answers the following ques...",\n\nSELECT DISTINCT citizenship FROM singers ...
1013,singer,"SELECT Citizenship , COUNT(*) FROM singer GRO...","For each citizenship, how many singers are fro...","[SELECT, Citizenship, ,, COUNT, (, *, ), FROM,...","[select, citizenship, ,, count, (, *, ), from,...","[For, each, citizenship, ,, how, many, singers...","""Write a query that answers the following ques...","\n\nSELECT country , COUNT(*) FROM singers ..."
1014,singer,SELECT Citizenship FROM singer GROUP BY Citize...,Please show the most common citizenship of sin...,"[SELECT, Citizenship, FROM, singer, GROUP, BY,...","[select, citizenship, from, singer, group, by,...","[Please, show, the, most, common, citizenship,...","""Write a query that answers the following ques...",\n\nSELECT * FROM singer JOIN country ON s...
1015,singer,select citizenship from singer group by citize...,What is the most common singer citizenship ?,"[select, citizenship, from, singer, group, by,...","[select, citizenship, from, singer, group, by,...","[What, is, the, most, common, singer, citizens...","""Write a query that answers the following ques...",\n\nSELECT \n singer_country \nFROM \n s...
1016,singer,"SELECT Citizenship , max(Net_Worth_Millions) ...",Show different citizenships and the maximum ne...,"[SELECT, Citizenship, ,, max, (, Net_Worth_Mil...","[select, citizenship, ,, max, (, net_worth_mil...","[Show, different, citizenships, and, the, maxi...","""Write a query that answers the following ques...","\n\nSELECT DISTINCT citizenship , MAX(net_w..."
1017,singer,"SELECT Citizenship , max(Net_Worth_Millions) ...","For each citizenship, what is the maximum net ...","[SELECT, Citizenship, ,, max, (, Net_Worth_Mil...","[select, citizenship, ,, max, (, net_worth_mil...","[For, each, citizenship, ,, what, is, the, max...","""Write a query that answers the following ques...",\n\nSELECT * FROM citizenship WHERE net_w...
1018,singer,"SELECT T2.Title , T1.Name FROM singer AS T1 J...",Show titles of songs and names of singers.,"[SELECT, T2.Title, ,, T1.Name, FROM, singer, A...","[select, t2, ., title, ,, t1, ., name, from, s...","[Show, titles, of, songs, and, names, of, sing...","""Write a query that answers the following ques...","<strong>SELECT title , singer FROM song</strong>"
1019,singer,"SELECT T2.Title , T1.Name FROM singer AS T1 J...",What are the song titles and singer names?,"[SELECT, T2.Title, ,, T1.Name, FROM, singer, A...","[select, t2, ., title, ,, t1, ., name, from, s...","[What, are, the, song, titles, and, singer, na...","""Write a query that answers the following ques...","\n\nSELECT song_title , singer_name FROM song"
1020,singer,SELECT DISTINCT T1.Name FROM singer AS T1 JOIN...,Show distinct names of singers that have songs...,"[SELECT, DISTINCT, T1.Name, FROM, singer, AS, ...","[select, distinct, t1, ., name, from, singer, ...","[Show, distinct, names, of, singers, that, hav...","""Write a query that answers the following ques...",<strong>SELECT DISTINCT name FROM song WHERE ...
1021,singer,SELECT DISTINCT T1.Name FROM singer AS T1 JOIN...,what are the different names of the singers th...,"[SELECT, DISTINCT, T1.Name, FROM, singer, AS, ...","[select, distinct, t1, ., name, from, singer, ...","[what, are, the, different, names, of, the, si...","""Write a query that answers the following ques...",\n\nSELECT DISTINCT name FROM singers WHERE s...
1022,singer,SELECT T1.Name FROM singer AS T1 JOIN song AS ...,Show the names of singers that have more than ...,"[SELECT, T1.Name, FROM, singer, AS, T1, JOIN, ...","[select, t1, ., name, from, singer, as, t1, jo...","[Show, the, names, of, singers, that, have, mo...","""Write a query that answers the following ques...",<strong>SELECT</strong> singer_name <strong...
1023,singer,SELECT T1.Name FROM singer AS T1 JOIN song AS ...,What are the names of the singers that have mo...,"[SELECT, T1.Name, FROM, singer, AS, T1, JOIN, ...","[select, t1, ., name, from, singer, as, t1, jo...","[What, are, the, names, of, the, singers, that...","""Write a query that answers the following ques...",\n\nSELECT singers.name FROM singers JOIN so...
1024,singer,"SELECT T1.Name , sum(T2.Sales) FROM singer AS...",Show the names of singers and the total sales ...,"[SELECT, T1.Name, ,, sum, (, T2.Sales, ), FROM...","[select, t1, ., name, ,, sum, (, t2, ., sales,...","[Show, the, names, of, singers, and, the, tota...","""Write a query that answers the following ques...","<strong>SELECT</strong> singer_name , SUM(s..."
1025,singer,"SELECT T1.Name , sum(T2.Sales) FROM singer AS...","For each singer name, what is the total sales ...","[SELECT, T1.Name, ,, sum, (, T2.Sales, ), FROM...","[select, t1, ., name, ,, sum, (, t2, ., sales,...","[For, each, singer, name, ,, what, is, the, to...","""Write a query that answers the following ques...","\n\nSELECT singer_name , SUM(sales) FROM ..."
1026,singer,SELECT Name FROM singer WHERE Singer_ID NOT IN...,List the name of singers that do not have any ...,"[SELECT, Name, FROM, singer, WHERE, Singer_ID,...","[select, name, from, singer, where, singer_id,...","[List, the, name, of, singers, that, do, not, ...","""Write a query that answers the following ques...",\n\nSELECT singers.name FROM singers JOIN so...
1027,singer,SELECT Name FROM singer WHERE Singer_ID NOT IN...,What is the sname of every sing that does not ...,"[SELECT, Name, FROM, singer, WHERE, Singer_ID,...","[select, name, from, singer, where, singer_id,...","[What, is, the, sname, of, every, sing, that, ...","""Write a query that answers the following ques...",<strong>SELECT sname FROM song WHERE song_id ...
1028,singer,SELECT Citizenship FROM singer WHERE Birth_Yea...,Show the citizenship shared by singers with bi...,"[SELECT, Citizenship, FROM, singer, WHERE, Bir...","[select, citizenship, from, singer, where, bir...","[Show, the, citizenship, shared, by, singers, ...","""Write a query that answers the following ques...",\n\nSELECT * FROM singer WHERE birth_year ...
1029,singer,SELECT Citizenship FROM singer WHERE Birth_Yea...,What are the citizenships that are shared by s...,"[SELECT, Citizenship, FROM, singer, WHERE, Bir...","[select, citizenship, from, singer, where, bir...","[What, are, the, citizenships, that, are, shar...","""Write a query that answers the following ques...",\n\nSELECT citizenship FROM singers WHERE bi...
1030,real_estate_properties,SELECT count(*) FROM Other_Available_Features,How many available features are there in total?,"[SELECT, count, (, *, ), FROM, Other_Available...","[select, count, (, *, ), from, other_available...","[How, many, available, features, are, there, i...","""Write a query that answers the following ques...",\n\nSELECT count(*) FROM feature
1031,real_estate_properties,SELECT T2.feature_type_name FROM Other_Availab...,What is the feature type name of feature AirCon?,"[SELECT, T2.feature_type_name, FROM, Other_Ava...","[select, t2, ., feature_type_name, from, other...","[What, is, the, feature, type, name, of, featu...","""Write a query that answers the following ques...",\n\nSELECT feature_type_name FROM feature W...
1032,real_estate_properties,SELECT T2.property_type_description FROM Prope...,Show the property type descriptions of propert...,"[SELECT, T2.property_type_description, FROM, P...","[select, t2, ., property_type_description, fro...","[Show, the, property, type, descriptions, of, ...","""Write a query that answers the following ques...",\n\nSELECT property_type_description FROM pr...
1033,real_estate_properties,SELECT property_name FROM Properties WHERE pro...,What are the names of properties that are eith...,"[SELECT, property_name, FROM, Properties, WHER...","[select, property_name, from, properties, wher...","[What, are, the, names, of, properties, that, ...","""Write a query that answers the following ques...",\n\nSELECT property_name FROM properties WHE...

In [ ]:
final_df = pd.concat(output)
final_df.to_csv("/content/drive/MyDrive/NLP/gemma2b_finetuned_output.csv")

In [ ]:
#Megha
from unsloth import FastLanguageModel
from datasets import load_dataset

max_new_tokens = 2048
max_seq_length = 2048
dtype = None
load_in_4bit = True

spider_prompt = """"Write a query that answers the following question. Return only the query and no additional explanation."

<question> {} <query> {}"""

data_col = "question"

test_data = load_dataset("xlangai/spider", split = "validation")

queries = []

for i in range(max(10,len(test_data))):
    print(f"\n------------------------------------------------------------- Example {i} -----------------------------------------------------------\n")
    question = test_data[i][data_col]

    FastLanguageModel.for_inference(model) # Enable native 2x faster inference

    inputs = tokenizer(
    [
        spider_prompt.format(question,
            "",
        )
    ], return_tensors = "pt").to("cuda")

    outputs = model.generate(**inputs, max_new_tokens = 64, use_cache = True)
    tokenizer.batch_decode(outputs)

    outputs = model.generate(**inputs, max_new_tokens = max_new_tokens, use_cache = True)
    modified_text = tokenizer.batch_decode(outputs)

    query = test_data[i]["query"]
    print(f"Actual query:\n{query}")
    print("="*100)
    queries.append(modified_text[0].split("<answer>")[-1])
    print("\nGenerated text:\n",modified_text[0].split("<answer>")[-1])

Streaming output truncated to the last 5000 lines.
 <bos>"Write a query that answers the following question. Return only the query and no additional explanation."

<question> What is the average, minimum, and maximum age for all French singers? <query> <strong>SELECT avg(age) ,  min(age) ,  max(age) FROM Singer WHERE nationality  =  "French"</strong><eos>

------------------------------------------------------------- Example 6 -----------------------------------------------------------

Actual query:
SELECT song_name ,  song_release_year FROM singer ORDER BY age LIMIT 1
====================================================================================================

Generated text:
 <bos>"Write a query that answers the following question. Return only the query and no additional explanation."

<question> Show the name and the release year of the song by the youngest singer. <query> <strong>SELECT T1.name ,  T1.release_year FROM singer AS T1 JOIN song AS T2 ON T1.singer_id  =  T2.singer_id ORDER BY T1.age LIMIT 1</strong><eos>

------------------------------------------------------------- Example 7 -----------------------------------------------------------

Actual query:
SELECT song_name ,  song_release_year FROM singer ORDER BY age LIMIT 1
====================================================================================================

Generated text:
 <bos>"Write a query that answers the following question. Return only the query and no additional explanation."

<question> What are the names and release years for all the songs of the youngest singer? <query> <strong>SELECT T1.name ,  T1.release_year FROM singer AS T1 JOIN song AS T2 ON T1.singer_id  =  T2.singer_id GROUP BY T1.name ORDER BY T1.age LIMIT 1</strong><eos>

------------------------------------------------------------- Example 8 -----------------------------------------------------------

Actual query:
SELECT DISTINCT country FROM singer WHERE age  >  20
====================================================================================================

Generated text:
 <bos>"Write a query that answers the following question. Return only the query and no additional explanation."

<question> What are all distinct countries where singers above age 20 are from? <query> <strong>SELECT DISTINCT Country FROM Singer WHERE Age > 20</strong><eos>

------------------------------------------------------------- Example 9 -----------------------------------------------------------

Actual query:
SELECT DISTINCT country FROM singer WHERE age  >  20
====================================================================================================

Generated text:
 <bos>"Write a query that answers the following question. Return only the query and no additional explanation."

<question> What are  the different countries with singers above age 20? <query> <strong>SELECT DISTINCT country FROM Singer WHERE age  >  20</strong><eos>

------------------------------------------------------------- Example 10 -----------------------------------------------------------

Actual query:
SELECT country ,  count(*) FROM singer GROUP BY country
====================================================================================================

Generated text:
 <bos>"Write a query that answers the following question. Return only the query and no additional explanation."

<question> Show all countries and the number of singers in each country. <query> <strong>SELECT Country ,  count(*) FROM Singer GROUP BY Country</strong><eos>

------------------------------------------------------------- Example 11 -----------------------------------------------------------

Actual query:
SELECT country ,  count(*) FROM singer GROUP BY country
====================================================================================================

Generated text:
 <bos>"Write a query that answers the following question. Return only the query and no additional explanation."

<question> How many singers are from each country? <query> <strong>SELECT Country ,  count(*) FROM Singer GROUP BY Country</strong><eos>

------------------------------------------------------------- Example 12 -----------------------------------------------------------

Actual query:
SELECT song_name FROM singer WHERE age  >  (SELECT avg(age) FROM singer)
====================================================================================================

Generated text:
 <bos>"Write a query that answers the following question. Return only the query and no additional explanation."

<question> List all song names by singers above the average age. <query> <strong>SELECT Song_Name FROM Singer WHERE Age  >  (SELECT avg(Age) FROM Singer)</strong><eos>

------------------------------------------------------------- Example 13 -----------------------------------------------------------

Actual query:
SELECT song_name FROM singer WHERE age  >  (SELECT avg(age) FROM singer)
====================================================================================================

Generated text:
 <bos>"Write a query that answers the following question. Return only the query and no additional explanation."

<question> What are all the song names by singers who are older than average? <query> <strong>SELECT Song_Name FROM Singer WHERE Age > (SELECT avg(Age) FROM Singer)</strong><eos>

------------------------------------------------------------- Example 14 -----------------------------------------------------------

Actual query:
SELECT LOCATION ,  name FROM stadium WHERE capacity BETWEEN 5000 AND 10000
====================================================================================================

Generated text:
 <bos>"Write a query that answers the following question. Return only the query and no additional explanation."

<question> Show location and name for all stadiums with a capacity between 5000 and 10000. <query> <strong>SELECT location ,  name FROM stadium WHERE capacity BETWEEN 5000 AND 10000</strong><eos>

------------------------------------------------------------- Example 15 -----------------------------------------------------------

Actual query:
SELECT LOCATION ,  name FROM stadium WHERE capacity BETWEEN 5000 AND 10000
====================================================================================================

Generated text:
 <bos>"Write a query that answers the following question. Return only the query and no additional explanation."

<question> What are the locations and names of all stations with capacity between 5000 and 10000? <query> <strong>SELECT Location ,  Name FROM station WHERE Capacity BETWEEN 5000 AND 10000</strong><eos>

------------------------------------------------------------- Example 16 -----------------------------------------------------------

Actual query:
select max(capacity), average from stadium
====================================================================================================

Generated text:
 <bos>"Write a query that answers the following question. Return only the query and no additional explanation."

<question> What is the maximum capacity and the average of all stadiums ? <query> <strong>SELECT max(capacity) ,  avg(capacity) FROM stadium</strong><eos>

------------------------------------------------------------- Example 17 -----------------------------------------------------------

Actual query:
select avg(capacity) ,  max(capacity) from stadium
====================================================================================================

Generated text:
 <bos>"Write a query that answers the following question. Return only the query and no additional explanation."

<question> What is the average and maximum capacities for all stadiums ? <query> <eos>

------------------------------------------------------------- Example 18 -----------------------------------------------------------

Actual query:
SELECT name ,  capacity FROM stadium ORDER BY average DESC LIMIT 1
====================================================================================================

Generated text:
 <bos>"Write a query that answers the following question. Return only the query and no additional explanation."

<question> What is the name and capacity for the stadium with highest average attendance? <query> <strong>SELECT T1.name ,  T1.capacity FROM stadium AS T1 JOIN attendance AS T2 ON T1.id  =  T2.stadium_id GROUP BY T1.id ORDER BY avg(T2.attendance) DESC LIMIT 1</strong><eos>

------------------------------------------------------------- Example 19 -----------------------------------------------------------

Actual query:
SELECT name ,  capacity FROM stadium ORDER BY average DESC LIMIT 1
====================================================================================================

Generated text:
 <bos>"Write a query that answers the following question. Return only the query and no additional explanation."

<question> What is the name and capacity for the stadium with the highest average attendance? <query> <strong>SELECT T1.name ,  T1.capacity FROM stadium AS T1 JOIN attendance AS T2 ON T1.id  =  T2.stadium_id GROUP BY T1.id ORDER BY avg(T2.attendance) DESC LIMIT 1</strong><eos>

------------------------------------------------------------- Example 20 -----------------------------------------------------------

Actual query:
SELECT count(*) FROM concert WHERE YEAR  =  2014 OR YEAR  =  2015
====================================================================================================

Generated text:
 <bos>"Write a query that answers the following question. Return only the query and no additional explanation."

<question> How many concerts are there in year 2014 or 2015? <query> <strong>SELECT count(*) FROM concert WHERE year  =  2014 OR year  =  2015</strong><eos>

------------------------------------------------------------- Example 21 -----------------------------------------------------------

Actual query:
SELECT count(*) FROM concert WHERE YEAR  =  2014 OR YEAR  =  2015
====================================================================================================

Generated text:
 <bos>"Write a query that answers the following question. Return only the query and no additional explanation."

<question> How many concerts occurred in 2014 or 2015? <query> <strong>SELECT count(*) FROM concert WHERE year BETWEEN 2014 AND 2015</strong><eos>

------------------------------------------------------------- Example 22 -----------------------------------------------------------

Actual query:
SELECT T2.name ,  count(*) FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id GROUP BY T1.stadium_id
====================================================================================================

Generated text:
 <bos>"Write a query that answers the following question. Return only the query and no additional explanation."

<question> Show the stadium name and the number of concerts in each stadium. <query> <strong>SELECT stadium_name ,  count(*) FROM concert GROUP BY stadium_name</strong><eos>

------------------------------------------------------------- Example 23 -----------------------------------------------------------

Actual query:
SELECT T2.name ,  count(*) FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id GROUP BY T1.stadium_id
====================================================================================================

Generated text:
 <bos>"Write a query that answers the following question. Return only the query and no additional explanation."

<question> For each stadium, how many concerts play there? <query> <strong>SELECT stadium ,  count(*) FROM concert GROUP BY stadium</strong><eos>

------------------------------------------------------------- Example 24 -----------------------------------------------------------

Actual query:
SELECT T2.name ,  T2.capacity FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id WHERE T1.year  >=  2014 GROUP BY T2.stadium_id ORDER BY count(*) DESC LIMIT 1
====================================================================================================

Generated text:
 <bos>"Write a query that answers the following question. Return only the query and no additional explanation."

<question> Show the stadium name and capacity with most number of concerts in year 2014 or after. <query> <strong>SELECT stadium_name ,  max(capacity) FROM concert WHERE year  >=  2014 GROUP BY stadium_name</strong><eos>

------------------------------------------------------------- Example 25 -----------------------------------------------------------

Actual query:
select t2.name ,  t2.capacity from concert as t1 join stadium as t2 on t1.stadium_id  =  t2.stadium_id where t1.year  >  2013 group by t2.stadium_id order by count(*) desc limit 1
====================================================================================================

Generated text:
 <bos>"Write a query that answers the following question. Return only the query and no additional explanation."

<question> What is the name and capacity of the stadium with the most concerts after 2013 ? <query> <strong>SELECT T1.name ,  T1.capacity FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.id WHERE T1.year  >  2013 GROUP BY T1.name ORDER BY count(*) DESC LIMIT 1</strong><eos>

------------------------------------------------------------- Example 26 -----------------------------------------------------------

Actual query:
SELECT YEAR FROM concert GROUP BY YEAR ORDER BY count(*) DESC LIMIT 1
====================================================================================================

Generated text:
 <bos>"Write a query that answers the following question. Return only the query and no additional explanation."

<question> Which year has most number of concerts? <query> <strong>SELECT year FROM concert GROUP BY year ORDER BY count(*) DESC LIMIT 1</strong><eos>

------------------------------------------------------------- Example 27 -----------------------------------------------------------

Actual query:
SELECT YEAR FROM concert GROUP BY YEAR ORDER BY count(*) DESC LIMIT 1
====================================================================================================

Generated text:
 <bos>"Write a query that answers the following question. Return only the query and no additional explanation."

<question> What is the year that had the most concerts? <query> <strong>SELECT year FROM concert GROUP BY year ORDER BY count(*) DESC LIMIT 1</strong><eos>

------------------------------------------------------------- Example 28 -----------------------------------------------------------

Actual query:
SELECT name FROM stadium WHERE stadium_id NOT IN (SELECT stadium_id FROM concert)
====================================================================================================

Generated text:
 <bos>"Write a query that answers the following question. Return only the query and no additional explanation."

<question> Show the stadium names without any concert. <query> <strong>SELECT stadium_name FROM concert_info WHERE concert_id NOT IN (SELECT concert_id FROM concert_info WHERE concert_id IN (SELECT concert_id FROM concert_info GROUP BY concert_id HAVING count(*)  >  1))</strong><eos>

------------------------------------------------------------- Example 29 -----------------------------------------------------------

Actual query:
SELECT name FROM stadium WHERE stadium_id NOT IN (SELECT stadium_id FROM concert)
====================================================================================================

Generated text:
 <bos>"Write a query that answers the following question. Return only the query and no additional explanation."

<question> What are the names of the stadiums without any concerts? <query> <strong>SELECT stadium_name FROM stadium WHERE stadium_id NOT IN (SELECT stadium_id FROM concert)</strong><eos>

------------------------------------------------------------- Example 30 -----------------------------------------------------------

Actual query:
SELECT country FROM singer WHERE age  >  40 INTERSECT SELECT country FROM singer WHERE age  <  30
====================================================================================================

Generated text:
 <bos>"Write a query that answers the following question. Return only the query and no additional explanation."

<question> Show countries where a singer above age 40 and a singer below 30 are from. <query> <strong>SELECT Country FROM Singer WHERE Age  >  40 UNION SELECT Country FROM Singer WHERE Age  <  30</strong><eos>

------------------------------------------------------------- Example 31 -----------------------------------------------------------

Actual query:
SELECT name FROM stadium EXCEPT SELECT T2.name FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id WHERE T1.year  =  2014
====================================================================================================

Generated text:
 <bos>"Write a query that answers the following question. Return only the query and no additional explanation."

<question> Show names for all stadiums except for stadiums having a concert in year 2014. <query> <strong>SELECT T1.name FROM stadium AS T1 EXCEPT SELECT T2.name FROM stadium AS T2 JOIN concert AS T3 ON T2.id  =  T3.stadium_id WHERE T3.year  =  2014</strong><eos>

------------------------------------------------------------- Example 32 -----------------------------------------------------------

Actual query:
SELECT name FROM stadium EXCEPT SELECT T2.name FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id WHERE T1.year  =  2014
====================================================================================================

Generated text:
 <bos>"Write a query that answers the following question. Return only the query and no additional explanation."

<question> What are the names of all stadiums that did not have a concert in 2014? <query> <strong>SELECT stadium_name FROM concert WHERE year != 2014</strong><eos>

------------------------------------------------------------- Example 33 -----------------------------------------------------------

Actual query:
SELECT T2.concert_name ,  T2.theme ,  count(*) FROM singer_in_concert AS T1 JOIN concert AS T2 ON T1.concert_id  =  T2.concert_id GROUP BY T2.concert_id
====================================================================================================

Generated text:
 <bos>"Write a query that answers the following question. Return only the query and no additional explanation."

<question> Show the name and theme for all concerts and the number of singers in each concert. <query> <strong>SELECT T1.name ,  T1.theme ,  count(*) FROM concert AS T1 JOIN singer AS T2 ON T1.concert_id  =  T2.concert_id GROUP BY T1.name ,  T1.theme</strong><eos>

------------------------------------------------------------- Example 34 -----------------------------------------------------------

Actual query:
select t2.concert_name ,  t2.theme ,  count(*) from singer_in_concert as t1 join concert as t2 on t1.concert_id  =  t2.concert_id group by t2.concert_id
====================================================================================================

Generated text:
 <bos>"Write a query that answers the following question. Return only the query and no additional explanation."

<question> What are the names , themes , and number of singers for every concert ? <query> <strong>SELECT T1.name , T1.theme , T1.num_of_singers FROM concert AS T1</strong><eos>

------------------------------------------------------------- Example 35 -----------------------------------------------------------

Actual query:
SELECT T2.name ,  count(*) FROM singer_in_concert AS T1 JOIN singer AS T2 ON T1.singer_id  =  T2.singer_id GROUP BY T2.singer_id

RecursionError: maximum recursion depth exceeded in comparison

In [ ]:
len(queries)

460

In [ ]:
mod_queries = []
for q in range(len(queries)):
  print(f"Actual query:\n{test_data[q]['query']}")
  print(f"Generated text:\n{queries[q].split('<query>')[-1]}")
  mod_queries.append(queries[q].split('<query>')[-1])
  print("="*100)

Actual query:
SELECT count(*) FROM singer
Generated text:
 <strong>SELECT count(*) FROM Singer</strong><eos>
====================================================================================================
Actual query:
SELECT count(*) FROM singer
Generated text:
 <strong>SELECT count(*) FROM Singer</strong><eos>
====================================================================================================
Actual query:
SELECT name ,  country ,  age FROM singer ORDER BY age DESC
Generated text:
 <strong>SELECT name ,  country ,  age FROM singer ORDER BY age DESC</strong><eos>
====================================================================================================
Actual query:
SELECT name ,  country ,  age FROM singer ORDER BY age DESC
Generated text:
 <strong>SELECT name ,  country ,  age FROM Singer ORDER BY age DESC</strong><eos>
====================================================================================================
Actual query:
SELECT avg(age) ,  min(age) ,  max(age) FROM singer WHERE country  =  'France'
Generated text:
 <strong>SELECT avg(age) ,  min(age) ,  max(age) FROM singer WHERE country  =  "France"</strong><eos>
====================================================================================================
Actual query:
SELECT avg(age) ,  min(age) ,  max(age) FROM singer WHERE country  =  'France'
Generated text:
 <strong>SELECT avg(age) ,  min(age) ,  max(age) FROM Singer WHERE nationality  =  "French"</strong><eos>
====================================================================================================
Actual query:
SELECT song_name ,  song_release_year FROM singer ORDER BY age LIMIT 1
Generated text:
 <strong>SELECT T1.name ,  T1.release_year FROM singer AS T1 JOIN song AS T2 ON T1.singer_id  =  T2.singer_id ORDER BY T1.age LIMIT 1</strong><eos>
====================================================================================================
Actual query:
SELECT song_name ,  song_release_year FROM singer ORDER BY age LIMIT 1
Generated text:
 <strong>SELECT T1.name ,  T1.release_year FROM singer AS T1 JOIN song AS T2 ON T1.singer_id  =  T2.singer_id GROUP BY T1.name ORDER BY T1.age LIMIT 1</strong><eos>
====================================================================================================
Actual query:
SELECT DISTINCT country FROM singer WHERE age  >  20
Generated text:
 <strong>SELECT DISTINCT Country FROM Singer WHERE Age > 20</strong><eos>
====================================================================================================
Actual query:
SELECT DISTINCT country FROM singer WHERE age  >  20
Generated text:
 <strong>SELECT DISTINCT country FROM Singer WHERE age  >  20</strong><eos>
====================================================================================================
Actual query:
SELECT country ,  count(*) FROM singer GROUP BY country
Generated text:
 <strong>SELECT Country ,  count(*) FROM Singer GROUP BY Country</strong><eos>
====================================================================================================
Actual query:
SELECT country ,  count(*) FROM singer GROUP BY country
Generated text:
 <strong>SELECT Country ,  count(*) FROM Singer GROUP BY Country</strong><eos>
====================================================================================================
Actual query:
SELECT song_name FROM singer WHERE age  >  (SELECT avg(age) FROM singer)
Generated text:
 <strong>SELECT Song_Name FROM Singer WHERE Age  >  (SELECT avg(Age) FROM Singer)</strong><eos>
====================================================================================================
Actual query:
SELECT song_name FROM singer WHERE age  >  (SELECT avg(age) FROM singer)
Generated text:
 <strong>SELECT Song_Name FROM Singer WHERE Age > (SELECT avg(Age) FROM Singer)</strong><eos>
====================================================================================================
Actual query:
SELECT LOCATION ,  name FROM stadium WHERE capacity BETWEEN 5000 AND 10000
Generated text:
 <strong>SELECT location ,  name FROM stadium WHERE capacity BETWEEN 5000 AND 10000</strong><eos>
====================================================================================================
Actual query:
SELECT LOCATION ,  name FROM stadium WHERE capacity BETWEEN 5000 AND 10000
Generated text:
 <strong>SELECT Location ,  Name FROM station WHERE Capacity BETWEEN 5000 AND 10000</strong><eos>
====================================================================================================
Actual query:
select max(capacity), average from stadium
Generated text:
 <strong>SELECT max(capacity) ,  avg(capacity) FROM stadium</strong><eos>
====================================================================================================
Actual query:
select avg(capacity) ,  max(capacity) from stadium
Generated text:
 <eos>
====================================================================================================
Actual query:
SELECT name ,  capacity FROM stadium ORDER BY average DESC LIMIT 1
Generated text:
 <strong>SELECT T1.name ,  T1.capacity FROM stadium AS T1 JOIN attendance AS T2 ON T1.id  =  T2.stadium_id GROUP BY T1.id ORDER BY avg(T2.attendance) DESC LIMIT 1</strong><eos>
====================================================================================================
Actual query:
SELECT name ,  capacity FROM stadium ORDER BY average DESC LIMIT 1
Generated text:
 <strong>SELECT T1.name ,  T1.capacity FROM stadium AS T1 JOIN attendance AS T2 ON T1.id  =  T2.stadium_id GROUP BY T1.id ORDER BY avg(T2.attendance) DESC LIMIT 1</strong><eos>
====================================================================================================
Actual query:
SELECT count(*) FROM concert WHERE YEAR  =  2014 OR YEAR  =  2015
Generated text:
 <strong>SELECT count(*) FROM concert WHERE year  =  2014 OR year  =  2015</strong><eos>
====================================================================================================
Actual query:
SELECT count(*) FROM concert WHERE YEAR  =  2014 OR YEAR  =  2015
Generated text:
 <strong>SELECT count(*) FROM concert WHERE year BETWEEN 2014 AND 2015</strong><eos>
====================================================================================================
Actual query:
SELECT T2.name ,  count(*) FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id GROUP BY T1.stadium_id
Generated text:
 <strong>SELECT stadium_name ,  count(*) FROM concert GROUP BY stadium_name</strong><eos>
====================================================================================================
Actual query:
SELECT T2.name ,  count(*) FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id GROUP BY T1.stadium_id
Generated text:
 <strong>SELECT stadium ,  count(*) FROM concert GROUP BY stadium</strong><eos>
====================================================================================================
Actual query:
SELECT T2.name ,  T2.capacity FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id WHERE T1.year  >=  2014 GROUP BY T2.stadium_id ORDER BY count(*) DESC LIMIT 1
Generated text:
 <strong>SELECT stadium_name ,  max(capacity) FROM concert WHERE year  >=  2014 GROUP BY stadium_name</strong><eos>
====================================================================================================
Actual query:
select t2.name ,  t2.capacity from concert as t1 join stadium as t2 on t1.stadium_id  =  t2.stadium_id where t1.year  >  2013 group by t2.stadium_id order by count(*) desc limit 1
Generated text:
 <strong>SELECT T1.name ,  T1.capacity FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.id WHERE T1.year  >  2013 GROUP BY T1.name ORDER BY count(*) DESC LIMIT 1</strong><eos>
====================================================================================================
Actual query:
SELECT YEAR FROM concert GROUP BY YEAR ORDER BY count(*) DESC LIMIT 1
Generated text:
 <strong>SELECT year FROM concert GROUP BY year ORDER BY count(*) DESC LIMIT 1</strong><eos>
====================================================================================================
Actual query:
SELECT YEAR FROM concert GROUP BY YEAR ORDER BY count(*) DESC LIMIT 1
Generated text:
 <strong>SELECT year FROM concert GROUP BY year ORDER BY count(*) DESC LIMIT 1</strong><eos>
====================================================================================================
Actual query:
SELECT name FROM stadium WHERE stadium_id NOT IN (SELECT stadium_id FROM concert)
Generated text:
 <strong>SELECT stadium_name FROM concert_info WHERE concert_id NOT IN (SELECT concert_id FROM concert_info WHERE concert_id IN (SELECT concert_id FROM concert_info GROUP BY concert_id HAVING count(*)  >  1))</strong><eos>
====================================================================================================
Actual query:
SELECT name FROM stadium WHERE stadium_id NOT IN (SELECT stadium_id FROM concert)
Generated text:
 <strong>SELECT stadium_name FROM stadium WHERE stadium_id NOT IN (SELECT stadium_id FROM concert)</strong><eos>
====================================================================================================
Actual query:
SELECT country FROM singer WHERE age  >  40 INTERSECT SELECT country FROM singer WHERE age  <  30
Generated text:
 <strong>SELECT Country FROM Singer WHERE Age  >  40 UNION SELECT Country FROM Singer WHERE Age  <  30</strong><eos>
====================================================================================================
Actual query:
SELECT name FROM stadium EXCEPT SELECT T2.name FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id WHERE T1.year  =  2014
Generated text:
 <strong>SELECT T1.name FROM stadium AS T1 EXCEPT SELECT T2.name FROM stadium AS T2 JOIN concert AS T3 ON T2.id  =  T3.stadium_id WHERE T3.year  =  2014</strong><eos>
====================================================================================================
Actual query:
SELECT name FROM stadium EXCEPT SELECT T2.name FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id WHERE T1.year  =  2014
Generated text:
 <strong>SELECT stadium_name FROM concert WHERE year != 2014</strong><eos>
====================================================================================================
Actual query:
SELECT T2.concert_name ,  T2.theme ,  count(*) FROM singer_in_concert AS T1 JOIN concert AS T2 ON T1.concert_id  =  T2.concert_id GROUP BY T2.concert_id
Generated text:
 <strong>SELECT T1.name ,  T1.theme ,  count(*) FROM concert AS T1 JOIN singer AS T2 ON T1.concert_id  =  T2.concert_id GROUP BY T1.name ,  T1.theme</strong><eos>
====================================================================================================
Actual query:
select t2.concert_name ,  t2.theme ,  count(*) from singer_in_concert as t1 join concert as t2 on t1.concert_id  =  t2.concert_id group by t2.concert_id
Generated text:
 <strong>SELECT T1.name , T1.theme , T1.num_of_singers FROM concert AS T1</strong><eos>
====================================================================================================
Actual query:
SELECT T2.name ,  count(*) FROM singer_in_concert AS T1 JOIN singer AS T2 ON T1.singer_id  =  T2.singer_id GROUP BY T2.singer_id
Generated text:
 <strong>SELECT Singer_Name ,  count(*) FROM Concert GROUP BY Singer_Name</strong><eos>
====================================================================================================
Actual query:
SELECT T2.name ,  count(*) FROM singer_in_concert AS T1 JOIN singer AS T2 ON T1.singer_id  =  T2.singer_id GROUP BY T2.singer_id
Generated text:
 <strong>SELECT T1.name ,  count(*) FROM Singer AS T1 JOIN Concert AS T2 ON T1.Singer_ID  =  T2.Singer_ID GROUP BY T1.name</strong><eos>
====================================================================================================
Actual query:
SELECT T2.name FROM singer_in_concert AS T1 JOIN singer AS T2 ON T1.singer_id  =  T2.singer_id JOIN concert AS T3 ON T1.concert_id  =  T3.concert_id WHERE T3.year  =  2014
Generated text:
 <strong>SELECT Singer FROM concerts WHERE Year  =  2014</strong><eos>
====================================================================================================
Actual query:
SELECT T2.name FROM singer_in_concert AS T1 JOIN singer AS T2 ON T1.singer_id  =  T2.singer_id JOIN concert AS T3 ON T1.concert_id  =  T3.concert_id WHERE T3.year  =  2014
Generated text:
 <strong>SELECT T1.name FROM Singer AS T1 JOIN Concert AS T2 ON T1.singer_id  =  T2.singer_id WHERE T2.year  =  2014</strong><eos>
====================================================================================================
Actual query:
SELECT name ,  country FROM singer WHERE song_name LIKE '%Hey%'
Generated text:
 <strong>SELECT T1.name ,  T1.nation FROM Singer AS T1 JOIN Song AS T2 ON T1.Singer_ID  =  T2.Singer_ID WHERE T2.Song_Name LIKE '%Hey%'</strong><eos>
====================================================================================================
Actual query:
SELECT name ,  country FROM singer WHERE song_name LIKE '%Hey%'
Generated text:
 <strong>SELECT T1.name ,  T1.country FROM Singer AS T1 JOIN Song AS T2 ON T1.singer_id  =  T2.singer_id WHERE T2.title LIKE '%Hey%'</strong><eos>
====================================================================================================
Actual query:
SELECT T2.name ,  T2.location FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id WHERE T1.Year  =  2014 INTERSECT SELECT T2.name ,  T2.location FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id WHERE T1.Year  =  2015
Generated text:
 <strong>SELECT T1.name ,  T1.location FROM stadium AS T1 JOIN concert AS T2 ON T1.id  =  T2.stadium_id WHERE T2.year  =  2014 AND T2.year  =  2015</strong><eos>
====================================================================================================
Actual query:
SELECT T2.name ,  T2.location FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id WHERE T1.Year  =  2014 INTERSECT SELECT T2.name ,  T2.location FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id WHERE T1.Year  =  2015
Generated text:
 <strong>SELECT T1.name ,  T1.location FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id WHERE T1.year  =  2014 AND T1.year  =  2015</strong><eos>
====================================================================================================
Actual query:
select count(*) from concert where stadium_id = (select stadium_id from stadium order by capacity desc limit 1)
Generated text:
 <strong>SELECT count(*) FROM concert WHERE stadium_id  =  (SELECT stadium_id FROM stadium ORDER BY capacity DESC LIMIT 1)</strong><eos>
====================================================================================================
Actual query:
select count(*) from concert where stadium_id = (select stadium_id from stadium order by capacity desc limit 1)
Generated text:
 <strong>SELECT count(*) FROM concert WHERE stadium_id  =  (SELECT stadium_id FROM stadium ORDER BY capacity DESC LIMIT 1)</strong><eos>
====================================================================================================
Actual query:
SELECT count(*) FROM pets WHERE weight  >  10
Generated text:
 <strong>SELECT count(*) FROM pets WHERE weight > 10</strong><eos>
====================================================================================================
Actual query:
SELECT count(*) FROM pets WHERE weight  >  10
Generated text:
 <strong>SELECT count(*) FROM pets WHERE weight > 10</strong><eos>
====================================================================================================
Actual query:
SELECT weight FROM pets ORDER BY pet_age LIMIT 1
Generated text:
 <strong>SELECT weight FROM dog ORDER BY age LIMIT 1</strong><eos>
====================================================================================================
Actual query:
SELECT weight FROM pets ORDER BY pet_age LIMIT 1
Generated text:
 <strong>SELECT weight FROM dog ORDER BY age LIMIT 1</strong><eos>
====================================================================================================
Actual query:
SELECT max(weight) ,  petType FROM pets GROUP BY petType
Generated text:
 <strong>SELECT max(weight) ,  pet_type FROM pets GROUP BY pet_type</strong><eos>
====================================================================================================
Actual query:
SELECT max(weight) ,  petType FROM pets GROUP BY petType
Generated text:
 <strong>SELECT max(weight) ,  type FROM pets GROUP BY type</strong><eos>
====================================================================================================
Actual query:
SELECT count(*) FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid WHERE T1.age  >  20
Generated text:
 <strong>SELECT count(*) FROM student WHERE age > 20</strong><eos>
====================================================================================================
Actual query:
SELECT count(*) FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid WHERE T1.age  >  20
Generated text:
 <strong>SELECT count(*) FROM student_pet WHERE student_age  >  20</strong><eos>
====================================================================================================
Actual query:
SELECT count(*) FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T2.petid  =  T3.petid WHERE T1.sex  =  'F' AND T3.pettype  =  'dog'
Generated text:
 <strong>SELECT count(*) FROM student WHERE sex  =  "F" AND pet  =  "dog"</strong><eos>
====================================================================================================
Actual query:
SELECT count(*) FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T2.petid  =  T3.petid WHERE T1.sex  =  'F' AND T3.pettype  =  'dog'
Generated text:
 <strong>SELECT count(*) FROM student WHERE gender  =  "F" AND pet_type  =  "dog"</strong><eos>
====================================================================================================
Actual query:
SELECT count(DISTINCT pettype) FROM pets
Generated text:
 <strong>SELECT count(DISTINCT type) FROM pets</strong><eos>
====================================================================================================
Actual query:
SELECT count(DISTINCT pettype) FROM pets
Generated text:
 <strong>SELECT count(DISTINCT type) FROM pets</strong><eos>
====================================================================================================
Actual query:
SELECT DISTINCT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat' OR T3.pettype  =  'dog'
Generated text:
 <strong>SELECT T1.first_name FROM student AS T1 JOIN pet AS T2 ON T1.student_id  =  T2.student_id WHERE T2.pet_name  =  "cat" OR T2.pet_name  =  "dog"</strong><eos>
====================================================================================================
Actual query:
SELECT DISTINCT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat' OR T3.pettype  =  'dog'
Generated text:
 <strong>SELECT T1.first_name FROM student AS T1 JOIN pet AS T2 ON T1.student_id  =  T2.student_id WHERE T2.pet_name  =  "cat" OR T2.pet_name  =  "dog"</strong><eos>
====================================================================================================
Actual query:
select t1.fname from student as t1 join has_pet as t2 on t1.stuid  =  t2.stuid join pets as t3 on t3.petid  =  t2.petid where t3.pettype  =  'cat' intersect select t1.fname from student as t1 join has_pet as t2 on t1.stuid  =  t2.stuid join pets as t3 on t3.petid  =  t2.petid where t3.pettype  =  'dog'

In [ ]:
from datasets import load_dataset
import pandas as pd
dataset = load_dataset("xlangai/spider", split = "validation")
val_df = pd.DataFrame(dataset)
display(val_df.head())
val_df = val_df[:len(mod_queries)]

,db_id,query,question,query_toks,query_toks_no_value,question_toks
0,concert_singer,SELECT count(*) FROM singer,How many singers do we have?,"[SELECT, count, (, *, ), FROM, singer]","[select, count, (, *, ), from, singer]","[How, many, singers, do, we, have, ?]"
1,concert_singer,SELECT count(*) FROM singer,What is the total number of singers?,"[SELECT, count, (, *, ), FROM, singer]","[select, count, (, *, ), from, singer]","[What, is, the, total, number, of, singers, ?]"
2,concert_singer,"SELECT name , country , age FROM singer ORDE...","Show name, country, age for all singers ordere...","[SELECT, name, ,, country, ,, age, FROM, singe...","[select, name, ,, country, ,, age, from, singe...","[Show, name, ,, country, ,, age, for, all, sin..."
3,concert_singer,"SELECT name , country , age FROM singer ORDE...","What are the names, countries, and ages for ev...","[SELECT, name, ,, country, ,, age, FROM, singe...","[select, name, ,, country, ,, age, from, singe...","[What, are, the, names, ,, countries, ,, and, ..."
4,concert_singer,"SELECT avg(age) , min(age) , max(age) FROM s...","What is the average, minimum, and maximum age ...","[SELECT, avg, (, age, ), ,, min, (, age, ), ,,...","[select, avg, (, age, ), ,, min, (, age, ), ,,...","[What, is, the, average, ,, minimum, ,, and, m..."

In [ ]:
val_df["complete_generation"] = queries
val_df["generated_queries"] = mod_queries
val_df.head(10)

,db_id,query,question,query_toks,query_toks_no_value,question_toks,generated_queries,complete_generation
0,concert_singer,SELECT count(*) FROM singer,How many singers do we have?,"[SELECT, count, (, *, ), FROM, singer]","[select, count, (, *, ), from, singer]","[How, many, singers, do, we, have, ?]",<strong>SELECT count(*) FROM Singer</strong><...,"<bos>""Write a query that answers the following..."
1,concert_singer,SELECT count(*) FROM singer,What is the total number of singers?,"[SELECT, count, (, *, ), FROM, singer]","[select, count, (, *, ), from, singer]","[What, is, the, total, number, of, singers, ?]",<strong>SELECT count(*) FROM Singer</strong><...,"<bos>""Write a query that answers the following..."
2,concert_singer,"SELECT name , country , age FROM singer ORDE...","Show name, country, age for all singers ordere...","[SELECT, name, ,, country, ,, age, FROM, singe...","[select, name, ,, country, ,, age, from, singe...","[Show, name, ,, country, ,, age, for, all, sin...","<strong>SELECT name , country , age FROM si...","<bos>""Write a query that answers the following..."
3,concert_singer,"SELECT name , country , age FROM singer ORDE...","What are the names, countries, and ages for ev...","[SELECT, name, ,, country, ,, age, FROM, singe...","[select, name, ,, country, ,, age, from, singe...","[What, are, the, names, ,, countries, ,, and, ...","<strong>SELECT name , country , age FROM Si...","<bos>""Write a query that answers the following..."
4,concert_singer,"SELECT avg(age) , min(age) , max(age) FROM s...","What is the average, minimum, and maximum age ...","[SELECT, avg, (, age, ), ,, min, (, age, ), ,,...","[select, avg, (, age, ), ,, min, (, age, ), ,,...","[What, is, the, average, ,, minimum, ,, and, m...","<strong>SELECT avg(age) , min(age) , max(ag...","<bos>""Write a query that answers the following..."
5,concert_singer,"SELECT avg(age) , min(age) , max(age) FROM s...","What is the average, minimum, and maximum age ...","[SELECT, avg, (, age, ), ,, min, (, age, ), ,,...","[select, avg, (, age, ), ,, min, (, age, ), ,,...","[What, is, the, average, ,, minimum, ,, and, m...","<strong>SELECT avg(age) , min(age) , max(ag...","<bos>""Write a query that answers the following..."
6,concert_singer,"SELECT song_name , song_release_year FROM sin...",Show the name and the release year of the song...,"[SELECT, song_name, ,, song_release_year, FROM...","[select, song_name, ,, song_release_year, from...","[Show, the, name, and, the, release, year, of,...","<strong>SELECT T1.name , T1.release_year FRO...","<bos>""Write a query that answers the following..."
7,concert_singer,"SELECT song_name , song_release_year FROM sin...",What are the names and release years for all t...,"[SELECT, song_name, ,, song_release_year, FROM...","[select, song_name, ,, song_release_year, from...","[What, are, the, names, and, release, years, f...","<strong>SELECT T1.name , T1.release_year FRO...","<bos>""Write a query that answers the following..."
8,concert_singer,SELECT DISTINCT country FROM singer WHERE age ...,What are all distinct countries where singers ...,"[SELECT, DISTINCT, country, FROM, singer, WHER...","[select, distinct, country, from, singer, wher...","[What, are, all, distinct, countries, where, s...",<strong>SELECT DISTINCT Country FROM Singer W...,"<bos>""Write a query that answers the following..."
9,concert_singer,SELECT DISTINCT country FROM singer WHERE age ...,What are the different countries with singers...,"[SELECT, DISTINCT, country, FROM, singer, WHER...","[select, distinct, country, from, singer, wher...","[What, are, the, different, countries, with, s...",<strong>SELECT DISTINCT country FROM Singer W...,"<bos>""Write a query that answers the following..."

In [ ]:
val_df.to_csv("/content/drive/MyDrive/NLP/gemma7b_finetuned_output.csv",index=False)